[
 {
  "code": "ECE 5",
  "title": "Introduction to Electrical and Computer Engineering",
  "unit": "4",
  "description": "An introduction to electrical and computer engineering. Topics include circuit\ntheory, assembly, and testing, embedded systems programming and debugging,\ntransducer mechanisms and interfacing transducers, signals and systems theory,\ndigital signal processing, and modular design techniques.",
  "prerequisite": "priority enrollment given to engineering majors EC04, EC26, EC27, EC28, and\nEC37.",
  "formatted_pre": []
 },
 {
  "code": "ECE 15",
  "title": "Engineering Computation",
  "unit": "4",
  "description": "Students learn the C programming language with an emphasis on high-performance\nnumerical computation. The commonality across programming languages of control\nstructures, data structures, and I/O is also covered. Techniques for using\nMatlab to graph the results of C computations are developed.",
  "prerequisite": "a familiarity with basic mathematics such as trigonometry\nfunctions and graphing is expected but this course assumes no prior\nprogramming knowledge.",
  "formatted_pre": []
 },
 {
  "code": "ECE 16",
  "title": "Rapid Hardware and Software Design for Interfacing with the World",
  "unit": "4",
  "description": "Students are introduced to embedded systems concepts with structured\ndevelopment of a computer controller based on electromyogram (EMG) signals\nthrough four lab assignments through the quarter. Key concepts include\nsampling, signal processing, communication, and real-time control. Students\nwill apply their prior knowledge in C (from ECE15) to program microcontrollers\nand will engage in data analysis using the Python programming language.",
  "prerequisite": "MAE 8 or CSE 8B or CSE 11 or ECE 15.",
  "formatted_pre": [
   [
    "MAE 8",
    "CSE 8B",
    "CSE 11",
    "ECE 15"
   ]
  ]
 },
 {
  "code": "ECE 17",
  "title": "Object-Oriented Programming: Design and Development with C++",
  "unit": "4",
  "description": "This course combines the fundamentals of object-oriented design in C++, with\nthe programming, debugging, and testing practices used by modern software\ndevelopers. Emphasizes the use of object-oriented techniques to model and\nreason about system design, and using modern C++ idioms, design patterns, and\nthe Standard Template Library (STL) to develop solutions to systems\nengineering challenges that are more reliable, robust, scalable, and secure.",
  "prerequisite": "CSE 8B or CSE 11 or ECE 15.",
  "formatted_pre": [
   [
    "CSE 8B",
    "CSE 11",
    "ECE 15"
   ]
  ]
 },
 {
  "code": "ECE 25",
  "title": "Introduction to Digital Design",
  "unit": "4",
  "description": "This course emphasizes digital electronics. Principles introduced in lectures\nare used in laboratory assignments, which also serve to introduce experimental\nand design methods. Topics include Boolean algebra, combination and sequential\nlogic, gates and their implementation in digital circuits. (Course materials\nand/or program fees may apply.)",
  "prerequisite": "none.",
  "formatted_pre": []
 },
 {
  "code": "ECE 30",
  "title": "Introduction to Computer Engineering",
  "unit": "4",
  "description": "The fundamentals of both the hardware and software in a computer system.\nTopics include representation of information, computer organization and\ndesign, assembly and microprogramming, current technology in logic design.",
  "prerequisite": "ECE 15 and 25 with grades of C- or better.",
  "formatted_pre": [
   [
    "ECE 15"
   ],
   [
    "ECE 25"
   ]
  ]
 },
 {
  "code": "ECE 35",
  "title": "Introduction to Analog Design",
  "unit": "4",
  "description": "Fundamental circuit theory concepts, Kirchhoff's voltage and current laws,\nThevenin's and Norton's theorems, loop and node analysis, time-varying\nsignals, transient first order circuits, steady-state sinusoidal response.\nMATH 20C and PHYS 2B must be taken concurrently. Program or materials fees may\napply.",
  "prerequisite": "MATH 18, 20A-B, and PHYS 2A.",
  "formatted_pre": [
   [
    "MATH 18"
   ],
   [
    "MATH 20A"
   ],
   [
    "PHYS 2A"
   ]
  ]
 },
 {
  "code": "ECE 45",
  "title": "Circuits and Systems",
  "unit": "4",
  "description": "Steady-state circuit analysis, first and second order systems, Fourier Series\nand Transforms, time domain analysis, convolution, transient response, Laplace\nTransform, and filter design.",
  "prerequisite": "ECE 35.",
  "formatted_pre": [
   [
    "ECE 35"
   ]
  ]
 },
 {
  "code": "ECE 65",
  "title": "Components and Circuits Laboratory",
  "unit": "4",
  "description": "Introduction to linear and nonlinear components and circuits. Topics will\ninclude two terminal devices, bipolar and field-effect transistors, and large\nand small signal analysis of diode and transistor circuits. (Program or\nmaterials fees may apply.)",
  "prerequisite": "ECE 35.",
  "formatted_pre": [
   [
    "ECE 35"
   ]
  ]
 },
 {
  "code": "ECE 85",
  "title": "iTunes 101: A Survey of Information Technology",
  "unit": "4",
  "description": "Topics include how devices such as iPods and iPhones generate, transmit,\nreceive, and process information (music, images, video, etc.), the\nrelationship between technology and issues such as privacy and \"net\nneutrality,\" and current topics related to information technology.",
  "prerequisite": "none.",
  "formatted_pre": []
 },
 {
  "code": "ECE 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar program is designed to provide new students\nwith the opportunity to explore an intellectual topic with a faculty member in\na small seminar setting. First-year student seminars are offered in all campus\ndepartments and undergraduate colleges, and topics vary from quarter to\nquarter. Enrollment is limited to fifteen to twenty students, with preference\ngiven to entering first-year students.",
  "prerequisite": "none.",
  "formatted_pre": []
 },
 {
  "code": "ECE 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "description": "This seminar class will provide a broad review of current research topics in\nboth electrical engineering and computer engineering. Typical subject areas\nare signal processing, VLSI design, electronic materials and devices, radio\nastronomy, communications, and optical computing.",
  "prerequisite": "none.",
  "formatted_pre": []
 },
 {
  "code": "ECE 100",
  "title": "Linear Electronic Systems",
  "unit": "4",
  "description": "Linear active circuit and system design. Topics include frequency response;\nuse of Laplace transforms; design and stability of filters using operational\namplifiers. Integrated lab and lecture involves analysis, design, simulation,\nand testing of circuits and systems. Program or materials fees may apply.",
  "prerequisite": "ECE 45 and ECE 65. ECE 65 may be taken concurrently.",
  "formatted_pre": [
   [
    "ECE 45"
   ],
   [
    "ECE 65"
   ]
  ]
 },
 {
  "code": "ECE 101",
  "title": "Linear Systems Fundamentals",
  "unit": "4",
  "description": "Complex variables. Singularities and residues. Signal and system analysis in\ncontinuous and discrete time. Fourier series and transforms. Laplace and\nz-transforms. Linear Time Invariant Systems. Impulse response, frequency\nresponse, and transfer functions. Poles and zeros. Stability. Convolution.\nSampling. Aliasing.",
  "prerequisite": "ECE 45 with grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 45"
   ]
  ]
 },
 {
  "code": "ECE 102",
  "title": "Introduction to Active Circuit Design",
  "unit": "4",
  "description": "Nonlinear active circuits design. Nonlinear device models for diodes, bipolar\nand field-effect transistors. Linearization of device models and small-signal\nequivalent circuits. Circuit designs will be simulated by computer and tested\nin the laboratory.",
  "prerequisite": "ECE 65 and ECE 100. ECE 100 can be taken\nconcurrently.",
  "formatted_pre": [
   [
    "ECE 65"
   ],
   [
    "ECE 100"
   ]
  ]
 },
 {
  "code": "ECE 103",
  "title": "Fundamentals of Devices and Materials",
  "unit": "4",
  "description": "Introduction to semiconductor materials and devices. Semiconductor crystal\nstructure, energy bands, doping, carrier statistics, drift and diffusion, p-n\njunctions, metal-semiconductor junctions. Bipolar junction transistors:\ncurrent flow, amplification, switching, nonideal behavior. Metal-oxide-\nsemiconductor structures, MOSFETs, device scaling.",
  "prerequisite": "ECE 65\nand PHYS 2D or PHYS 4D and 4E.",
  "formatted_pre": [
   [
    "ECE 65"
   ],
   [
    "PHYS 2D",
    "PHYS 4D"
   ],
   [
    "PHYS 4E"
   ]
  ]
 },
 {
  "code": "ECE 107",
  "title": "Electromagnetism",
  "unit": "4",
  "description": "Electrostatics and magnetostatics; electrodynamics; Maxwell's equations; plane\nwaves; skin effect. Electromagnetics of transmission lines: reflection and\ntransmission at discontinuities, Smith chart, pulse propagation, dispersion.\nRectangular waveguides. Dielectric and magnetic properties of materials.\nElectromagnetics of circuits.",
  "prerequisite": "PHYS 2A-C or 4A-C and ECE 45.",
  "formatted_pre": [
   [
    "PHYS 2A",
    "PHYS 4A"
   ],
   [
    "ECE 45"
   ]
  ]
 },
 {
  "code": "ECE 108",
  "title": "Digital Circuits",
  "unit": "4",
  "description": "A transistor-level view of digital integrated circuits. CMOS combinational\nlogic, ratioed logic, noise margins, rise and fall delays, power dissipation,\ntransmission gates. Short channel MOS model, effects on scaling. Sequential\ncircuits, memory and array logic circuits. Three hours of lecture, one hour of\ndiscussion, three hours of laboratory.",
  "prerequisite": "ECE 25 or CSE 140,\n45, and 65 and ECE 30 or CSE 30.",
  "formatted_pre": [
   [
    "ECE 25",
    "CSE 140"
   ],
   [
    "CSE 45"
   ],
   [
    "CSE 65"
   ],
   [
    "ECE 30",
    "CSE 30"
   ]
  ]
 },
 {
  "code": "ECE 109",
  "title": "Engineering Probability and Statistics",
  "unit": "4",
  "description": "Axioms of probability, conditional probability, theorem of total probability,\nrandom variables, densities, expected values, characteristic functions,\ntransformation of random variables, central limit theorem. Random number\ngeneration, engineering reliability, elements of estimation, random sampling,\nsampling distributions, tests for hypothesis. One unit of credit given if\ntaken after MAE 108, MATH 180A, MATH 180B, MATH 183, MATH 186, or ECON 120A.",
  "prerequisite": "MATH 20A-B, MATH 20D, MATH 20C or MATH 31BH, and MATH 31AH\nor MATH 18.",
  "formatted_pre": [
   [
    "MATH 20A"
   ],
   [
    "MATH 20D"
   ],
   [
    "MATH 20C",
    "MATH 31BH"
   ],
   [
    "MATH 31AH",
    "MATH 18"
   ]
  ]
 },
 {
  "code": "ECE 111",
  "title": "Advanced Digital Design Project",
  "unit": "4",
  "description": "Advanced topics in digital circuits and systems. Use of computers and design\nautomation tools. Hazard elimination, synchronous/asynchronous FSM synthesis,\nsynchronization and arbitration, pipelining and timing issues. Problem sets\nand design exercises. A large-scale design project. Simulation and/or rapid\nprototyping.",
  "prerequisite": "ECE 25 or CSE 140.",
  "formatted_pre": [
   [
    "ECE 25",
    "CSE 140"
   ]
  ]
 },
 {
  "code": "ECE 115",
  "title": "Fast Prototyping",
  "unit": "4",
  "description": "Lab-based course. Students will learn how to prototype a mechatronic solution.\nTopics include cheap/accessible materials and parts; suppliers; fast\nprototyping techniques; useful electronic sketches and system integration\nshortcuts. Students will learn to materialize their electromechanical ideas\nand make design decisions to minimize cost, improve functionality/robustness.\nLabs will culminate toward a fully functional robot prototype for\ndemonstration.",
  "prerequisite": "ECE 16 or consent of instructor.",
  "formatted_pre": [
   [
    "ECE 16"
   ]
  ]
 },
 {
  "code": "ECE 118",
  "title": "Computer Interfacing",
  "unit": "4",
  "description": "Interfacing computers and embedded controllers to the real world: busses,\ninterrupts, DMA, memory mapping, concurrency, digital I/O, standards for\nserial and parallel communications, A/D, D/A, sensors, signal conditioning,\nvideo, and closed loop control. Students design and construct an interfacing\nproject. (Course materials and/or program fees may apply.)",
  "prerequisite": "ECE 30 or CSE 30 and ECE 35, 45, 65.",
  "formatted_pre": [
   [
    "ECE 30",
    "CSE 30"
   ],
   [
    "ECE 35"
   ],
   [
    "ECE 45"
   ],
   [
    "ECE 65"
   ]
  ]
 },
 {
  "code": "ECE 120",
  "title": "Solar System Physics",
  "unit": "4",
  "description": "General introduction to planetary bodies, the overall structure of the solar\nsystem, and space plasma physics. Course emphasis will be on the solar\natmosphere, how the solar wind is produced, and its interaction with both\nmagnetized and unmagnetized planets (and comets).",
  "prerequisite": "PHYS 2A-C\nor 4A-D, MATH 20A-B, 20C with grades of C- or better.",
  "formatted_pre": [
   [
    "PHYS 2A",
    "PHYS 4A"
   ],
   [
    "MATH 20A"
   ],
   [
    "MATH 20C"
   ]
  ]
 },
 {
  "code": "ECE 121A",
  "title": "Power Systems Analysis and Fundamentals",
  "unit": "4",
  "description": "This course introduces concepts of large-scale power system analysis: electric\npower generation, distribution, steady-state analysis and economic operation.\nIt provides the fundamentals for advanced courses and engineering practice on\nelectric power systems, smart grid, and electricity economics. The course\nrequires implementing some of the computational techniques in simulation\nsoftware.",
  "prerequisite": "ECE 35.",
  "formatted_pre": [
   [
    "ECE 35"
   ]
  ]
 },
 {
  "code": "ECE 121B",
  "title": "Energy Conversion",
  "unit": "4",
  "description": "Principles of electro-mechanical energy conversion, balanced three-phase\nsystems, fundamental concepts of magnetic circuits, single-phase transformers,\nand the steady-state performance of DC and induction machines. Students may\nnot receive credit for both ECE 121B and ECE 121.",
  "prerequisite": "ECE 121A.",
  "formatted_pre": [
   [
    "ECE 121A"
   ]
  ]
 },
 {
  "code": "ECE 123",
  "title": "Antenna Systems Engineering",
  "unit": "4",
  "description": "The electromagnetic and systems engineering of radio antennas for terrestrial\nwireless and satellite communications. Antenna impedance, beam pattern, gain,\nand polarization. Dipoles, monopoles, paraboloids, phased arrays. Power and\nnoise budgets for communication links. Atmospheric propagation and multipath.",
  "prerequisite": "ECE 107 with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 124",
  "title": "Motor Drives",
  "unit": "4",
  "description": "Topics include the operation of DC motor and induction machine drives in\nsteady state and speed control of DC and induction motor drives in an energy\nefficient manner using power electronics. Control techniques such as vector\ncontrol and direct torque control (DTC) of induction machines. Different\ncontrol methods for direct current motors using different types of power\nconverters, such as DC-DC and AC-DC converters. Design torque, speed, and\nposition controller of DC motor drive.",
  "prerequisite": "ECE 121B and ECE\n125A.",
  "formatted_pre": [
   [
    "ECE 121B"
   ],
   [
    "ECE 125A"
   ]
  ]
 },
 {
  "code": "ECE 125A",
  "title": "Introduction to Power Electronics I",
  "unit": "4",
  "description": "Power generation, system, and electronics. Topics include power semiconductor\ndevices and characteristics, single-phase and three-phase half and full\ncontrolled AC-to-DC rectifiers, nonisolated/isolated DC-DC converters, power\nloss calculation, and thermal considerations, Snubber circuits.",
  "prerequisite": "ECE 121A.",
  "formatted_pre": [
   [
    "ECE 121A"
   ]
  ]
 },
 {
  "code": "ECE 125B",
  "title": "Introduction to Power Electronics II",
  "unit": "4",
  "description": "Design and control of DC-DC converters, PWM rectifiers, single-phase and\nthree-phase inverters, power management, and power electronics applications in\nrenewable energy systems, motion control, and lighting.",
  "prerequisite": "ECE\n125A.",
  "formatted_pre": [
   [
    "ECE 125A"
   ]
  ]
 },
 {
  "code": "ECE 128A",
  "title": "Real World Power Grid Operation",
  "unit": "4",
  "description": "Provides practical insights into the operation of the power grid. Covers the\nsame subjects that actual power system operators’ certification course covers.\nIt systematically describes the vital grid operators’ functions and the\nprocesses required to operate the system. Uses actual case histories, and real\nexamples of best in-class approaches from across the nation and the globe.\nPresents the problems encountered by operators and the enabling solutions to\nremedy them.",
  "prerequisite": "upper-division standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 128B",
  "title": "Power Grid Modernization",
  "unit": "4",
  "description": "In-depth coverage of the future power grids. Covers the practical aspects of\nthe technologies, their design and system implementation. Topics include the\nchanging nature of the grid with renewable resources, smart meters,\nsynchrophasors (PMU), microgrids, distributed energy resources, and the\nassociated information and communications infrastructures. Presents actual\nexamples and best practices. Students will be provided with various tools.",
  "prerequisite": "ECE 35 and ECE 128A.",
  "formatted_pre": [
   [
    "ECE 35"
   ],
   [
    "ECE 128A"
   ]
  ]
 },
 {
  "code": "ECE 128C",
  "title": "Power Grid Resiliency to Adverse Effects",
  "unit": "4",
  "description": "This course offers unique insight and practical answers through examples, of\nhow power systems can be affected by weather and what/how countermeasures can\nbe applied to mitigate them to make the system more resilient. Detailed\nexplanations of the impacts of extreme weather and applicable industry\nstandards and initiatives. Proven practices for successful restoration of the\npower grid, increased system resiliency, and ride-through after extreme\nweather providing real examples from around the globe.",
  "prerequisite": "ECE 128B.",
  "formatted_pre": [
   [
    "ECE 128B"
   ]
  ]
 },
 {
  "code": "ECE 129",
  "title": "Renewable and Energy Storage Resources",
  "unit": "4",
  "description": "Provides a solid foundation to renewable energy resources such as\nhydroelectric, solar, wind, geothermal, wave, and tidal. Energy grid storage\nsystems. Presents lessons learned from actual systems and study of renewable\nenergy resources and energy storage systems. Presents lessons learned from\nactual systems and results of detailed studies on the applications of\nrenewable energy resources and energy storage systems. Industry tools for\nhands-on experience with such resources and systems will be provided.",
  "prerequisite": "upper-division standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 134",
  "title": "Electronic Materials Science of Integrated Circuits",
  "unit": "4",
  "description": "Electronic materials science with emphasis on topics pertinent to\nmicroelectronics and VLSI technology. Concept of the course is to use\ncomponents in integrated circuits to discuss structure, thermodynamics,\nreaction kinetics, and electrical properties of materials.",
  "prerequisite": "PHYS 2C-D with grades of C- or better.",
  "formatted_pre": [
   [
    "PHYS 2C"
   ]
  ]
 },
 {
  "code": "ECE 135A",
  "title": "Semiconductor Physics",
  "unit": "4",
  "description": "Crystal structure and quantum theory of solids; electronic band structure;\nreview of carrier statistics, drift and diffusion, p-n junctions;\nnonequilibrium carriers, imrefs, traps, recombination, etc.; metal-\nsemiconductor junctions and heterojunctions.",
  "prerequisite": "ECE 103 with a\ngrade of C- or better.",
  "formatted_pre": [
   [
    "ECE 103"
   ]
  ]
 },
 {
  "code": "ECE 135B",
  "title": "Electronic Devices",
  "unit": "4",
  "description": "Structure and operation of bipolar junction transistors, junction field-effect\ntransistors, metal-oxide-semiconductor diodes and transistors. Analysis of dc\nand ac characteristics. Charge control model of dynamic behavior.",
  "prerequisite": "ECE 135A with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 135A"
   ]
  ]
 },
 {
  "code": "ECE 136L",
  "title": "Microelectronics Laboratory",
  "unit": "4",
  "description": "Laboratory fabrication of diodes and field-effect transistors covering\nphotolithography, oxidation, diffusion, thin film deposition, etching and\nevaluation of devices. (Course materials and/or program fees may apply.)",
  "prerequisite": "ECE 135B.",
  "formatted_pre": [
   [
    "ECE 135B"
   ]
  ]
 },
 {
  "code": "ECE 138L",
  "title": "Microstructuring Processing Technology Laboratory",
  "unit": "4",
  "description": "A laboratory course covering the concept and practice of microstructuring\nscience and technology in fabricating devices relevant to sensors, lab-chips\nand related devices. (Course materials and/or program fees may apply.)",
  "prerequisite": "upper-division standing for science and engineering\nstudents.",
  "formatted_pre": []
 },
 {
  "code": "ECE 140A",
  "title": "The Art of Product Engineering I",
  "unit": "4",
  "description": "Building on a solid foundation of electrical and computer engineer skills,\nthis course strives to broaden student skills in software, full-stack\nengineering, and concrete understanding of methods related to the realistic\ndevelopment of a commercial product. Students will research, design, and\ndevelop an IOT device to serve an emerging market.",
  "prerequisite": "CSE 8B\nor CSE 11 or ECE 15.",
  "formatted_pre": [
   [
    "CSE 8B",
    "CSE 11",
    "ECE 15"
   ]
  ]
 },
 {
  "code": "ECE 140B",
  "title": "The Art of Product Engineering II",
  "unit": "4",
  "description": "Building on a solid foundation of electrical and computer engineer skills,\nthis course strives to broaden student skills in software, full-stack\nengineering, and concrete understanding of methods related to the realistic\ndevelopment of a commercial product. Students will research, design, and\ndevelop an IOT device to serve an emerging market.",
  "prerequisite": "ECE\n140A.",
  "formatted_pre": [
   [
    "ECE 140A"
   ]
  ]
 },
 {
  "code": "ECE 141A",
  "title": "Software Foundations I",
  "unit": "4",
  "description": "Software analysis, design, and development. Data structures, algorithms, and\ndesign and development idioms in C++. Students will gain broad experience\nusing object-oriented methods and design patterns. Through increasingly\ndifficult challenges, students will gain valuable real-world experience\nbuilding, testing, and debugging software, and develop a robust mental model\nof modern software design and architecture.",
  "prerequisite": "CSE 30 or ECE\n30.",
  "formatted_pre": [
   [
    "CSE 30",
    "ECE 30"
   ]
  ]
 },
 {
  "code": "ECE 141B",
  "title": "Software Foundations II",
  "unit": "4",
  "description": "ECE 141B builds upon the solid C++ foundation of ECE 141A. Students will model\nand build a working database management solution in C++. Topics include STL,\ndesign patterns, parsing, searching and sorting, algorithmic thinking, and\ndesign partitioning. The course will continue to explore best practices in\nsoftware development, debugging, and testing.",
  "prerequisite": "ECE 141A.",
  "formatted_pre": [
   [
    "ECE 141A"
   ]
  ]
 },
 {
  "code": "ECE 143",
  "title": "Programming for Data Analysis",
  "unit": "4",
  "description": "This course covers the fundamentals of using the Python language effectively\nfor data analysis. Students learn the underlying mechanics and implementation\nspecifics of Python and how to effectively utilize the many built-in data\nstructures and algorithms. The course introduces key modules for data analysis\nsuch as Numpy, Pandas, and Matplotlib. Participants learn to leverage and\nnavigate the vast Python ecosystem to find codes and communities of individual\ninterest.",
  "prerequisite": "ECE 16.",
  "formatted_pre": [
   [
    "ECE 16"
   ]
  ]
 },
 {
  "code": "ECE 144",
  "title": "LabVIEW Programming: Design and Applications",
  "unit": "4",
  "description": "Develop, debug, and test LabVIEW VIs, solve problems using LabVIEW, use data\nacquisition, and perform signal processing and instrument control in LabVIEW\napplications. Groups of students will build an elevator system from laser-cut\nand 3-D printed parts; integrate sensors, motors, and servos; and program\nusing state-machine architecture in LabVIEW. Students will have the\nopportunity to take the National Instruments Certified LabVIEW Associate\nDeveloper (CLAD) exam at the end of the quarter. Program or materials fees may\napply.",
  "prerequisite": "CSE 11 or CSE 8B or ECE 15.",
  "formatted_pre": [
   [
    "CSE 11",
    "CSE 8B",
    "ECE 15"
   ]
  ]
 },
 {
  "code": "ECE 145AL-BL-CL",
  "title": "Acoustics Laboratory",
  "unit": "4-4-4",
  "description": "Automated laboratory based on H-P GPIB controlled instruments. Software\ncontrolled data collection and analysis. Vibrations and waves in strings and\nbars of electromechanical systems and transducers. Transmissions, reflection,\nand scattering of sound waves in air and water. Aural and visual detection.",
  "prerequisite": "ECE 107 with a grade of C- or better or consent of\ninstructor.",
  "formatted_pre": [
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 148",
  "title": "Introduction to Autonomous Vehicles",
  "unit": "4",
  "description": "Fundamentals of autonomous vehicles. Working in small teams, students will\ndevelop 1:8 scale autonomous cars that must perform on a simulated city track.\nTopics include robotics system integration, computer vision, algorithms for\nnavigation, on-vehicle vs. off-vehicle computation, computer learning systems\nsuch as neural networks, locomotion systems, vehicle steering, dead reckoning,\nodometry, sensor fusion, GPS autopilot limitations, wiring, and power\ndistribution and management. Cross-listed with MAE 148. Students may not\nreceive credit for ECE 148 and MAE 148. Program or materials fees may apply.",
  "prerequisite": "ECE 15 or ECE 35 or MAE 2 or MAE 3, and consent of\ninstructor.",
  "formatted_pre": [
   [
    "ECE 15",
    "ECE 35",
    "MAE 2",
    "MAE 3"
   ]
  ]
 },
 {
  "code": "ECE 150",
  "title": "Entrepreneurship for Engineers",
  "unit": "4",
  "description": "A foundation course teaching the basics of starting and running a successful\nnew business. Students learn how to think like entrepreneurs, pivot their\nideas to match customer needs, and assess financial, market, and timeline\nfeasibility. The end goal is an investor pitch and a business plan. Provides\nexperiential education, encouragement, and coaching (\"E3CE\") that prepares\nstudents for successful careers at start-up as well as large companies. Counts\ntoward one professional elective only.",
  "prerequisite": "students must\napply to enroll in order to gauge their past experience with and interest in\nentrepreneurship. Consent of instructor is required.",
  "formatted_pre": []
 },
 {
  "code": "ECE 153",
  "title": "Probability and Random Processes for Engineers",
  "unit": "4",
  "description": "Random processes. Stationary processes: correlation, power spectral density.\nGaussian processes and linear transformation of Gaussian processes. Point\nprocesses. Random noise in linear systems.",
  "prerequisite": "ECE 109 with a\ngrade of C- or better.",
  "formatted_pre": [
   [
    "ECE 109"
   ]
  ]
 },
 {
  "code": "ECE 155",
  "title": "Digital Communications Theory",
  "unit": "4",
  "description": "Design and performance analysis of digital modulation techniques, including\nprobability of error results for PSK, DPSK, and FSK. Introduction to effects\nof intersymbol interference and fading. Detection and estimation theory,\nincluding optimal receiver design and maximum-likelihood parameter estimation.\nRenumbered from ECE 154B. Students may not receive credit for ECE 155 and ECE\n154B.",
  "prerequisite": "ECE 101 or BENG 122A, ECE 109 or ECON 120A or MAE\n108 or MATH 180A or MATH 180B or MATH 183 or MATH 186, and ECE 153.",
  "formatted_pre": [
   [
    "ECE 101",
    "BENG 122A"
   ],
   [
    "ECE 109",
    "ECON 120A",
    "MAE 108",
    "MATH 180A",
    "MATH 180B",
    "MATH 183",
    "MATH 186"
   ],
   [
    "ECE 153"
   ]
  ]
 },
 {
  "code": "ECE 156",
  "title": "Sensor Networks",
  "unit": "4",
  "description": "Characteristics of chemical, biological, seismic, and other physical sensors;\nsignal processing techniques supporting distributed detection of salient\nevents; wireless communication and networking protocols supporting formation\nof robust sensor fabrics; current experience with low power, low cost sensor\ndeployments. Undergraduate students must take a final exam; graduate students\nmust write a term paper or complete a final project. Cross-listed with MAE 149\nand SIO 238.",
  "prerequisite": "upper-division standing and consent of\ninstructor, or graduate student in science and engineering.",
  "formatted_pre": []
 },
 {
  "code": "ECE 157A",
  "title": "Communications Systems Laboratory I",
  "unit": "4",
  "description": "Experiments in the modulation and demodulation of baseband and passband\nsignals. Statistical characterization of signals and impairments. (Course\nmaterials and/or program fees may apply.)",
  "prerequisite": "ECE 109 or ECON\n120A or MAE 108 or MATH 180A or MATH 180B or MATH 183 or MATH 186 and ECE\n161A.",
  "formatted_pre": [
   [
    "ECE 109",
    "ECON 120A",
    "MAE 108",
    "MATH 180A",
    "MATH 180B",
    "MATH 183",
    "MATH 186"
   ],
   [
    "ECE 161A"
   ]
  ]
 },
 {
  "code": "ECE 157B",
  "title": "Communications Systems Laboratory II",
  "unit": "4",
  "description": "Advanced projects in communication systems. Students will plan and implement\ndesign projects in the laboratory, updating progress weekly and making\nplan/design adjustments based upon feedback. (Course materials and/or program\nfees may apply.)",
  "prerequisite": "ECE 154A with a grade of C+ or better.",
  "formatted_pre": [
   [
    "ECE 154A"
   ]
  ]
 },
 {
  "code": "ECE 158A",
  "title": "Data Networks I",
  "unit": "4",
  "description": "Layered network architectures, data link control protocols and multiple-access\nsystems, performance analysis. Flow control; prevention of deadlock and\nthroughput degradation. Routing, centralized and decentralized schemes, static\ndynamic algorithms. Shortest path and minimum average delay algorithms.\nComparisons.",
  "prerequisite": "ECE 109 with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 109"
   ]
  ]
 },
 {
  "code": "ECE 158B",
  "title": "Data Networks II",
  "unit": "4",
  "description": "Layered network architectures, data link control protocols and multiple-access\nsystems, performance analysis. Flow control; prevention of deadlock and\nthroughput degradation. Routing, centralized and decentralized schemes, static\ndynamic algorithms. Shortest path and minimum average delay algorithms.\nComparisons.",
  "prerequisite": "ECE 158A with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 158A"
   ]
  ]
 },
 {
  "code": "ECE 159",
  "title": "Introduction to Data Processing and Information Theory",
  "unit": "4",
  "description": "Introduction to information theory and coding, including entropy, average\nmutual information, channel capacity, block codes, and convolutional codes.\nRenumbered from ECE 154C. Students may not receive credit for ECE 159 and ECE\n154C.",
  "prerequisite": "ECE 153.",
  "formatted_pre": [
   [
    "ECE 153"
   ]
  ]
 },
 {
  "code": "ECE 161A",
  "title": "Introduction to Digital Signal Processing",
  "unit": "4",
  "description": "Review of discrete-time systems and signals, Discrete-Time Fourier Transform\nand its properties, the Fast Fourier Transform, design of Finite Impulse\nResponse (FIR) and Infinite Impulse Response (IIR) filters, implementation of\ndigital filters.",
  "prerequisite": "ECE 101.",
  "formatted_pre": [
   [
    "ECE 101"
   ]
  ]
 },
 {
  "code": "ECE 161B",
  "title": "Digital Signal Processing I",
  "unit": "4",
  "description": "Sampling and quantization of baseband signals; A/D and D/A conversion,\nquantization noise, oversampling and noise shaping. Sampling of bandpass\nsignals, undersampling downconversion, and Hilbert transforms. Coefficient\nquantization, roundoff noise, limit cycles and overflow oscillations.\nInsensitive filter structures, lattice and wave digital filters. Systems will\nbe designed and tested with Matlab, implemented with DSP processors and tested\nin the laboratory.",
  "prerequisite": "ECE 161A with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 161A"
   ]
  ]
 },
 {
  "code": "ECE 161C",
  "title": "Applications of Digital Signal Processing",
  "unit": "4",
  "description": "This course discusses several applications of DSP. Topics covered will include\nspeech analysis and coding; image and video compression and processing. A\nclass project is required, algorithms simulated by Matlab.",
  "prerequisite": "ECE 161A.",
  "formatted_pre": [
   [
    "ECE 161A"
   ]
  ]
 },
 {
  "code": "ECE 163",
  "title": "Electronic Circuits and Systems",
  "unit": "4",
  "description": "Analysis and design of analog circuits and systems. Feedback systems with\napplications to operational amplifier circuits. Stability, sensitivity,\nbandwidth, compensation. Design of active filters. Switched capacitor\ncircuits. Phase-locked loops. Analog-to-digital and digital-to-analog\nconversion. (Course materials and/or program fees may apply.)",
  "prerequisite": "ECE 101 and 102 with grades of C- or better.",
  "formatted_pre": [
   [
    "ECE 101"
   ],
   [
    "ECE 102"
   ]
  ]
 },
 {
  "code": "ECE 164",
  "title": "Analog Integrated Circuit Design",
  "unit": "4",
  "description": "Design of linear and nonlinear analog integrated circuits including\noperational amplifiers, voltage regulators, drivers, power stages,\noscillators, and multipliers. Use of feedback and evaluation of noise\nperformance. Parasitic effects of integrated circuit technology. Laboratory\nsimulation and testing of circuits.",
  "prerequisite": "ECE 102 with a grade of\nC- or better. ECE 163 recommended.",
  "formatted_pre": [
   [
    "ECE 102"
   ]
  ]
 },
 {
  "code": "ECE 165",
  "title": "Digital Integrated Circuit Design",
  "unit": "4",
  "description": "VLSI digital systems. Circuit characterization, performance estimation, and\noptimization. Circuits for alternative logic styles and clocking schemes.\nSubsystems include ALUs, memory, processor arrays, and PLAs. Techniques for\ngate arrays, standard cell, and custom design. Design and simulation using CAD\ntools.",
  "prerequisite": "ECE 102.",
  "formatted_pre": [
   [
    "ECE 102"
   ]
  ]
 },
 {
  "code": "ECE 166",
  "title": "Microwave Systems and Circuits",
  "unit": "4",
  "description": "Waves, distributed circuits, and scattering matrix methods. Passive microwave\nelements. Impedance matching. Detection and frequency conversion using\nmicrowave diodes. Design of transistor amplifiers including noise performance.\nCircuits designs will be simulated by computer and tested in the laboratory.\n(Course materials and/or program fees may apply.)",
  "prerequisite": "ECE 102\nand 107 with grades of C- or better.",
  "formatted_pre": [
   [
    "ECE 102"
   ],
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 171A",
  "title": "Linear Control System Theory",
  "unit": "4",
  "description": "Stability of continuous- and discrete-time single-input/single-output linear\ntime-invariant control systems emphasizing frequency domain methods. Transient\nand steady-state behavior. Stability analysis by root locus, Bode, Nyquist,\nand Nichols plots. Compensator design.",
  "prerequisite": "ECE 45 or MAE 140.",
  "formatted_pre": [
   [
    "ECE 45",
    "MAE 140"
   ]
  ]
 },
 {
  "code": "ECE 171B",
  "title": "Linear Control System Theory",
  "unit": "4",
  "description": "Time-domain, state-variable formulation of the control problem for both\ndiscrete-time and continuous-time linear systems. State-space realizations\nfrom transfer function system description. Internal and input-output\nstability, controllability/observability, minimal realizations, and pole-\nplacement by full-state feedback.",
  "prerequisite": "ECE 171A with a grade of\nC- or better.",
  "formatted_pre": [
   [
    "ECE 171A"
   ]
  ]
 },
 {
  "code": "ECE 176",
  "title": "Introduction to Deep Learning and Applications",
  "unit": "4",
  "description": "This course covers the fundamentals in deep learning, basics in deep neural\nnetwork including different network architectures (e.g., ConvNet, RNN), and\nthe optimization algorithms for training these networks. We will have hands-on\nimplementation courses in PyTorch. This course will also introduce the deep\nlearning applications in computer vision, robotics, and sequence modeling in\nnatural language processing. ",
  "prerequisite": "MATH 18 or MATH 31AH\nand ECE 143, or consent of instructor.",
  "formatted_pre": [
   [
    "MATH 18",
    "MATH 31AH"
   ],
   [
    "ECE 143"
   ]
  ]
 },
 {
  "code": "ECE 180",
  "title": "Topics in Electrical and Computer Engineering",
  "unit": "4",
  "description": "Topics of special interest in electrical and computer engineering. Subject\nmatter will not be repeated so it may be taken for credit more than once.",
  "prerequisite": "consent of instructor; department stamp.",
  "formatted_pre": []
 },
 {
  "code": "ECE 181",
  "title": "Physical Optics and Fourier Optics",
  "unit": "4",
  "description": "Ray optics, wave optics, beam optics, Fourier optics, and electromagnetic\noptics. Ray transfer matrix, matrices of cascaded optics, numerical apertures\nof step and graded index fibers. Fresnel and Fraunhofer diffractions,\ninterference of waves. Gaussian and Bessel beams, the ABCD law for\ntransmissions through arbitrary optical systems. Spatial frequency, impulse\nresponse and transfer function of optical systems, Fourier transform and\nimaging properties of lenses, holography. Wave propagation in various\n(inhomogeneous, dispersive, anisotropic or nonlinear) media. (Course materials\nand/or program fees may apply.)",
  "prerequisite": "ECE 103 and 107 with grades\nof C- or better.",
  "formatted_pre": [
   [
    "ECE 103"
   ],
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 182",
  "title": "Electromagnetic Optics, Guided-Wave, and Fiber Optics",
  "unit": "4",
  "description": "Polarization optics: crystal optics, birefringence. Guided-wave optics: modes,\nlosses, dispersion, coupling, switching. Fiber optics: step and graded index,\nsingle and multimode operation, attenuation, dispersion, fiber optic\ncommunications. Resonator optics. (Course materials and/or program fees may\napply.)",
  "prerequisite": "ECE 103 and 107 with grades of C- or better.",
  "formatted_pre": [
   [
    "ECE 103"
   ],
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 183",
  "title": "Optical Electronics",
  "unit": "4",
  "description": "Quantum electronics, interaction of light and matter in atomic systems,\nsemiconductors. Laser amplifiers and laser systems. Photodetection. Electro-\noptics and acousto-optics, photonic switching. Fiber optic communication\nsystems. Labs: semiconductor lasers, semiconductor photodetectors. (Course\nmaterials and/or program fees may apply.)",
  "prerequisite": "ECE 103 and 107\nwith grades of C- or better.",
  "formatted_pre": [
   [
    "ECE 103"
   ],
   [
    "ECE 107"
   ]
  ]
 },
 {
  "code": "ECE 184",
  "title": "Optical Information Processing and Holography",
  "unit": "4",
  "description": "(Conjoined with ECE 241AL) Labs: optical holography, photorefractive effect,\nspatial filtering, computer generated holography. Students enrolled in ECE 184\nwill receive four units of credit; students enrolled in ECE 241AL will receive\ntwo units of credit. (Course materials and/or program fees may apply.)",
  "prerequisite": "ECE 182 with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 182"
   ]
  ]
 },
 {
  "code": "ECE 185",
  "title": "Lasers and Modulators",
  "unit": "4",
  "description": "(Conjoined with ECE 241BL) Labs: CO2 laser, HeNe laser, electro-optic\nmodulation, acousto-optic modulation, spatial light modulators. Students\nenrolled in ECE 185 will receive four units of credit; students enrolled in\nECE 241BL will receive two units of credit. (Course materials and/or program\nfees may apply.)",
  "prerequisite": "ECE 183 with a grade of C- or better.",
  "formatted_pre": [
   [
    "ECE 183"
   ]
  ]
 },
 {
  "code": "ECE 187",
  "title": "Introduction to Biomedical Imaging and Sensing",
  "unit": "4",
  "description": "Image processing fundamentals: imaging theory, image processing, pattern\nrecognition; digital radiography, computerized tomography, nuclear medicine\nimaging, nuclear magnetic resonance imaging, ultrasound imaging, microscopy\nimaging.",
  "prerequisite": "MATH 20A-B-F, 20C or 21C, 20D or 21D, PHYS 2A-D,\nECE 101 (may be taken concurrently) with grades of C- or better.",
  "formatted_pre": [
   [
    "MATH 20A"
   ],
   [
    "MATH 20C",
    "MATH 21C"
   ],
   [
    "MATH 20D",
    "MATH 21D"
   ],
   [
    "PHYS 2A"
   ],
   [
    "ECE 101"
   ]
  ]
 },
 {
  "code": "ECE 188",
  "title": "Topics in Electrical and Computer Engineering with Laboratory",
  "unit": "4",
  "description": "Topics of special interest in electrical and computer engineering with\nlaboratory. Subject matter will not be repeated so it may be taken for credit\nup to three times.",
  "prerequisite": "upper-division standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 189",
  "title": "Technical Public Speaking",
  "unit": "2",
  "description": "Basics of technical public speaking, including speech organization, body\nlanguage (eye contact, hand gestures, etc.), volume and rate, and design of\ntechnical slides. Students will practice technical public speaking, including\nspeeches with PowerPoint slides and speaker introductions, and presenting\nimpromptu speeches. Students may not receive credit for both ECE 189 and ENG\n100E. ",
  "prerequisite": "upper-division standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 190",
  "title": "Engineering Design",
  "unit": "4",
  "description": "Students complete a project comprising at least 50 percent or more engineering\ndesign to satisfy the following features: student creativity, open-ended\nformulation of a problem statement/specifications, consideration of\nalternative solutions/realistic constraints. Written final report required.",
  "prerequisite": "students enrolling in this course must have completed all\nof the breadth courses and one depth course. The department stamp is required\nto enroll in ECE 190. (Specifications and enrollment forms are available in\nthe undergraduate office.)",
  "formatted_pre": []
 },
 {
  "code": "ECE 191",
  "title": "Engineering Group Design Project",
  "unit": "4",
  "description": "Groups of students work to design, build, demonstrate, and document an\nengineering project. All students give weekly progress reports of their tasks\nand contribute a section to the final project report.",
  "prerequisite": "completion of all of the breadth courses and one depth course.",
  "formatted_pre": []
 },
 {
  "code": "ECE 193H",
  "title": "Honors Project",
  "unit": "4-8",
  "description": "An advanced reading or research project performed under the direction of an\nECE faculty member. Must contain enough design to satisfy the ECE program's\nfour-unit design requirement. Must be taken for a letter grade. May extend\nover two quarters with a grade assigned at completion for both quarters.",
  "prerequisite": "admission to the ECE departmental honors program.",
  "formatted_pre": []
 },
 {
  "code": "ECE 194",
  "title": "Viacar Design Project",
  "unit": "4",
  "description": "Students design, build, and race an autonomous car using principles in\nelectrical engineering and computer science: circuit design, control theory,\ndigital signal processing, embedded systems, microcontrollers,\nelectromagnetism, and programming.",
  "prerequisite": "none.",
  "formatted_pre": []
 },
 {
  "code": "ECE 195",
  "title": "Teaching",
  "unit": "2 or 4",
  "description": "Teaching and tutorial activities associated with courses and seminars. Not\nmore than four units of ECE 195 may be used for satisfying graduation\nrequirements. (P/NP grades only.)",
  "prerequisite": "consent of the department\nchair.",
  "formatted_pre": []
 },
 {
  "code": "ECE 196",
  "title": "Engineering Hands-on Group Project",
  "unit": "4",
  "description": "Groups of students work to build and demonstrate at least three engineering\nprojects at the beginning, intermediate, and advanced levels. The final\nproject consists of either a new project designed by the student team or\nextension of an existing project. The student teams also prepare a manual as\npart of their documentation of the final project. May be taken for credit two\ntimes.",
  "prerequisite": "BENG 1 or CENG 4 or CSE 11 or CSE 8B or ECE 5 or MAE\n3 or NANO 4 or SE 1.",
  "formatted_pre": [
   [
    "BENG 1",
    "CENG 4",
    "CSE 11",
    "CSE 8B",
    "ECE 5",
    "MAE 3",
    "NANO 4",
    "NANO 1"
   ]
  ]
 },
 {
  "code": "ECE 197",
  "title": "ECE Internship",
  "unit": "2, 4, 6, 8, 10, or 12",
  "description": "An enrichment program that provides work experience with public/private\nsection employers. Subject to the availability of positions, students will\nwork in a local company under the supervision of a faculty member and site\nsupervisor. (P/NP grades only.)",
  "prerequisite": "minimum UC San Diego 2.5\nGPA. Consent of instructor and department stamp.",
  "formatted_pre": []
 },
 {
  "code": "ECE 198",
  "title": "Directed Group Study",
  "unit": "2 or 4",
  "description": "Topics in electrical and computer engineering whose study involves reading and\ndiscussion by a small group of students under direction of a faculty member.\n(P/NP grades only.)",
  "prerequisite": "consent of instructor.",
  "formatted_pre": []
 },
 {
  "code": "ECE 199",
  "title": "Independent Study for Undergraduates",
  "unit": "2 or 4",
  "description": "Independent reading or research by special arrangement with a faculty member.\n(P/NP grades only.)",
  "prerequisite": "consent of instructor.",
  "formatted_pre": []
 },
 {
  "code": "ECE 200",
  "title": "Research Conference",
  "unit": "2",
  "description": "Group discussion of research activities and progress of group members.\n(Consent of instructor is strongly recommended.) (S/U grades only.)",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 201",
  "title": "Introduction to Biophysics",
  "unit": "4",
  "description": "The class will cover fundamental physical principles of biological processes\nat the molecular, cellular, tissue and organ levels that are related to human\nphysiology and diseases. Topics include energetics and dynamics of biological\nsystems, physical factors of environment, and the kinetics of biological\nsystems.",
  "prerequisite": "senior or graduate level standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 202",
  "title": "Medical Devices and Interfaces",
  "unit": "4",
  "description": "This course will cover basic cellular and electrochemical processes, membrane\npotentials, ionic currents, nerve cell conductance, extracellular and\nintracellular stimulation, neural probe technology materials and devices,\ndiagnostic and drug delivery devices, material/physiological considerations,\nbiosensors, microfluids, optical, magnetic and electrical screening.",
  "prerequisite": "senior or graduate level standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 203",
  "title": "Biomedical Integrated Circuits and Systems",
  "unit": "4",
  "description": "Integrated circuit analysis and design for medical devices. Introduction to\nsubthreshold conduction in MOS transistor and its similarities to biomolecular\ntransport. Design of instrumentation amplifiers, sensors, and electrical\nstimulation interfaces. Transcutaneous wireless power transfer and\nelectromagnetic effects on tissue. Recommended preparation: ECE 164 or BENG\n186B or equivalent.",
  "prerequisite": "senior or graduate level standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 204",
  "title": "Statistical Learning in Bioinformatics",
  "unit": "4",
  "description": "A hallmark of bioinformatics is the computational analysis of complex data.\nThe combination of statistics and algorithms produces statistical learning\nmethods that automate the analysis of complex data. Such machine learning\nmethods are widely used in systems biology and bioinformatics. This course\nprovides an introduction to statistical learning and assumes familiarity with\nkey statistical methods. Students may not receive credit for BNFO 285 and ECE\n204 and BENG 285. Cross-listed with BNFO 285 and BENG 285.",
  "prerequisite": "ECE 271A or ECE 271B or MATH 283; graduate standing.",
  "formatted_pre": [
   [
    "ECE 271A",
    "ECE 271B",
    "MATH 283"
   ]
  ]
 },
 {
  "code": "ECE 207A",
  "title": "Principles of Medical Imaging",
  "unit": "4",
  "description": "Fundamentals of Fourier transform and linear systems theory including\nconvolution, sampling, noise, filtering, image reconstruction, and\nvisualization with an emphasis on applications to biomedical imaging. Examples\nfrom optical imaging, CT, MR, ultrasound, nuclear, PET, and radiography.\nCross-listed with BENG 280A. Renumbered from ECE 207. Students may receive\ncredit for one of the following: ECE 207A or ECE 207 or BENG 280A.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 208",
  "title": "Computational Evolutionary Biology",
  "unit": "4",
  "description": "Evolutionary biology (e.g., the study of the tree of life) uses computational\nmethods from statistics and machine learning. We cover methods of broad use in\nmany fields and apply them to biology, focusing on scalability to big genomic\ndata. Topics include dynamic programming, continuous time Markov models,\nhidden Markov models, statistical inference of phylogenies, sequence\nalignment, uncertainty (e.g., bootstrapping), and heterogeneity (e.g.,\nphylogenetic mixture models).",
  "prerequisite": "graduate standing. ****",
  "formatted_pre": []
 },
 {
  "code": "ECE 209",
  "title": "Statistical Learning for Biosignal Processing",
  "unit": "4",
  "description": "Medical device systems increasingly measure biosignals from multiple sensors,\nrequiring computational analyses of complex multivariate time-varying data.\nThe combination of statistics and algorithms produces statistical learning\nmethods that automate the analysis of complex data. Applications within the\ndomain of neural engineering that utilize unsupervised and supervised\ngenerative statistical modeling techniques are explored. This course assumes\nfamiliarity with key statistical methods.",
  "prerequisite": "ECE 271A-B;\ngraduate standing.",
  "formatted_pre": [
   [
    "ECE 271A"
   ]
  ]
 },
 {
  "code": "ECE 212AN",
  "title": "Principles of Nanoscience and Nanotechnology",
  "unit": "4",
  "description": "Introduction to and rigorous treatment of electronic, photonic, magnetic, and\nmechanical properties of materials at the nanoscale. Concepts from\nmathematical physics, quantum mechanics, quantum optics, and electromagnetic\ntheory will be introduced as appropriate. Students may not receive credit for\nboth ECE 212A and ECE 212AN.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 212BN",
  "title": "Nanoelectronics",
  "unit": "4",
  "description": "Quantum states and quantum transport of electrons; single-electron devices;\nnanoelectronic devices and system concepts; introduction to molecular and\norganic electronics. Students may not receive credit for both ECE 212BN and\nECE 212C.",
  "prerequisite": "ECE 212AN; graduate standing.",
  "formatted_pre": [
   [
    "ECE 212AN"
   ]
  ]
 },
 {
  "code": "ECE 212CN",
  "title": "Nanophotonics",
  "unit": "4",
  "description": "Photonic properties of artificially engineered inhomogeneous nanoscale\ncomposite materials incorporating dielectrics, semiconductors, and/or metals.\nNear-field localization effects and applications. Device and component\napplications. Students may not receive credit for both ECE 212CN and 212B.",
  "prerequisite": "ECE 212BN; graduate standing.",
  "formatted_pre": [
   [
    "ECE 212BN"
   ]
  ]
 },
 {
  "code": "ECE 221",
  "title": "Magnetic Materials: Principles and Applications",
  "unit": "4",
  "description": "The basis of magnetism: classical and quantum mechanical points of view.\nDifferent kinds of magnetic materials. Magnetic phenomena including\nanisotropy, magnetostriction, domains, and magnetization dynamics. Current\nfrontiers of nanomagnetics research including thin films and particles.\nOptical, data storage, and biomedical engineering applications of soft and\nhard magnetic materials.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 222A",
  "title": "Antennas and Their System Applications",
  "unit": "4",
  "description": "Antennas, waves, polarization. Friis transmission and Radar equations,\ndipoles, loops, slots, ground planes, traveling wave antennas, array theory,\nphased arrays, impedance, frequency independent antennas, microstrip antennas,\ncell phone antennas, system level implications such as MIMO, multi-beam and\nphased array systems. Recommended preparation: ECE 107 or an equivalent\nundergraduate course in electromagnetics.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 222B",
  "title": "Applied Electromagnetic Theory—Electromagnetics",
  "unit": "4",
  "description": "Graduate-level introductory course on electromagnetic theory with\napplications. Topics covered include Maxwell's equations, plane waves in free\nspace and in the presence of interfaces, polarization, fields in metallic and\ndielectric waveguides including surface waves; fields in metallic cavities,\nGreen's functions, electromagnetic field radiation and scattering.",
  "prerequisite": "ECE 222A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 222A"
   ]
  ]
 },
 {
  "code": "ECE 222D",
  "title": "Advanced Antenna Design",
  "unit": "4",
  "description": "Review of 222A-B. Fourier transform, waveguide antennas. Mutual coupling,\nactive impedance, Floquet modes in arrays. Microstrip antennas, surface waves.\nReflector and lens analysis: taper, spillover, aperture and physical optics\nmethods. Impedance surfaces. Advanced concepts: Subwavelength propagation,\netc. (chosen by instructor). Recommended preparation: CE 222A, ECE 222B, or\nequivalent.",
  "prerequisite": "ECE 222C; graduate standing.",
  "formatted_pre": [
   [
    "ECE 222C"
   ]
  ]
 },
 {
  "code": "ECE 225A",
  "title": "Probability and Statistics for Data Science",
  "unit": "4",
  "description": "The course reinforces students’ intuitive, theoretical, and computational\nunderstanding of probability and statistics, and builds on these foundations\nto introduce more advanced concepts useful in both data science research and\npractice. The following topics will be covered: basics, convergence,\nestimation, and hypothesis testing. Python programs, examples, and\nvisualizations will be used throughout the course.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 225B",
  "title": "Universal Probability and Its Applications in Data Science",
  "unit": "4",
  "description": "In many data science problems, there is only limited information on\nstatistical properties of the data. This course develops the concept of\nuniversal probability that can be used as a proxy for the unknown distribution\nof data and provides a unified framework for several data science problems,\nincluding compression, portfolio selection, prediction, and classification.",
  "prerequisite": "ECE 225A or ECE 250; graduate standing.",
  "formatted_pre": [
   [
    "ECE 225A",
    "ECE 250"
   ]
  ]
 },
 {
  "code": "ECE 227",
  "title": "Big Network Data",
  "unit": "4",
  "description": "A course on network science driven by data analysis. The class will focus on\nboth theoretical and empirical analysis performed on real data, including\ntechnological networks, social networks, information networks, biological\nnetworks, economic networks, and financial networks. Students will be exposed\nto a number of state-of-the-art software libraries for network data analysis\nand visualization via the Python notebook environment. Previous Python\nprogramming experience recommended.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 228",
  "title": "Machine Learning for Physical Applications",
  "unit": "4",
  "description": "Machine learning has received enormous interest. To learn from data we use\nprobability theory, which has been a mainstay of statistics and engineering\nfor centuries. The class will focus on implementations for physical problems.\nTopics: Gaussian probabilities, linear models for regression, linear models\nfor classification, neural networks, kernel methods, support vector machines,\ngraphical models, mixture models, sampling methods, and sequential estimation.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 229",
  "title": "Computational Data Analysis and Product Development",
  "unit": "4",
  "description": "Students learn to create statistical models and use computation and\nsimulations to develop insight and deliver value to the end-user. Randomly\nassigned teams will learn to develop and deploy a data science product, write\nand document code in an ongoing process, produce corresponding user\ndocumentation and communicate product value verbally and in writing, and\nultimately deploy and maintain products on a cloud platform. Recommended\npreparation: ECE 143. _",
  "prerequisite": "ECE 225A or ECE 269, graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 225A",
    "ECE 269"
   ]
  ]
 },
 {
  "code": "ECE 230A",
  "title": "Solid State Electronics I",
  "unit": "4",
  "description": "This course is designed to provide a general background in solid state\nelectronic materials and devices. Course content emphasizes the fundamental\nand current issues of semiconductor physics related to the ECE solid state\nelectronics sequences. Recommended preparation: ECE 135A-B or equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 230B",
  "title": "Solid State Electronics II",
  "unit": "4",
  "description": "Physics of solid-state electronic devices, including p-n diodes, Schottky\ndiodes, field-effect transistors, bipolar transistors, pnpn structures.\nComputer simulation of devices, scaling characteristics, high frequency\nperformance, and circuit models.",
  "prerequisite": "ECE 230A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 230A"
   ]
  ]
 },
 {
  "code": "ECE 230C",
  "title": "Solid State Electronics III",
  "unit": "4",
  "description": "This course is designed to provide a treatise of semiconductor devices based\non solid state phenomena. Band structures carrier scattering and recombination\nprocesses and their influence on transport properties will be emphasized.\nRecommended preparation: ECE 230A or equivalent.",
  "prerequisite": "ECE 230B;\ngraduate standing.",
  "formatted_pre": [
   [
    "ECE 230B"
   ]
  ]
 },
 {
  "code": "ECE 235",
  "title": "Nanometer-Scale VLSI Devices",
  "unit": "4",
  "description": "This course covers modern research topics in sub-100 nm scale, state-of-the-\nart silicon VLSI devices. Starting with the fundamentals of CMOS scaling to\nnanometer dimensions, various advanced device and circuit concepts, including\nRF CMOS, low power CMOS, silicon memory, silicon-on-insulator, SiGe bipolar,\nstrained silicon MOSFET's, etc. will be taught. The physics of near-ballistic\ntransport in an ultimately scaled 10 nm MOSFET will be discussed in light of\nthe recently developed scattering theory.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 236A",
  "title": "III-V Compound Semiconductor Materials",
  "unit": "4",
  "description": "This course covers the growth, characterization, and heterojunction properties\nof III-V compound semiconductors and group-IV heterostructures for the\nsubsequent courses on electronic and photonic device applications. Topics\ninclude epitaxial growth techniques, electrical properties of heterojunctions,\ntransport and optical properties of quantum wells and superlattices.",
  "prerequisite": "ECE 230A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 230A"
   ]
  ]
 },
 {
  "code": "ECE 236B",
  "title": "Optical Processes in Semiconductors",
  "unit": "4",
  "description": "Absorption and emission of radiation in semiconductors. Radiative transition\nand nonradiative recombination. Laser, modulators, and photodetector devices\nwill be discussed. Recommended preparation: ECE 230A and ECE 230C or\nequivalent.",
  "prerequisite": "ECE 236A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 236A"
   ]
  ]
 },
 {
  "code": "ECE 236C",
  "title": "Heterojunction Field-Effect Transistors",
  "unit": "4",
  "description": "The physics and circuit applications of heterojunction field-effect\ntransistors (HFETs) and heterojunction bipolar transistors (HBTs). Operating\nprinciples of FETs and BJTs are reviewed, and opportunities for improving\ntheir performance with suitable material choices and bandgap engineering are\nhighlighted. SiGe and III-V HBTs, III-V FETs, and current research areas are\ncovered. Microwave characteristics, models and representative circuit\napplications. Students who have already completed ECE 236C and/or D should not\nenroll in this course. Recommended preparation: ECE 230B or equivalent course\nwith emphasis on physics of solid-state electronic devices.",
  "prerequisite": "ECE 236B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 236B"
   ]
  ]
 },
 {
  "code": "ECE 238A",
  "title": "Thermodynamics of Solids",
  "unit": "4",
  "description": "The thermodynamics and statistical mechanics of solids. Basic concepts,\nequilibrium properties of alloy systems, thermodynamic information from phase\ndiagrams, surfaces and interfaces, crystalline defects. Cross-listed with\nMaterials Science 201A and MAE 271A.",
  "prerequisite": "consent of instructor.",
  "formatted_pre": []
 },
 {
  "code": "ECE 238B",
  "title": "Solid State Diffusion and Reaction Kinetics",
  "unit": "4",
  "description": "Thermally activated processes. Boltzman factor, homogeneous and heterogeneous\nreactions, solid state diffusion, Fick's law, diffusion mechanisms, Kirkendall\neffects, Boltzmann-Manato analysis, high diffusivity paths. Cross-listed with\nMaterials Science 201B and MAE 271B.",
  "prerequisite": "ECE 238A.",
  "formatted_pre": [
   [
    "ECE 238A"
   ]
  ]
 },
 {
  "code": "ECE 240A",
  "title": "Lasers and Optics",
  "unit": "4",
  "description": "Fresnel and Fraunhofer diffraction theory. Optical resonators, interferometry.\nGaussian beam propagation and transformation. Laser oscillation and\namplification, Q-switching and mode locking of lasers, some specific laser\nsystems. Recommended preparation: ECE 107 and ECE 182 or equivalent,\nintroductory quantum mechanics or ECE 183.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 240B",
  "title": "Optical Information Processing",
  "unit": "4",
  "description": "Space-bandwidth product, superresolution, space-variant optical system,\npartial coherence, image processing with coherent and incoherent light,\nprocessing with feedback, real-time light modulators for hybrid processing,\nnonlinear processing. Optical computing and other applications. Recommended\npreparation: ECE 182 or equivalent.",
  "prerequisite": "ECE 240A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 240A"
   ]
  ]
 },
 {
  "code": "ECE 240C",
  "title": "Optical Modulation and Detection",
  "unit": "4",
  "description": "Propagation of waves and rays in anisotropic media. Electro-optical switching\nand modulation. Acousto-optical deflection and modulation. Detection theory.\nHeterodyne detection, incoherent and coherent detection. Recommended\npreparation: ECE 181, ECE 183, or equivalent.",
  "prerequisite": "ECE 240B;\ngraduate standing.",
  "formatted_pre": [
   [
    "ECE 240B"
   ]
  ]
 },
 {
  "code": "ECE 241A",
  "title": "Nonlinear Optics",
  "unit": "4",
  "description": "Second harmonic generation (color conversion), parametric amplification and\noscillation, photorefractive effects and four-wave mixing, optical\nbistability; applications. Recommended preparation: ECE 240A, C.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 241B",
  "title": "Integrated Photonics",
  "unit": "4",
  "description": "Integrated photonic devices and components made using silicon, compound\nsemiconductors, thin-film crystals, and dielectric materials. Design,\nanalysis, and applications of components (e.g., waveguides, microresonators,\ncouplers, modulators, lasers, and detectors) for use in communications,\nsensing, metrology, and other areas.",
  "prerequisite": "ECE 241A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 241A"
   ]
  ]
 },
 {
  "code": "ECE 241C",
  "title": "Holographic Optical Elements",
  "unit": "4",
  "description": "Fresnel, Fraunhofer, and Fourier holography. Analysis of thin and volume\nholograms, reflection and transmission holograms, color and polarization\nholograms. Optically recorded and computer-generated holography. Applications\nto information storage, optical interconnects, 2-D and 3-D display, pattern\nrecognition, and image processing. Recommended preparation: ECE 182 or\nequivalent.",
  "prerequisite": "ECE 241B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 241B"
   ]
  ]
 },
 {
  "code": "ECE 243B",
  "title": "Optical Fiber Communication",
  "unit": "4",
  "description": "Optical fibers, waveguides, laser communication system. Modulation and\ndemodulation; detection processes and communication-receivers. Recommended\npreparation: ECE 240A-B-C or equivalent.",
  "prerequisite": "ECE 243A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 243A"
   ]
  ]
 },
 {
  "code": "ECE 244A",
  "title": "Statistical Optics",
  "unit": "4",
  "description": "Introduction to statistical phenomena in optics including first order\nproperties of light waves generated from various sources. Coherence of optical\nwaves, high-order coherence. Partial coherence and its effects on imaging\nsystems. Imaging in presence of randomly inhomogeneous medium. Limits in\nphotoelectric detection of light. Recommended preparation: ECE 240A-B.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 247A",
  "title": "Advanced BioPhotonics",
  "unit": "4",
  "description": "Basic physics and chemistry for the interaction of photons with matter,\nincluding both biological and synthetic materials; use of photonic radiation\npressure for manipulation of objects and materials; advanced optoelectronic\ndetection systems, devices and methods, including time resolved fluorescent\nand chemiluminescent methods, fluorescent energy transfer (FRET) techniques,\nquantum dots, and near-field optical techniques; underlying mechanisms of the\nlight sensitive biological systems, including chloroplasts for photosynthetic\nenergy conversion and the basis of vision processes. Cross-listed with BENG\n247A and NANO 247A.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 247B",
  "title": "BioElectronics",
  "unit": "4",
  "description": "Topics to be covered will include photolithographic techniques for high-\ndensity DNA microarray production, incorporation of CMOS control into\nelectronic DNA microarrays, direct electronic detection technology used in\nmicroarrays and biosensor devices and focus on problems related to making\nhighly integrated devices (lab-on-a-chip, in-vivo biosensors, etc.) from\nheterogeneous materials and components. Cross-listed with BENG 247B and NANO\n247B.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 247C",
  "title": "BioNanotechnology",
  "unit": "4",
  "description": "Topics include nanosensors and nanodevices for both clinical diagnostics and\nbiowarfare (bioterror) agent detection; nanostructures for drug delivery;\nnanoarrays and nanodevices; use of nanoanalytical devices and systems; methods\nand techniques for modification or functionalization of nanoparticles and\nnanostructures with biological molecules; nanostructural aspects of fuel cells\nand biofuel cells; potential use of DNA and other biomolecules for computing\nand ultra-high-density data storage. Cross-listed with BENG 247C and NANO\n247C.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 250",
  "title": "Random Processes",
  "unit": "4",
  "description": "Random variables, probability distributions and densities, characteristic\nfunctions. Convergence in probability and in quadratic mean, Stochastic\nprocesses, stationarity. Processes with orthogonal and independent increments.\nPower spectrum and power spectral density. Stochastic integrals and\nderivatives. Spectral representation of wide sense stationary processes,\nharmonizable processes, moving average representations. Recommended\npreparation: ECE 153.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 251A",
  "title": "Digital Signal Processing I",
  "unit": "4",
  "description": "Discrete random signals; conventional (FFT based) spectral estimation.\nCoherence and transfer function estimation; model-based spectral estimation;\nlinear prediction and AR modeling. Levinson-Durbin algorithm and lattice\nfilters, minimum variance spectrum estimation. Cross-listed with SIO 207B. SIO\n207A is intended for graduate students who have not had an undergraduate\ncourse in DSP. Recommended preparation: ECE 153 or ECE 250, ECE 161A or ECE\n251C, ECE 269 or equivalent, and SIO 207A or equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 251B",
  "title": "Digital Signal Processing II",
  "unit": "4",
  "description": "Adaptive filter theory, estimation errors for recursive least squares and\ngradient algorithms, convergence and tracking analysis of LMD, RLS, and Kalman\nfiltering algorithms, comparative performance of Weiner and adaptive filters,\ntransversal and lattice filter implementations, performance analysis for\nequalization, noise cancelling, and linear prediction applications. Cross-\nlisted with SIO 207C.",
  "prerequisite": "graduate standing; ECE 251A (for ECE\n251B); SIO 207B (for SIO 207C).",
  "formatted_pre": []
 },
 {
  "code": "ECE 251C",
  "title": "Filter Banks and Wavelets",
  "unit": "4",
  "description": "Fundamentals of multirate systems (Noble Identities, Polyphase\nrepresentations), maximally decimated filter banks (QMF filters for\n2-channels, M-channel perfect reconstruction systems), Paraunitary perfect\nreconstruction filter banks, the wavelet transform (Multiresolution, discrete\nwavelet transform, filter banks and wavelet).",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 251D",
  "title": "Array Processing",
  "unit": "4",
  "description": "The coherent processing of data collected from sensors distributed in space\nfor signal enhancement and noise rejection purposes or wavefield\ndirectionality estimation. Conventional and adaptive beamforming. Matched\nfield processing. Sparse array design and processing techniques. Applications\nto acoustics, geophysics, and electromagnetics. Cross-listed with SIO 207D.\nRecommended preparation: ECE 251A.",
  "prerequisite": "graduate standing; ECE\n251C (for ECE 251D); SIO 207C (for SIO 207D).",
  "formatted_pre": []
 },
 {
  "code": "ECE 252A",
  "title": "Speech Compression",
  "unit": "4",
  "description": "Speech signals, production and perception, compression theory, high rate\ncompression using waveform coding (PCM, DPCM, ADPCM, . . .), DSP tools for low\nrate coding, LPC vocoders, sinusoidal transform coding, multiband coding,\nmedium rate coding using code excited linear prediction (CELP). Recommended\npreparation: ECE 161A.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 252B",
  "title": "Speech Recognition",
  "unit": "4",
  "description": "Signal analysis methods for recognition, dynamic time warping, isolated word\nrecognition, hidden Markov models, connected word, and continuous speech\nrecognition.",
  "prerequisite": "ECE 252A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 252A"
   ]
  ]
 },
 {
  "code": "ECE 253",
  "title": "Fundamentals of Digital Image Processing",
  "unit": "4",
  "description": "Image quantization and sampling, image transforms, image enhancement, image\ncompression. Recommended preparation: ECE 109, 153, ECE 161, ECE 161A.",
  "prerequisite": null,
  "formatted_pre": []
 },
 {
  "code": "ECE 254",
  "title": "Detection Theory",
  "unit": "4",
  "description": "Hypothesis testing, detection of signals in white and colored Gaussian noise;\nestimation of signal parameters, maximum-likelihood detection; resolution of\nsignals; detection and estimation of stochastic signals; applications to\nradar, sonar, and communications. Recommended preparation: ECE 153.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 255A",
  "title": "Information Theory",
  "unit": "4",
  "description": "Introduction to basic concepts, source coding theorems, capacity, noisy-\nchannel coding theorem. Recommended preparation: ECE 154A-B-C.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 255B",
  "title": "Source Coding",
  "unit": "4",
  "description": "Theory and practice of lossy source coding, vector quantization, predictive\nand differential encoding, universal coding, source-channel coding, asymptotic\ntheory, speech and image applications. Students that have taken 255BN cannot\ntake 255B for credit. Recommended preparation: ECE 250, and 259A or 259AN.",
  "prerequisite": "ECE 255A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 255A"
   ]
  ]
 },
 {
  "code": "ECE 255C",
  "title": "Network Information Theory",
  "unit": "4",
  "description": "The course aims to provide a broad coverage of key results, techniques, and\nopen problems in network information theory. Topics include background\n(information measures and typical sequences, point-to-point communication) and\nsingle-hop networks (multiple access channels, degraded broadcast channels,\ninterference channels, channels with state, general broadcast channels,\nGaussian vector channels, distributed lossless source coding, source coding\nwith side information).",
  "prerequisite": "ECE 250; ECE 255B; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 250"
   ]
  ]
 },
 {
  "code": "ECE 256",
  "title": "Fundamentals of Image and Video Compression",
  "unit": "4",
  "description": "This course provides the theoretical background to image and video\ncompression. Topics cover basic coding tools such as entropy coding,\ntransform, and quantization as well as advanced coding methods: motion\nestimation and compensation, error resilient coding and scalable coding.\nRecommended preparation: Matlab programming.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 257A",
  "title": "Modern Communication Networks",
  "unit": "4",
  "description": "This course focuses on modern local area networks (Wi-Fi, Ethernet, etc.) and\nwide area networks (LTE, 5G, etc.). Topics to be covered include end-to-end\nnetwork architecture, physical layer packet processing, medium access control\nprotocols, mobility management and mobile IP, TCP over wireless, mobile\napplications (e.g., mobile web, real-time video streaming, and telephony).\nRecommended preparation: ECE 158A.",
  "prerequisite": "graduate standing or\nconsent of instructor.",
  "formatted_pre": []
 },
 {
  "code": "ECE 257B",
  "title": "Principles of Wireless Networks",
  "unit": "4",
  "description": "This course will focus on the principles, architectures, and analytical\nmethodologies for design of multiuser wireless networks. Topics to be covered\ninclude cellular approaches, call processing, digital modulation, MIMO\ntechnology, broadband networks, ad-hoc networks, and wireless packet access.\nRecommended preparation: ECE 159A and 154B, or equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 257C",
  "title": "Stochastic Wireless Networks Models",
  "unit": "4",
  "description": "Elements of spatial point processes. Spatial stochastic models of wireless\nnetworks. Topological structure, interference, stochastic dependencies.\nElements of network information theory/statistical physics models of\ninformation flow. Role of signal propagation/random fading models.\nDecentralized operation, route discovery, architectural principles. Energy\nlimitations/random failures. Recommended preparation: previous exposure to\nstochastic processes and information theory.",
  "prerequisite": "ECE 257B;\ngraduate standing.",
  "formatted_pre": [
   [
    "ECE 257B"
   ]
  ]
 },
 {
  "code": "ECE 258A",
  "title": "Digital Communications I",
  "unit": "4",
  "description": "Digital communication theory including performance of various modulation\ntechniques, effects of intersymbol interference, adaptive equalization, spread\nspectrum communication. Recommended preparation: ECE 155. ",
  "prerequisite": "ECE 250; graduate standing.",
  "formatted_pre": [
   [
    "ECE 250"
   ]
  ]
 },
 {
  "code": "ECE 258B",
  "title": "Digital Communications II",
  "unit": "4",
  "description": "Digital communication theory including performance of various modulation\ntechniques, effects of intersymbol interference, adaptive equalization, and\nspread spectrum communication.",
  "prerequisite": "ECE 258A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 258A"
   ]
  ]
 },
 {
  "code": "ECE 259A",
  "title": "Algebraic Coding",
  "unit": "4",
  "description": "Fundamentals of block codes, introduction to groups, rings and finite fields,\nnonbinary codes, cyclic codes such as BCH and RS codes, decoding algorithms,\napplications. Students who have taken ECE 259AN may not receive credit for ECE\n259A.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 259B",
  "title": "Probabilistic Coding",
  "unit": "4",
  "description": "Convolutional codes, maximum-likelihood (ML) decoding, maximum a-posteriori\n(MAP) decoding, parallel and serial concatenation architectures, turbo codes,\nrepeat-accumulate (RA) codes, the turbo principle, turbo decoding, graph-based\ncodes, message-passing decoding, low-density parity check codes, threshold\nanalysis, applications. Students who have taken ECE 259BN may not receive\ncredit for ECE 259B. Recommended preparation: ECE 154A-B-C.",
  "prerequisite": "ECE 259A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 259A"
   ]
  ]
 },
 {
  "code": "ECE 259C",
  "title": "Advanced Topics in Coding",
  "unit": "4",
  "description": "Advanced topics in coding theory. Course contents vary by instructor. Example\ncourse topics: Coded-modulation for bandwidth-efficient data transmission;\nadvanced algebraic and combinatorial coding theory; space-time coding for\nwireless communications; constrained coding for digital recording. Students\nwho have taken ECE 259CN may not receive credit for ECE 259C.",
  "prerequisite": "ECE 259A-B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 259A"
   ]
  ]
 },
 {
  "code": "ECE 260A",
  "title": "VLSI Digital System Algorithms and Architectures",
  "unit": "4",
  "description": "Custom and semicustom VLSI design from both the circuit and system designer's\nperspective. MOS transistor theory, circuit characterization, and performance\nestimation. CMOS logic design will be emphasized. Computer-aided design (CAD)\ntools for transistor level simulation, layout and verification will be\nintroduced. Includes two hours of laboratory hours per week. Recommended\npreparation: undergraduate-level semiconductor electronics and digital system\ndesign, ECE 165 or equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 260B",
  "title": "VLSI Integrated Circuits and Systems Design",
  "unit": "4",
  "description": "VLSI implementation methodology across block, circuit, and layout levels of\nabstraction. Circuit building blocks including embedded memory and clock\ndistribution. Computer-aided design (synthesis, place-and-route, verification)\nand performance analyses, and small-group block implementation projects\nspanning RTL to tape-out using leading-edge EDA tools. Cross-listed with CSE\n241A. Recommended preparation: ECE 165.",
  "prerequisite": "ECE 260A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 260A"
   ]
  ]
 },
 {
  "code": "ECE 260C",
  "title": "VLSI Advanced Topics",
  "unit": "4",
  "description": "Advanced topics in design practices and methodologies for modern system-on-\nchip design. Different design alternatives are introduced and analyzed.\nAdvanced design tools are used to design a hardware-software system. Class\ndiscussion, participation, and presentations of projects and special topics\nassignments are emphasized.",
  "prerequisite": "ECE 260B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 260B"
   ]
  ]
 },
 {
  "code": "ECE 264A",
  "title": "CMOS Analog Integrated Circuits and Systems I",
  "unit": "4",
  "description": "Frequency response of the basic CMOS gain stage and current mirror\nconfigurations. Advanced feedback and stability analysis; compensation\ntechniques. High-Performance CMOS operational amplifier topologies. Analysis\nof noise and distortion. Recommended preparation: ECE 164 and ECE 153, or\nequivalent courses.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 264B",
  "title": "CMOS Analog Integrated Circuits and Systems II",
  "unit": "4",
  "description": "Nonideal effects and their mitigation in high-performance operational\namplifiers. Switched-capacitor circuit techniques: CMOS circuit topologies,\nanalysis and mitigation of nonideal effects, and filter synthesis. Overview of\nCMOS samplers, data converters, and PLLs. Recommended preparation: ECE 251A or\nECE 251AN.",
  "prerequisite": "ECE 264A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 264A"
   ]
  ]
 },
 {
  "code": "ECE 264C",
  "title": "CMOS Analog Integrated Circuits and Systems III",
  "unit": "4",
  "description": "Integrated CMOS analog/digital systems: Analog to digital and digital to\nanalog converters, Nyquist versus oversampling, linearity, jitter,\nrandomization, calibration, speed versus resolution, pipeline, folding,\ninterpolation, averaging. Recommended preparation: ECE 163 and 164.",
  "prerequisite": "ECE 264B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 264B"
   ]
  ]
 },
 {
  "code": "ECE 264D",
  "title": "CMOS Analog Integrated Circuits and Systems IV",
  "unit": "4",
  "description": "PLL: Phase noise effect, VCO, phase detector, charge pump,\ninteger/fractional-N frequency synthesizer, clock and data recovery, decision\nfeedback. Filter: Continuous-time filter, I-Q complex filter, raised-cosine,\nGaussian, delay, zero equalizers. Recommended preparation: ECE 163 and 164.",
  "prerequisite": "ECE 264C; graduate standing.",
  "formatted_pre": [
   [
    "ECE 264C"
   ]
  ]
 },
 {
  "code": "ECE 265A",
  "title": "Communication Circuit Design I",
  "unit": "4",
  "description": "Introduction to noise and linearity concepts. System budgeting for optimum\ndynamic range. Frequency plan tradeoffs. Linearity analysis techniques. Down-\nconversion and up-conversion techniques. Modulation and demodulation.\nMicrowave and RF system design communications. Current research topics in the\nfield.",
  "prerequisite": "ECE 166 or consent of instructor; graduate standing.",
  "formatted_pre": [
   [
    "ECE 166"
   ]
  ]
 },
 {
  "code": "ECE 265B",
  "title": "Communication Circuit Design II",
  "unit": "4",
  "description": "Radio frequency integrated circuits: low-noise amplifiers, AGCs, mixers,\nfilters, voltage-controlled oscillators. BJT and CMOS technologies for radio\nfrequency and microwave applications. Device modeling for radio frequency\napplications. Design and device tradeoffs of linearity, noise, power\ndissipation, and dynamic range. Current research topics in the field.",
  "prerequisite": "ECE 166 and ECE 265A or consent of instructor; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 166"
   ],
   [
    "ECE 265A"
   ]
  ]
 },
 {
  "code": "ECE 265C",
  "title": "Power Amplifiers for Wireless Communications",
  "unit": "4",
  "description": "Design of power amplifiers for mobile terminals and base-stations, with\nemphasis on high linearity and efficiency. After a discussion of classical\ndesigns (Class A, AB, B, C, D, E, F, and S), linearization procedures are\npresented and composite architectures (envelope tracking, EER, and Doherty)\nare covered. Familiarity with basic microwave design and communication system\narchitecture is assumed. Recommended preparation: ECE 166.",
  "prerequisite": "ECE 265A-B; consent of instructor; graduate standing.",
  "formatted_pre": [
   [
    "ECE 265A"
   ]
  ]
 },
 {
  "code": "ECE 265D",
  "title": "Communication Circuits III",
  "unit": "4",
  "description": "Direct conversion and IF up-conversion mixers, harmonic and spurious\nemissions, I/Q mismatch, LO leakage, receive/GPS band noise, harmonic and\n4fmod suppression. Driver amplifiers, load-line, OIP3/ACPR, P1dB, Psat, PAE,\nin-band noise and distortion, out-of-band noise and emissions. VCO design, in-\nband and out-of-band phase noise. N-path filters. Diversity, MIMO, carrier\naggregation and beamforming receiver and transmitter architectures.",
  "prerequisite": "ECE 265A-B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 265A"
   ]
  ]
 },
 {
  "code": "ECE 267",
  "title": "Network/Graph Algorithms and Analysis",
  "unit": "4",
  "description": "Modern theory of networks from the algorithmic perspective with emphasis on\nthe foundations in terms of performance analysis and design. Topics include\nalgorithmic questions arising in the context of scheduling, routing, and\ncongestion control in communication networks, including wired, wireless,\nsensor, and social networks.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 268",
  "title": "Security of Hardware Embedded Systems",
  "unit": "4",
  "description": "The course gives an overview of areas of security and protection of modern\nhardware, embedded systems, and IoTs. Covers essential cryptographic\nmethodologies and blocks required for building a secure system. Topics include\nlow overhead security, physical and side-channel attacks, physical security\nprimitives, physical security and proofs of presence, hardware-based secure\nprogram execution, scalable implementation of secure functions, emerging\ntechnologies, and rising threats. Recommended preparation: Programming in a\nstandard programming language. Undergraduate level knowledge of the IC design\nflow and digital designs.",
  "prerequisite": "graduate standing. ****",
  "formatted_pre": []
 },
 {
  "code": "ECE 269",
  "title": "Linear Algebra and Application",
  "unit": "4",
  "description": "This course will build mathematical foundations of linear algebraic techniques\nand justify their use in signal processing, communication, and machine\nlearning. Topics include geometry of vector and Hilbert spaces, orthogonal\nprojection, systems of linear equations and role of sparsity, eigenanalysis,\nHermitian matrices and variational characterization, positive semidefinite\nmatrices, singular value decomposition, and principal component analysis.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 271A",
  "title": "Statistical Learning I",
  "unit": "4",
  "description": "Bayesian decision theory; parameter estimation; maximum likelihood; the bias-\nvariance trade-off; Bayesian estimation; the predictive distribution;\nconjugate and noninformative priors; dimensionality and dimensionality\nreduction; principal component analysis; Fisher's linear discriminant\nanalysis; density estimation; parametric vs. kernel-based methods;\nexpectation-maximization; applications. Recommended preparation: ECE 109.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 271B",
  "title": "Statistical Learning II",
  "unit": "4",
  "description": "Linear discriminants; the Perceptron; the margin and large margin classifiers;\nlearning theory; empirical vs. structural risk minimization; the VC dimension;\nkernel functions; reproducing kernel Hilbert spaces; regularization theory;\nLagrangian optimization; duality theory; the support vector machine; boosting;\nGaussian processes; applications. Recommended preparation: ECE 109.",
  "prerequisite": "ECE 271A; graduate standing.",
  "formatted_pre": [
   [
    "ECE 271A"
   ]
  ]
 },
 {
  "code": "ECE 271C",
  "title": "Deep Learning and Applications",
  "unit": "4",
  "description": "Foundations of deep learning. Deep learning architectures and learning\nalgorithms. Feedforward, convolutional, and recurrent networks.\nRegularization. Applications to vision, speech, or text processing.",
  "prerequisite": "ECE 271A-B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 271A"
   ]
  ]
 },
 {
  "code": "ECE 272A",
  "title": "Stochastic Processes in Dynamic Systems I",
  "unit": "4",
  "description": "Diffusion equations, linear and nonlinear estimation and detection, random\nfields, optimization of stochastic dynamic systems, applications of stochastic\noptimization to problems. Recommended preparation: ECE 250.",
  "prerequisite": "ECE 269; graduate standing.",
  "formatted_pre": [
   [
    "ECE 269"
   ]
  ]
 },
 {
  "code": "ECE 272B",
  "title": "Stochastic Processes in Dynamic Systems II",
  "unit": "4",
  "description": "Continuous and discrete random processes, Markov models and hidden Markov\nmodels, Martingales, linear and nonlinear estimation. Applications in\nmathematical finance and real options.",
  "prerequisite": "ECE 272A; graduate\nstanding.",
  "formatted_pre": [
   [
    "ECE 272A"
   ]
  ]
 },
 {
  "code": "ECE 273",
  "title": "Convex Optimization and Applications",
  "unit": "4",
  "description": "This course covers some convex optimization theory and algorithms. It will\nmainly focus on recognizing and formulating convex problems, duality, and\napplications in a variety of fields (system design, pattern recognition,\ncombinatorial optimization, financial engineering, etc.).",
  "prerequisite": "ECE 269; graduate standing.",
  "formatted_pre": [
   [
    "ECE 269"
   ]
  ]
 },
 {
  "code": "ECE 275A",
  "title": "Parameter Estimation I",
  "unit": "4",
  "description": "Linear least Squares (batch, recursive, total, sparse, pseudoinverse, QR,\nSVD); Statistical figures of merit (bias, consistency, Cramer-Rao lower-bound,\nefficiency); Maximum likelihood estimation (MLE); Sufficient statistics;\nAlgorithms for computing the MLE including the Expectation Maximation (EM)\nalgorithm. The problem of missing information; the problem of outliers.\nRecommended preparation: ECE 109 and ECE 153.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 275B",
  "title": "Parameter Estimation II",
  "unit": "4",
  "description": "The Bayesian statistical framework; Parameter and state estimation of Hidden\nMarkov Models, including Kalman Filtering and the Viterbi and Baum-Welsh\nalgorithms. A solid foundation is provided for follow-up courses in Bayesian\nmachine learning theory. Recommended preparation: ECE 153.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 276A",
  "title": "Sensing and Estimation in Robotics",
  "unit": "4",
  "description": "This course covers the mathematical fundamentals of Bayesian filtering and\ntheir application to sensing and estimation in mobile robotics. Topics include\nmaximum likelihood estimation (MLE), expectation maximization (EM), Gaussian\nand particle filters, simultaneous localization and mapping (SLAM), visual\nfeatures and optical flow, and hidden Markov models (HMM).",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 276B",
  "title": "Planning and Learning in Robotics",
  "unit": "4",
  "description": "This course covers optimal control and reinforcement learning fundamentals and\ntheir application to planning and decision-making in mobile robotics. Topics\ninclude Markov decision processes (MDP), Pontryagin’s maximum principle,\nlinear quadratic regulation (LQR), deterministic planning, value and policy\niteration, and policy gradient methods.",
  "prerequisite": "ECE 276A;\ngraduate standing.",
  "formatted_pre": [
   [
    "ECE 276A"
   ]
  ]
 },
 {
  "code": "ECE 276C",
  "title": "Robot Reinforcement Learning",
  "unit": "4",
  "description": "Course participants will explore new methods for robotics, particularly toward\nenabling robot manipulators in complex environments. This course is structured\nto rapidly consider the previous techniques in robot manipulation to date and\nexplore methods in reinforcement learning to solve open problems in robot\nmanipulation. Topics will review kinematics, dynamics, low-level control and\nmotion planning, and machine learning approaches.",
  "prerequisite": "ECE\n276B; graduate standing.",
  "formatted_pre": [
   [
    "ECE 276B"
   ]
  ]
 },
 {
  "code": "ECE 277",
  "title": "GPU Programming",
  "unit": "4",
  "description": "This course is a high-level GPU programming for parallel data processing.\nTopics cover parallel CUDA programming on GPU including efficient memory\naccess, threading models, multi-stream, and multi-GPU programming. Focusing on\nhands-on applications such as big data processing, visualization, and an\nartificial intelligence through the real-time GPU system. Recommended\npreparation: High-level C/C++ programming skills, ECE 15 or equivalent, CSE\n240A or the equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 278",
  "title": "Mathematical Topics for the Master's Comprehensive Exam",
  "unit": "4",
  "description": "Mathematical topics covered in the ECE master's comprehensive exam including\ncalculus, linear algebra and linear systems, and statistics and probability\ntheory. Additional topics include vector calculus, partial differential\nequations, linear transformations, and probability.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 279",
  "title": "Special Seminar",
  "unit": "2",
  "description": "A seminar course in which topics of special interest for electrical and\ncomputer engineering students will be presented. S/U grades only. May be taken\nfor credit three times.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 281",
  "title": "Special Topics in Nanoscience/Nanotechnology",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which topics of\ninterest in nanoscience and nanotechnology will be presented by visiting or\nresident faculty members. Subject matter will not be repeated, may be taken\nfor credit more than once.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 282",
  "title": "Special Topics in Photonics/Applied Optics",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which topics of\ninterest in photonics, optoelectronic materials, devices, systems, and\napplications will be presented by visiting or resident faculty members.\nSubject matter will not be repeated, may be taken for credit more than once.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 283",
  "title": "Special Topics in Electronic Circuits and Systems",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which topics of\ninterest in electronic circuits and systems will be presented by visiting or\nresident faculty members. Subject matter will not be repeated, may be taken\nfor credit more than once.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 284",
  "title": "Special Topics in Computer Engineering",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which topics of\ninterest in computer engineering will be presented by visiting or resident\nfaculty members. Subject matter will not be repeated, may be taken for credit\nmore than once.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 287",
  "title": "Special Topics in Communication Theory and Systems",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which topics of\ninterest in information science will be presented by visiting or resident\nfaculty members. It will not be repeated so it may be taken for credit more\nthan once.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 289",
  "title": "Special Topics in Electrical and Computer Engineering",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty at which general topics\nof interest in electrical and computer engineering will be presented by\nvisiting or resident faculty members. May be taken for credit six times\nprovided each course is a different topic.",
  "prerequisite": "graduate\nstanding.",
  "formatted_pre": []
 },
 {
  "code": "ECE 290",
  "title": "Graduate Seminar on Current ECE Research",
  "unit": "2",
  "description": "Weekly discussion of current research conducted in the Department of\nElectrical and Computer Engineering by the faculty members involved in the\nresearch projects. (S/U grades only.)",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 291",
  "title": "Industry Sponsored Engineering Design Project",
  "unit": "4",
  "description": "Design, build, and demonstrate an engineering project by groups. All students\ngive weekly progress reports on tasks and write final report, with individual\nexams and presentations. Projects/sponsorships originate from the needs of\nlocal industry. Recommended preparation: ECE 230 or ECE 240 or ECE 251 or ECE\n253 or ECE 258 or equivalent.",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 293",
  "title": "Graduate Seminar in Communication Theory and Systems",
  "unit": "2",
  "description": "Weekly discussion of current research topics in communication theory and\nsystems. (S/U grades only.)",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 296",
  "title": "Graduate Seminar in Photonics/Applied Optics",
  "unit": "2",
  "description": "Weekly discussion of current research topics in photonics and applied optics,\nincluding imaging, photonic communications, sensing, energy and signal\nprocessing. (S/U grades only.)",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 297",
  "title": "Graduate Seminar in Nanoscience/Nanotechnology",
  "unit": "2",
  "description": "Weekly discussion of current research topics in nanoscience and\nnanotechnology. (S/U grades only.)",
  "prerequisite": "graduate standing.",
  "formatted_pre": []
 },
 {
  "code": "ECE 298",
  "title": "Independent Study",
  "unit": "1-16",
  "description": "Open to properly qualified graduate students who wish to pursue a problem\nthrough advanced study under the direction of a member of the staff. (S/U\ngrades only.)",
  "prerequisite": "consent of instructor.",
  "formatted_pre": []
 },
 {
  "code": "ECE 299",
  "title": "Research",
  "unit": "1-16",
  "description": "(S/U grades only.)",
  "prerequisite": null,
  "formatted_pre": []
 },
 {
  "code": "ECE 501",
  "title": "Teaching",
  "unit": "1-4",
  "description": "Teaching and tutorial activities associated with courses and seminars. Number\nof units for credit depends on number of hours devoted to class or section\nassistance. (S/U grades only.)",
  "prerequisite": "consent of department chair.",
  "formatted_pre": []
 }
]