[
 {
  "code": "AAS 10",
  "title": "Introduction to African American Studies",
  "unit": "4",
  "discription": "This course will cover the experiences of peoples of African descent in the U.S. and broader African Diaspora from the vantage points of cultural production, political practice, socioeconomic conditions, and the overall struggle for social justice along intersecting lines of race, gender, and class. Topics reviewed include slavery (and slave rebellion), Reconstruction, Jim Crow apartheid, the Great Migration and Harlem Renaissance, and the Civil Rights and Black Power Movements.",
  "prerequsite": null
 },
 {
  "code": "AAS 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "discription": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to 15-20 students. Enrollment priority will be given to first-year students. Seminars are open to sophomores, juniors and seniors on a space available basis. P/NP grades only. May be taken for credit four times.",
  "prerequsite": null
 },
 {
  "code": "AAS 185",
  "title": "#BlackLivesMatter",
  "unit": "4",
  "discription": "(Cross-listed with ANSC 185.) This seminar traces the historical roots and growth of the Black Lives Matter social movement in the United States and comparative global contexts. Occupy Wall Street, protests against the prison industrial complex, black feminist, and LGBTQ intersectionality are explored in the context of millennial and post-millennial youth as the founders of this movement. Students may not receive credit for AAS 185 and ANSC 185.",
  "prerequsite": null
 },
 {
  "code": "ANSC 185",
  "title": "#BlackLivesMatter",
  "unit": "4",
  "discription": "(Cross-listed with AAS 185.) This seminar traces the historical roots and growth of the Black Lives Matter social movement in the United States and comparative global contexts. Occupy Wall Street, protests against the prison industrial complex, black feminist, and LGBTQ intersectionality are explored in the context of millennial and post-millennial youth as the founders of this movement. Students may not receive credit for AAS 185 and ANSC 185.",
  "prerequsite": null
 },
 {
  "code": "AAS 190",
  "title": "Special Topics in African American Studies",
  "unit": "1–4",
  "discription": "This course will explore specialized, relevant topics in the field of African American studies. Course topics will vary from quarter to quarter, so it may be repeated up to three times as long as the quarterly topics vary.",
  "prerequsite": null
 },
 {
  "code": "AAS 198",
  "title": "Directed Group Study in African American Studies",
  "unit": "2 or 4",
  "discription": "Directed group study on a topic or in a field not included in the regular curriculum by special arrangement with a faculty member. P/NP grades only. May be taken for credit two times.",
  "prerequsite": "upper-division standing unless otherwise authorized. Completion of ninety units of undergraduate study, and completion and approval of the Special Studies form."
 },
 {
  "code": "AAS 199",
  "title": "Independent Study in African American Studies",
  "unit": "2 or 4",
  "discription": "Individual research and study on a particular subject related to African American studies by special arrangement with and under the direction of a faculty member. P/NP grades only. May be taken for credit two times.",
  "prerequsite": "upper-division standing. Enrollment via the faculty director of the African American Studies Minor only."
 }
]