[
 {
  "code": "BENG 1",
  "title": "Introduction to Bioengineering",
  "unit": "2",
  "description": "An introduction to bioengineering that includes lectures and hands-on laboratory for design projects. The principles of problem definition, engineering inventiveness, team design, prototyping, and testing, as well as information access, engineering standards, communication, ethics, and social responsibility will be emphasized. P/NP grades only.",
  "prerequisite": "none. (W)"
 },
 {
  "code": "BENG 2",
  "title": "Introductory Computer Programming and Matlab",
  "unit": "2",
  "description": "Introduction to Matlab is designed to give students fluency in Matlab, including popular toolboxes. Consists of interactive lectures with a computer running Matlab for each student. Topics: variables, operations, and plotting; visualization and programming; and solving equations and curve fitting.",
  "prerequisite": "bioengineering: biosystems majors only or consent of department. (F)"
 },
 {
  "code": "BENG 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "BENG 97",
  "title": "Internship/Field Studies",
  "unit": "1-4",
  "description": "An enrichment program available to a limited number of lower-division undergraduate students, which provides work experience with industry, government offices, and hospitals. The internship is coordinated through UC San Diego's Academic Internship Program under the supervision of a faculty member and an industrial, government, or hospital employee.",
  "prerequisite": "lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Special Studies form. (F,W,S)"
 },
 {
  "code": "BENG 98",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study on a topic or in a field not included in the regular department curriculum. (P/NP grades only.)",
  "prerequisite": "lower-division standing, completion of thirty units of undergraduate study at UC San Diego with a UC San Diego GPA of at least 3.0 and consent of a bioengineering faculty member; completed and approved Special Studies form."
 },
 {
  "code": "BENG 99",
  "title": "Independent Study for Undergraduates",
  "unit": "4",
  "description": "Independent reading or research by arrangement with a bioengineering faculty member. (P/NP grades only.)",
  "prerequisite": "lower-division standing, completion of thirty units of undergraduate study at UC San Diego with a UC San Diego GPA of at least 3.0 and consent of a bioengineering faculty member; completed and approved Special Studies form."
 },
 {
  "code": "BENG 99H",
  "title": "Independent Study",
  "unit": "1",
  "description": "Independent study or research under direction of a member of the faculty.",
  "prerequisite": "student must be of first-year standing and a Regents Scholar; approved Special Studies form."
 },
 {
  "code": "BENG 100",
  "title": "Statistical Reasoning for Bioengineering Applications",
  "unit": "4",
  "description": "General introduction to probability and statistical analysis, applied to bioengineering design. Topics include preliminary data analysis, probabilistic models, experiment design, model fitting, goodness-of-fit analysis, and statistical inference/estimation. Written and software problems are provided for modeling and visualization.",
  "prerequisite": "BENG 1, MATH 18 or MATH 31AH or MATH 20F, MATH 20C or MATH 31BH, and MATH 20D, and PHYS 2A-B-C, or consent of department. (S)"
 },
 {
  "code": "BENG 102",
  "title": "Molecular Components of Living Systems",
  "unit": "4",
  "description": "Introduction to molecular structures. Macromolecules and assemblies-proteins, nucleic acids, and metabolites. Principles of design of simple and complex components of organelles, cells, and tissues.",
  "prerequisite": "BENG 120 or consent of department. (S)"
 },
 {
  "code": "BENG 103B",
  "title": "Bioengineering Mass Transfer",
  "unit": "4",
  "description": "Mass transfer in solids, liquids, and gases with application to biological systems. Free and facilitated diffusion. Convective mass transfer. Diffusion- reaction phenomena. Active transport. Biological mass transfer coefficients. Steady and unsteady state. Flux-force relationships. (Credit not allowed for both CENG 101C and BENG 103B.)",
  "prerequisite": "CENG 101A or MAE 101A or BENG 112A, or consent of department. (S) **"
 },
 {
  "code": "BENG 110",
  "title": "Musculoskeletal Biomechanics",
  "unit": "4",
  "description": "Statics, dynamics, and solid mechanics of hard and soft musculoskeletal tissues. Forces, moments, static equilibrium, kinematics, kinetics applied to human mechanics, and movement. Stress, strain, and material properties of musculoskeletal tissues. Problem solving and design in biomechanics.",
  "prerequisite": "MATH 20D, MATH 20E or MATH 31CH, MATH 18 or MATH 31AH; PHYS 2C, or consent of department. (F)"
 },
 {
  "code": "BENG 112A",
  "title": "Soft Tissue Biomechanics",
  "unit": "4",
  "description": "Tensor analysis. Stress, strain, equilibrium, and constitutive law for soft biological tissues. Applications of solid mechanics to mammalian tissue physiology. Viscoelasticity. Finite elasticity. Problem solving and design in soft tissue biomechanics.",
  "prerequisite": "BENG 110 or consent of department. (W)"
 },
 {
  "code": "BENG 112B",
  "title": "Fluid and Cell Biomechanics",
  "unit": "4",
  "description": "Fluid hydrostatics and flow dynamics. Flow kinematics and conservation laws applied to the circulation. Viscous biofluids. Biopolymers, cell mechanics, and mechanobiology. Problem solving and design in biofluid and cell mechanics.",
  "prerequisite": "BENG 112A or consent of department. (S)"
 },
 {
  "code": "BENG 119A",
  "title": "Design Development in Biomechanics",
  "unit": "3",
  "description": "Development of design project in biomechanics.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 119B",
  "title": "Design Implementation in Biomechanics",
  "unit": "3",
  "description": "Implementation of design project in biomechanics.",
  "prerequisite": "concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 120",
  "title": "Organic Chemistry Structural and Design Principles",
  "unit": "4",
  "description": "Structural and design principles of carbon compounds. Structure and stereochemistry. Functional groups and chemical transformations. Structure and design principles of biomolecules. Molecules of life and their organization.",
  "prerequisite": "CHEM 6A and 6B; majors only or consent of department. (W)"
 },
 {
  "code": "BENG 122A",
  "title": "Biosystems and Control",
  "unit": "4",
  "description": "Systems and control theory applied to bioengineering. Modeling, linearization, transfer functions, Laplace transforms, closed-loop systems, design and simulation of controllers. Dynamic behavior and controls of first and second order processes. PID controllers. Stability. Bode design. Features of biological controls systems. A simulation project using Matlab and an oral presentation are required. Credit not allowed for both ECE 101 and BENG 122A.",
  "prerequisite": "MAE 140 or BENG 134 or consent of department. (F)"
 },
 {
  "code": "BENG 123",
  "title": "Dynamic Simulation in Bioengineering",
  "unit": "4",
  "description": "Dynamic simulation of biochemical reaction networks, including reconstruction of networks, mathematical description of kinetics of biochemical reactions, dynamic simulation of systems of biochemical reactions, and use of simulators for data interpretation and prediction in biology. Emphasis on a design project.",
  "prerequisite": "MATH 18 or MATH 31AH, MATH 20D, BENG 120, or CHEM 40B; majors only or consent of department. (W)"
 },
 {
  "code": "BENG 125",
  "title": "Modeling and Computation in Bioengineering",
  "unit": "4",
  "description": "Computational modeling of molecular bioengineering phenomena: excitable cells, regulatory networks, and transport. Application of ordinary, stochastic, and partial differential equations. Introduction to data analysis techniques: power spectra, wavelets, and nonlinear time series analysis.",
  "prerequisite": "BENG 122A or BENG 123 or consent of department. (S)"
 },
 {
  "code": "BENG 126A",
  "title": "Design Development in Bioinformatics Bioengineering",
  "unit": "3",
  "description": "Development of design project in bioinformatics bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 126B",
  "title": "Design Implementation in Bioinformatics Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in bioinformatics bioengineering.",
  "prerequisite": "BENG 126A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 127A",
  "title": "Design Development in Molecular Systems Bioengineering",
  "unit": "3",
  "description": "Development of design project in molecular systems bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 127B",
  "title": "Design Implementation in Molecular Systems Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in molecular systems bioengineering.",
  "prerequisite": "BENG 127A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 128A",
  "title": "Design Development in Genetic Circuits Bioengineering",
  "unit": "3",
  "description": "Development of design project in genetic circuits bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 128B",
  "title": "Design Implementation in Genetic Circuits Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in genetic circuits bioengineering.",
  "prerequisite": "BENG 128A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 129A",
  "title": "Design Development in Cell Systems Bioengineering",
  "unit": "3",
  "description": "Development of design project in cell systems bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 129B",
  "title": "Design Implementation in Cell Systems Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in cell systems bioengineering.",
  "prerequisite": "BENG 129A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 130",
  "title": "Biotechnology Thermodynamics and Kinetics",
  "unit": "4",
  "description": "An introduction to physical principles that govern biological matter and processes, with engineering examples. Thermodynamic principles, structural basis of life, molecular reactions and kinetics, and models to illustrate biological phenomena.",
  "prerequisite": "CHEM 6B, MATH 20A, 20B, 20D, PHYS 2A, 2B, 2C; majors only or consent of department. (W)"
 },
 {
  "code": "BENG 133",
  "title": "Numerical Analysis and Computational Engineering",
  "unit": "4",
  "description": "Principles of digital computing, including number representation and arithmetic operations. Accuracy, stability, and convergence. Algorithms for solving linear systems of equations, interpolation, numerical differentiation, and integration and ordinary differential equations.",
  "prerequisite": "MATH 20D and 18 or consent of department. (S)"
 },
 {
  "code": "BENG 134",
  "title": "Measurements, Statistics, and Probability",
  "unit": "4",
  "description": "A combined lecture and laboratory course that provides an introductory treatment of probability theory, including distribution functions, moments, and random variables. Practical applications include estimation of means and variances, hypothesis testing, sampling theory, and linear regression.",
  "prerequisite": "MATH 20D and MATH 18 or MATH 31AH; BENG 100 or consent of department. (F)"
 },
 {
  "code": "BENG 135",
  "title": "Biomedical Signals and Systems",
  "unit": "4",
  "description": "Discrete systems: linearity, convolution, impulse, and step responses. Linear systems properties. Difference equations. Fourier Series. Continuous FS. Discrete FS. Periodic signals, filtering, and FT. Discrete FT examples. Frequency response of linear systems. Sampling. Relationship between FT, DFT. Laplace Transform. LT and inverse LT.",
  "prerequisite": "ECE 45 and BENG 133 or consent of department. (F) Not offered until fall 2016."
 },
 {
  "code": "BENG 139A",
  "title": "Design Development in Molecular Bioengineering",
  "unit": "3",
  "description": "Development of design project in molecular bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 139B",
  "title": "Design Implementation in Molecular Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in molecular bioengineering.",
  "prerequisite": "BENG 139A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 140A",
  "title": "Bioengineering Physiology",
  "unit": "4",
  "description": "Introductory mammalian physiology for bioengineering students, with emphasis on control mechanisms and engineering principles. Basic cell functions; biological control systems; muscle; neural; endocrine, and circulatory systems. Not intended for premedical bioengineering students. Credit not allowed for both BIPN 100 and BENG 140A.",
  "prerequisite": "CHEM 6A-B, PHYS 2A-B-C, BILD 1, or BENG 102; majors only or consent of department. (W)"
 },
 {
  "code": "BENG 140B",
  "title": "Bioengineering Physiology",
  "unit": "4",
  "description": "Introductory mammalian physiology for bioengineering students, with emphasis on control mechanisms and engineering principles. Digestive, respiratory, renal, and reproductive systems; regulation of metabolism, and defense mechanisms. (Credit not allowed for both BIPN 102 and BENG 140B.)",
  "prerequisite": "BENG 140A; majors only or consent of instructor. (S)"
 },
 {
  "code": "BENG 141",
  "title": "Biomedical Optics and Imaging",
  "unit": "4",
  "description": "Introduction to optics. Light propagation in tissue. Propagation modeling. Optical components. Laser concepts. Optical coherence tomography. Microscopic scattering. Tissue optics. Microscopy. Confocal microscopy. Polarization in tissue. Absorption, diffuse reflection, light scattering spectroscopy. Raman, fluorescence lifetime imaging. Photo-acoustic imaging.",
  "prerequisite": "BENG 100 or consent of department. (F)"
 },
 {
  "code": "BENG 147A",
  "title": "Design Development in Neural Engineering",
  "unit": "3",
  "description": "Development of design project in neural engineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 147B",
  "title": "Design Implementation in Neural Engineering",
  "unit": "3",
  "description": "Implementation of design project in neural engineering.",
  "prerequisite": "BENG 147A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 148A",
  "title": "Design Development in Cardiac Bioengineering",
  "unit": "3",
  "description": "Development of design project in cardiac bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 148B",
  "title": "Design Implementation in Cardiac Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in cardiac bioengineering.",
  "prerequisite": "BENG 148A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 149A",
  "title": "Design Development in Vascular Bioengineering",
  "unit": "3",
  "description": "Development of design project in vascular bioengineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 149B",
  "title": "Design Implementation in Vascular Bioengineering",
  "unit": "3",
  "description": "Implementation of design project in vascular bioengineering.",
  "prerequisite": "BENG 149A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 152",
  "title": "Biosystems Engineering Laboratory",
  "unit": "4",
  "description": "Experimental study of real and simulated systems and their controls (examples will include electrical, biological, and biomechanical systems). Projects consist of identification, input-output analysis, design, and implementation of analog controls. Laboratory examples will include electrical circuit design and analysis, analysis of living tissues such as bone, analysis and manipulation of cells (bacteria in chemostat). Program or materials fees may apply.",
  "prerequisite": "BENG 102; bioengineering: biosystems majors only or consent of department. (W)"
 },
 {
  "code": "BENG 160",
  "title": "Chemical and Molecular Bioengineering Techniques",
  "unit": "4",
  "description": "Introductory laboratory course in current principles and techniques of chemistry and molecular biology applicable to bioengineering. Quantitation of proteins and nucleic acids by spectrophotometric, immunological, and enzymatic methods. Separations and purification by centrifugation, chromatographic, and electrophoretic methods. Course materials fees may apply.",
  "prerequisite": "BICD 100, BENG 100, MAE 170; majors only or consent of department. (S)"
 },
 {
  "code": "BENG 161A",
  "title": "Bioreactor Engineering",
  "unit": "4",
  "description": "Engineering, biochemical, and physiological considerations in the design of bioreactor processes: enzyme kinetics, mass transfer limitations, microbial growth, and product formation kinetics. Fermentation reactor selection, design, scale-up, control. Quantitative bioengineering analysis and design of biochemical processes and experiments on biomolecules.",
  "prerequisite": "BENG 123 and BENG 160 or consent of department. (F)"
 },
 {
  "code": "BENG 161B",
  "title": "Biochemical Engineering",
  "unit": "4",
  "description": "Commercial production of biochemical commodity products. Application of genetic control systems and mutant populations. Recombinant DNA and eukaryotic proteins in _E. coli_ and other host organisms. Product recovery operations, including the design of bioseparation processes of filtration, adsorption, chromatography, and crystallization. Bioprocess economics. Human recombinant erythropoietin as an example, from genomic cloning to CHO cell expression, to bioreactor manufacturing and purification of medical products for clinical application.",
  "prerequisite": "BENG 161A or consent of department. (W)"
 },
 {
  "code": "BENG 162",
  "title": "Biotechnology Laboratory",
  "unit": "4",
  "description": "Laboratory practices and design principles for biotechnology. Culture of microorganisms and mammalian cells, recombinant DNA bioreactor design and operation. Design and implementation of biosensors. A team design-based term project and oral presentation required. Course materials fees may apply.",
  "prerequisite": "MAE 170 and BENG 160; majors only or consent of department. (F)"
 },
 {
  "code": "BENG 166A",
  "title": "Cell and Tissue Engineering",
  "unit": "4",
  "description": "Engineering analysis of physico-chemical rate processes that affect, limit, and govern the function of cells and tissues. Cell migration, mitosis, apoptosis, and differentiation. Dynamic and structural interactions between mesenchyme and parenchyme. The role of the tissue microenvironment including cell-cell interactions, extracellular matrix, and growth factor communication. The design of functional tissue substitutes including cell and material sourcing, scale-up and manufacturability, efficacy and safety, regulatory, and ethical topics. Clinical applications.",
  "prerequisite": "BENG 103B or BENG 112B; senior standing or consent of department. (F)"
 },
 {
  "code": "BENG 168",
  "title": "Biomolecular Engineering",
  "unit": "4",
  "description": "Basic molecular biology and recombinant DNA technologies. Structure and function of biomolecules that decode genomes and perform energy conversion, enzymatic catalysis, and active transport. Metabolism of macromolecules. Molecular diagnostics. Design, engineering, and manufacture of proteins, genomes, cells, and biomolecular therapies.",
  "prerequisite": "BILD 1 and BENG 100, or consent of department. (W)"
 },
 {
  "code": "BENG 169A",
  "title": "Design Development in Tissue Engineering",
  "unit": "3",
  "description": "Development of design project in tissue engineering.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 169B",
  "title": "Design Implementation in Tissue Engineering",
  "unit": "3",
  "description": "Implementation of design project in tissue engineering.",
  "prerequisite": "BENG 169A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 172",
  "title": "Bioengineering Laboratory",
  "unit": "4",
  "description": "A laboratory course demonstrating basic concepts of biomechanics, bioengineering design, and experimental procedures involving animal tissue. Sources of error and experimental limitations. Computer data acquisition, modeling, statistical analysis. Experiments on artery, muscle and heart mechanics, action potentials, viscoelasticity, electrocardiography, hemorheology. Course materials fees may apply.",
  "prerequisite": "MAE 170; junior or senior standing in the major or consent of instructor. (S)"
 },
 {
  "code": "BENG 179A",
  "title": "Design Development in Bioinstrumentation",
  "unit": "3",
  "description": "Development of design project in bioinstrumentation.",
  "prerequisite": "concurrent enrollment in BENG 187B; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (F)"
 },
 {
  "code": "BENG 179B",
  "title": "Design Implementation in Bioinstrumentation",
  "unit": "3",
  "description": "Implementation of design project in bioinstrumentation.",
  "prerequisite": "BENG 179A; concurrent enrollment in BENG 187C; bioengineering or bioengineering: biotechnology majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 181",
  "title": "Molecular Sequence Analysis",
  "unit": "4",
  "description": "(Cross-listed as BIMM 181 and CSE 181.) This course covers the analysis of nucleic acid and protein sequences, with an emphasis on the application of algorithms to biological problems. Topics include sequence alignments, database searching, comparative genomics, and phylogenetic and clustering analyses. Pairwise alignment, multiple alignment, DNA sequencing, scoring functions, fast database search, comparative genomics, clustering, phylogenetic trees, gene finding/DNA statistics.",
  "prerequisite": "CSE 100; CSE 101; BIMM 100 or CHEM 114C; bioinformatics majors only. (W)"
 },
 {
  "code": "BENG 182",
  "title": "Biological Databases",
  "unit": "4",
  "description": "(Cross-listed as BIMM 182, CSE 182, and CHEM 182.) This course provides an introduction to the features of biological data, how those data are organized efficiently in databases, and how existing data resources can be utilized to solve a variety of biological problems. Object-oriented databases, data modeling, and data description. Survey of current biological database with respect to above; implementation of database focused on a biological topic.",
  "prerequisite": "CSE 100; bioinformatics majors only. (S)"
 },
 {
  "code": "CHEM 182",
  "title": "Biological Databases",
  "unit": "4",
  "description": "(Cross-listed as BIMM 182, CSE 182, and CHEM 182.) This course provides an introduction to the features of biological data, how those data are organized efficiently in databases, and how existing data resources can be utilized to solve a variety of biological problems. Object-oriented databases, data modeling, and data description. Survey of current biological database with respect to above; implementation of database focused on a biological topic.",
  "prerequisite": "CSE 100; bioinformatics majors only. (S)"
 },
 {
  "code": "BENG 183",
  "title": "Applied Genomic Technologies",
  "unit": "4",
  "description": "Principles and technologies for using genomic information for biomedical applications. Technologies will be introduced progressively, from DNA to RNA to protein to whole cell systems. The integration of biology, chemistry, engineering, and computation will be stressed. Topics include technology for the genome, DNA chips, RNA technologies, proteomic technologies, aphysiomic and phenomic technologies, and analysis of cell function.",
  "prerequisite": "BIMM 100 or CHEM 114C, or consent of department. (F)"
 },
 {
  "code": "BENG 184",
  "title": "Computational Molecular Biology",
  "unit": "4",
  "description": "(Cross-listed as BIMM 184, CSE 184, and CHEM 184.) This advanced course covers the application of machine learning and modeling techniques to biological systems. Topics include gene structure, recognition of DNA and protein sequence patterns, classification, and protein structure prediction. Pattern discovery, hidden Markov models/support vector machines/neural network/profiles, protein structure prediction, functional characterization of proteins, functional genomics/proteomics, metabolic pathways/gene networks.",
  "prerequisite": "BENG 181 or BIMM 181 or CSE 181; BENG 182 or BIMM 182 or CSE 182 or CHEM 182; bioinformatics majors only. (S)"
 },
 {
  "code": "BENG 186A",
  "title": "Principles of Biomaterials Design",
  "unit": "4",
  "description": "Fundamentals of materials science as applied to bioengineering design. Natural and synthetic polymeric materials. Materials characterization and design. Wound repair, blood clotting, foreign body response, transplantation biology, biocompatibility of materials, tissue engineering. Artificial organs and medical devices. Government regulations. Patenting. Economic impact. Ethical issues. A term project and oral presentation are required.",
  "prerequisite": "BENG 112B or BENG 123, or consent of department. (S)"
 },
 {
  "code": "BENG 186B",
  "title": "Principles of Bioinstrumentation Design",
  "unit": "4",
  "description": "Biophysical phenomena, transducers, and electronics as related to the design of biomedical instrumentation. Potentiometric and amperometric signals and amplifiers. Biopotentials, membrane potentials, chemical sensors. Electrical safety. Mechanical transducers for displacement, force, and pressure. Temperature sensors. Flow sensors. Light-based instrumentation.",
  "prerequisite": "ECE 35 or MAE 140; ECE 45 or MAE 170; or consent of department. (W)"
 },
 {
  "code": "BENG 187A",
  "title": "Bioengineering Design Project: Planning",
  "unit": "1",
  "description": "General engineering design topics including project planning and design objectives, background research, engineering needs assessment, technical design specifications, engineering standards, and design requirements and constraints. Introduction to biomedical and biotechnology design projects. Career and professional advising. Majors must enroll in the course for a letter grade in order to count the sequence toward the major. No exceptions will be approved.",
  "prerequisite": "BENG 112A or BENG 152 or BENG 168; bioengineering, bioengineering: biotechnology, or bioengineering: biosystems majors only or consent of department. (S)"
 },
 {
  "code": "BENG 187B",
  "title": "Bioengineering Design Project: Development",
  "unit": "1",
  "description": "Development of an original bioengineering design for solution of a problem in biology or medicine. Analysis of economic issues, manufacturing and quality assurance, ethics, safety, design constraints, government regulations, and patent requirements. Oral presentation and formal engineering reports. Career and professional advising.",
  "prerequisite": null
 },
 {
  "code": "BENG 187C",
  "title": "Bioengineering Design Project: Implementation",
  "unit": "1",
  "description": "Approaches to implementation of senior design project, including final report. Teams will report on construction of prototypes, conduct of testing, collection of data, and assessment of reliability and failure. Majors must enroll in the course for a letter grade in order to count the sequence toward the major. No exceptions will be approved.",
  "prerequisite": "BENG 187B; concurrent enrollment in one of the following lab sections: BENG 119B, BENG 126B, BENG 127B, BENG 128B, BENG 129B, BENG 139B, BENG 147B, BENG 148B, BENG 149B, BENG 169B, or BENG 179B; bioengineering, bioengineering: biotechnology, or bioengineering: biosystems majors only or consent of instructor. (W)"
 },
 {
  "code": "BENG 187D",
  "title": "Bioengineering Design Project: Presentation",
  "unit": "1",
  "description": "Oral presentations of design projects, including design, development, and implementation strategies and results of prototype testing. Majors must enroll in the course for a letter grade in order to count the sequence toward the major. No exceptions will be approved.",
  "prerequisite": "BENG 187C; bioengineering, bioengineering: biotechnology, or bioengineering: biosystems majors only or consent of instructor. (S)"
 },
 {
  "code": "BENG 189",
  "title": "Physiological Systems Engineering",
  "unit": "4",
  "description": "Quantitative description of physiological systems, e.g., electrical and mechanical properties of muscle (skeletal and cardiac). Modeling and simulation of properties. Kidney, transport, and models. Neural circuits and models.",
  "prerequisite": "BENG 133, 134, 135, 140A and 140B, or consent of department. (S) Not offered until spring 2017."
 },
 {
  "code": "BENG 191",
  "title": "Senior Seminar I: Professional Issues in Bioengineering",
  "unit": "2",
  "description": "(Conjoined with BENG 291.) Instills skills for personal and organizational development during lifelong learning. Student prepares portfolio of personal attributes and experiences, prepares for career interviews plus oral report of interviewing organizational CEO. Graduate students will prepare a NIH small business research grant.",
  "prerequisite": "consent of instructor. (F)"
 },
 {
  "code": "BENG 193",
  "title": "Clinical Bioengineering",
  "unit": "4",
  "description": "Introduction on the integration of bioengineering and clinical medicine through lectures and rotations with clinical faculty. Students will work with clinical mentors and course faculty to identify areas where engineering can improve diagnostics, clinical practice, and/or treatment.",
  "prerequisite": "BENG 140A or BIPN 100; BENG 140B or BIPN 102; consent of instructor required. A GPA of 3.5 is requested as a requirement per the agreement with the School of Medicine to ensure that students who are participating in the program have a strong academic background to be in the clinic as an undergraduate. (F)"
 },
 {
  "code": "BENG 195",
  "title": "Teaching",
  "unit": "2-4",
  "description": "Teaching and tutorial assistance in a bioengineering course under supervision of instructor. Not more than four units may be used to satisfy graduation requirements. (P/NP grades only.)",
  "prerequisite": "3.0 GPA in the major and department approval. (F,W,S)"
 },
 {
  "code": "BENG 196",
  "title": "Bioengineering Industrial Internship",
  "unit": "1-4",
  "description": "Under the joint supervision of a faculty adviser and industry mentor, the student will work at or be mentored at a bioengineering industrial company to gain practical bioengineering experience, summarized in a technical report. May be taken for credit up to three times. With department approval, four units of credit may substitute for a technical elective. (P/NP grades only.)",
  "prerequisite": "consent of department and completion of all lower-division course requirements, including general-science requirement; laboratory experience. (F,W,S,Su)"
 },
 {
  "code": "BENG 197",
  "title": "Engineering Internship",
  "unit": "1-4",
  "description": "An enrichment program, available to a limited number of undergraduate students, which provides work experience with industry, government offices, hospitals, and their practices. Subject to the availability of positions, students will work in a local industry or hospital (on a salaried or unsalaried basis) under the supervision of a faculty member and industrial, government, or hospital employee. Coordination of the Engineering Internship is conducted through UC San Diego's Academic Internship Program. Time and effort to be arranged. Units may not be applied toward major graduation requirements unless prior approval of a faculty adviser is obtained and internship is an unsalaried position.",
  "prerequisite": "completion of ninety units with a 2.5 GPA and consent of a bioengineering faculty coordinator. (F,W,S,Su)"
 },
 {
  "code": "BENG 198",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study, on a topic or in a field not included in the regular department curriculum, by arrangement with a bioengineering faculty member. (P/NP grades only.)",
  "prerequisite": "upper-division standing, completion of ninety units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 2.5, consent of instructor, and a completed and approved Special Studies form. (F,W,S)"
 },
 {
  "code": "BENG 199",
  "title": "Independent Study for Undergraduates",
  "unit": "4",
  "description": "Independent reading or research by arrangement with a bioengineering faculty member. May be taken for credit three times. (P/NP grades only.)",
  "prerequisite": "upper-division standing, completion of ninety units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 2.5, consent of instructor, and a completed and approved Special Studies form. (F,W,S,Su)"
 },
 {
  "code": "BENG 203",
  "title": "Genomics, Proteomics, and Network Biology",
  "unit": "4",
  "description": "Annotating genomes, characterizing functional genes, profiling, reconstructing pathways.",
  "prerequisite": "Pharm 201, BENG 202/CSE 282, or consent of instructor. (S)"
 },
 {
  "code": "BENG 207",
  "title": "Topics in Bioengineering",
  "unit": "4",
  "description": "Course given at the discretion of the faculty on current topics of interest in bioengineering. (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "BENG 208",
  "title": "Topics in Bioengineering with Lab",
  "unit": "4",
  "description": "Course given at the discretion of the faculty on topics of current interest in engineering science. This course is intended to be a lecture and lab companion topics course.",
  "prerequisite": "consent of instructor. (S)"
 },
 {
  "code": "BENG 211",
  "title": "Systems Biology and Bioengineering I: Biological Components",
  "unit": "4",
  "description": "Components of biological systems, their biochemical properties and function. The technology used for obtaining component lists. Relationship within and integration of component lists. Structured vocabularies and component ontologies. Algorithms for comparative approaches in deciphering and mining component lists.",
  "prerequisite": "BENG 230A or BIMM 100, or consent of instructor. (F)"
 },
 {
  "code": "BENG 212",
  "title": "Systems Biology and Bioengineering II: Large-Scale Data Analysis",
  "unit": "4",
  "description": "Analysis of biological data can be performed at four levels: 1) statistical analysis, 2) integration of knowledge, 3) integration of networks, and 4) integration of biophysical laws. This course teaches the first two levels. The first level consists of specialized topics in statistical analysis of large- scale data sets and machine learning. The second level consists of leveraging prior knowledge for the analysis of diverse, multi-omic datasets and network reconstruction.",
  "prerequisite": "graduate standing. (W)"
 },
 {
  "code": "BENG 221",
  "title": "Mathematical Methods for Bioengineering",
  "unit": "4",
  "description": "Introduction of the foundations of engineering by teaching the mathematical methods that describe the engineering principles. Analytical and numerical approaches to solving the equations.",
  "prerequisite": "graduate standing in bioengineering or consent of instructor. (F)"
 },
 {
  "code": "BENG 225",
  "title": "BioBusiness: Starting, Growing, and Harvesting a Biotech Company",
  "unit": "4",
  "description": "Biotech is a special breed of business, especially in start-up and early phases. Whether you are considering joining a biotech start-up or want to be successful in a life-science organization, it pays to understand this unique business model. In this course, you will study and analyze (1) start-up proposals, (2) the genesis of biotech industry, (3) biotech categories and growth strategies, (4) the process of spinning out viable product concepts from academia, (5) financing techniques, (6) business development, (7) acquisition/IPO valuation methods, and (8) potentially disruptive technologies. The format is highly interactive and learning is enhanced by means of exercises, team presentations, and case studies.",
  "prerequisite": "graduate standing in bioengineering or consent of instructor."
 },
 {
  "code": "BENG 226",
  "title": "Foundations of Bioengineering I: Tissue and Cell Properties",
  "unit": "4",
  "description": "Modern development of biomechanics at an advanced mathematical level. Description of internal stresses and deformation in living tissues and fluids, thermodynamics. Mechanics of soft connective tissue, extracellular matrix, cells, membranes, and cytoskeleton. Mechanotransduction, migration, adhesion. Blood flow in microvessels. Biomechanical analysis of tissue injury. Recommended preparation: a previous background in biomechanics is strongly recommended prior to taking this course.",
  "prerequisite": "graduate standing or consent of instructor. (S)"
 },
 {
  "code": "BENG 227",
  "title": "Transport Phenomena in Living Systems",
  "unit": "4",
  "description": "This course describes the movement of heat and chemical mass in biological systems. Diffusion, convection and biochemical reactions in a variety of biological and engineering examples are analyzed and modeled. Students that have taken BENG 222 cannot take BENG 227 for credit.",
  "prerequisite": "BENG 221, graduate standing, or consent of instructor. (S)"
 },
 {
  "code": "BENG 230A",
  "title": "Biochemistry",
  "unit": "4",
  "description": "A graduate course in biochemistry especially tailored to the requirements and background of bioengineering graduate students. It will cover the important macro- and small molecules in cells that are the major constituents, or that function as signaling molecules or molecular machineries. The structures, pathways, interactions, methodologies, and molecular designs using recombinant DNA technology will be covered.",
  "prerequisite": "restricted to bioengineering graduate students with major code BE75. (F)"
 },
 {
  "code": "BENG 230B",
  "title": "Cell and Molecular Biology",
  "unit": "4",
  "description": "A general survey of structure-function relationships at the molecular and cellular levels. Emphasis on basic genetic mechanisms; control of gene expression; membrane structure, transport and traffic; cell signaling; cell adhesion; mechanics of cell division; and cytoskeleton.",
  "prerequisite": "BENG 230A; restricted to bioengineering graduate students with major code BE75. (W)"
 },
 {
  "code": "BENG 230C",
  "title": "Cardiovascular Physiology",
  "unit": "4",
  "description": "Physical concepts of behavior of heart, large blood vessels, vascular beds in major organs and the microcirculation. Physical and physiological principles of blood flow, blood pressure, cardiac work, electrophysiology of the heart. Special vascular beds, including their biological and hemodynamic importance. Integration through nervous and humoral controls.",
  "prerequisite": "BENG 230B or consent of instructor."
 },
 {
  "code": "BENG 230D",
  "title": "Respiratory and Renal Physiology",
  "unit": "4",
  "description": "Mechanics of breathing. Gas diffusion. Pulmonary blood flow. Stress distribution. Gas transport by blood. Kinetics of oxygen and carbon dioxide exchange. VA/Q relations. Control of ventilation. Glomerular and proximal tubule functions. Water metabolism. Control of sodium and potassium in the kidney.",
  "prerequisite": "BIPN 100, 102, and BENG 230C, or consent of instructor. (F,W,S)"
 },
 {
  "code": "BENG 232",
  "title": "Musculoskeletal Health, Injury, and Disease",
  "unit": "4",
  "description": "An overview of the musculoskeletal system from a bioengineering perspective. Health, injury, disease of bone, cartilage, tendon, ligament, meniscus, synovium, intervertebral disc, skeletal muscle, peripheral nerve. Mechanisms and models underlying current and future therapies.",
  "prerequisite": "graduate standing or consent of instructor. (S)"
 },
 {
  "code": "BENG 233",
  "title": "Neuromuscular Physiology and Biomechanics",
  "unit": "4",
  "description": "Mechanical properties of structures involved in movement (muscles, tendons, bones). Models of neuromuscular adaptation to chronic electrical stimulation, voluntary exercise, surgical overload, spinal cord injury, denervation, limb immobilization, exercise-induced injury and muscle regeneration. Stem cells in muscle function and plasticity.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "BENG 234",
  "title": "Intro to Neurophysiology: Molecules to Systems",
  "unit": "4",
  "description": "Introduction to molecular and cellular neurobiology and their integration with systems neurophysiology. Homeostasis will be an organizing theme. The material will be presented both qualitatively and quantitatively, emphasizing the mathematical, physical, and chemical foundations and dynamics that underlie neurophysiological functions.",
  "prerequisite": "graduate standing or consent of instructor. (S)"
 },
 {
  "code": "BENG 235",
  "title": "Molecular Imaging and Quantitation in Living Cells",
  "unit": "4",
  "description": "This course will introduce quantitative fluorescence microscopy techniques for imaging, manipulating, and quantifying the spatiotemporal characteristics of molecular events in live cells. A laboratory component will be integrated with students organized into small teams for projects. Recommended preparation: basic optics at the level of ECE 181, introductory molecular and cellular biology at the level of BIMM 100 and BICD 110, respectively.",
  "prerequisite": "graduate standing or consent of instructor. (S)"
 },
 {
  "code": "BENG 238",
  "title": "Molecular Biology of the Cardiovascular System",
  "unit": "4",
  "description": "An overview of heart, vascular development and associated diseases from a molecular biological perspective. Current approaches for generating mouse models of cardiovascular disease and recently developed technologies for physiological assessment in small animal models will be presented. (W)",
  "prerequisite": null
 },
 {
  "code": "MED 238",
  "title": "Molecular Biology of the Cardiovascular System",
  "unit": "4",
  "description": "An overview of heart, vascular development and associated diseases from a molecular biological perspective. Current approaches for generating mouse models of cardiovascular disease and recently developed technologies for physiological assessment in small animal models will be presented. (W)",
  "prerequisite": null
 },
 {
  "code": "BENG 241A",
  "title": "Tissue Engineering and Regenerative Medicine: Foundations",
  "unit": "4",
  "description": "Overview and foundations of tissue engineering and regenerative medicine. Tissue structure, function, and dynamics in health and disease. Cells, microenvironment, extracellular matrix, and biomaterials as components of engineered tissues and organs. Functional goals, design, testing, and evaluation of therapies.",
  "prerequisite": "graduate standing. **** (F)"
 },
 {
  "code": "BENG 242",
  "title": "Polymer Science and Engineering",
  "unit": "4",
  "description": "Quantitative basic understanding of different branches of polymer science varying from polymer chemistry, characterization, thermodynamics, rheological properties, smart materials, self-assembly in biopolymers (natural) and synthetic polymers, and applications of polymers ranging from medicine to structure.",
  "prerequisite": "graduate standing in bioengineering, nanoengineering, or materials science, or consent of instructor."
 },
 {
  "code": "BENG 247A",
  "title": "Advanced Biophotonics",
  "unit": "4",
  "description": "Basic physics and chemistry of interaction of photons with matter; photonic radiation pressure; advanced optoelectronic detection systems, devices, methods, time-resolved fluorescent, chemiluminescent methods, fluorescent energy transfer techniques, quantum dots, near-field optical techniques, mechanisms of light sensitive biological systems including chloroplasts for photosynthetic energy conversion and basis of vision processes.",
  "prerequisite": "graduate standing. (F)"
 },
 {
  "code": "BENG 247B",
  "title": "Bioelectronics",
  "unit": "4",
  "description": "Topics include photolithographic techniques for high-density DNA microarray production, incorporation of CMOS control into electronic DNA microarrays, direct electronic detection technology, biofuel cells, highly integrated devices (lab-on-a-chip, in vivo biosensors, etc.). Form heterogeneous materials and components.",
  "prerequisite": "graduate standing. (W)"
 },
 {
  "code": "BENG 247C",
  "title": "Bionanotechnology",
  "unit": "4",
  "description": "Nanosensors, nanodevices for clinical diagnostics, biowarfare agent detection; nanostructures for drug delivery; nanoarrays, nanodevices; nanoanalytical devices and systems, methods for modification or functionalization of nanoparticles; nanostructures with biological molecules; nanostructural aspects of fuel cells, biofuel cells; potential use of DNA, other biomolecules.",
  "prerequisite": "graduate standing. (S)"
 },
 {
  "code": "BENG 254",
  "title": "Synthetic Biology",
  "unit": "4",
  "description": "Introduction to genetic circuits in natural systems, engineering principles in biology, characterization of biological components, numerical methods for systems analysis and design, fabrication of genetic systems in theory and practice, transformation and characterization, and examples of engineered systems.",
  "prerequisite": "graduate bioengineering majors only or consent of instructor. (S)"
 },
 {
  "code": "BENG 260",
  "title": "Neurodynamics",
  "unit": "4",
  "description": "Introduction to the nonlinear dynamics of neurons and neural systems using bifurcation theory and chaotic motions, at different levels of abstraction, e.g., biophysical and “reduced” models for analysis of regularly spiking and bursting cells. Laboratory exercises will accompany the lectures.",
  "prerequisite": "graduate standing or consent of instructor. (F)"
 },
 {
  "code": "BENG 267",
  "title": "Microcirculation in Health and Disease",
  "unit": "4",
  "description": "Structural and functional aspects of transport and blood-tissue exchange in key organs during circulatory shock, bacterial toxemia, hypertension. Physical and ultrastructural techniques used to analyze small-vessel dynamics.",
  "prerequisite": "consent of instructor. (S)"
 },
 {
  "code": "BENG 277",
  "title": "Tissue Engineering Laboratory",
  "unit": "4",
  "description": "Students will learn to conduct tissue engineering and developmental biology experiments, microfabricate cell culture systems, engineer biopolymer materials, and develop and analyze quantitative models of transport, cell fate, and growth mechanics. The understanding and manipulation of multicellular processes that comprise development and growth involves specialized areas of biomechanics, developmental biology, biomaterials, and the tools of molecular biology, as well as the integration of theory and experiment. To fabricate functional tissues, it is important to establish underlying molecular and physical mechanisms and then control and integrate these.",
  "prerequisite": "consent of instructor. (W)"
 },
 {
  "code": "BENG 278",
  "title": "Magnetic Resonance Imaging",
  "unit": "4",
  "description": "This lab course provides hands-on experience with MR physics, data acquisition, image formation, and data analysis, using a human MRI scanner. It will cover basic principles of MRI and key applications, including scanner hardware, spin echoes, gradient echoes, echo-planar imaging, MR angiography, fMRI, and perfusion imaging. This will be accomplished through one hour of formal instruction and four hours of scanner time per week. Each week will cover one topic, and grading will be based on lab reports. The last two weeks are reserved for a final project, which can be student initiated.",
  "prerequisite": "BENG 280A or basic knowledge of linear systems and MRI, or consent of instructor. (W)"
 },
 {
  "code": "RAD 278",
  "title": "Magnetic Resonance Imaging",
  "unit": "4",
  "description": "This lab course provides hands-on experience with MR physics, data acquisition, image formation, and data analysis, using a human MRI scanner. It will cover basic principles of MRI and key applications, including scanner hardware, spin echoes, gradient echoes, echo-planar imaging, MR angiography, fMRI, and perfusion imaging. This will be accomplished through one hour of formal instruction and four hours of scanner time per week. Each week will cover one topic, and grading will be based on lab reports. The last two weeks are reserved for a final project, which can be student initiated.",
  "prerequisite": "BENG 280A or basic knowledge of linear systems and MRI, or consent of instructor. (W)"
 },
 {
  "code": "BENG 280A",
  "title": "Principles of Biomedical Imaging",
  "unit": "4",
  "description": "Fundamentals of Fourier transform and linear systems theory including convolution, sampling, noise, filtering, image reconstruction and visualization with an emphasis on applications to biomedical imaging. Examples from optical imaging, CT, MR, ultrasound, nuclear, PET, and radiography.",
  "prerequisite": "graduate standing. (F)"
 },
 {
  "code": "BENG 280B",
  "title": "Comparative Biomedical Imaging",
  "unit": "4",
  "description": "Application of biomedical imaging to the measurement of structure, function, and dynamics of organ systems from the microscopic to the organ level. Emphasis on detailed evaluation and comparison of specific imaging modalities.",
  "prerequisite": "consent of instructor. (W,S)"
 },
 {
  "code": "BENG 280C",
  "title": "Imaging Cardiovascular Disease",
  "unit": "4",
  "description": "This course will focus on the imaging modalities used to diagnose and guide treatment of cardiovascular disease such as echocardiography, single photon computed tomography (SPECT), X-ray angiography, computed tomography (CT), and magnetic resonance imaging (MRI).",
  "prerequisite": "graduate standing. (S)"
 },
 {
  "code": "BENG 281",
  "title": "Seminar in Bioengineering",
  "unit": "1",
  "description": "Weekly seminars by faculty, visitors, postdoctoral research fellows, and graduate students concerning research topics in bioengineering and related subjects. May be repeated for credit. Course does not apply toward MS graduation requirements. (S/U grades only.) (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "BENG 282",
  "title": "Seminar: Faculty Research",
  "unit": "1",
  "description": "Weekly seminars by bioengineering faculty presenting their research. May be repeated for credit. Course does not apply toward MS or PhD graduation requirements. (S/U grades only.) (F)",
  "prerequisite": null
 },
 {
  "code": "BENG 285",
  "title": "Statistical Learning in Bioinformatics",
  "unit": "4",
  "description": "A hallmark of bioinformatics is the computational analysis of complex data. The combination of statistics and algorithms produces statistical learning methods that automate the analysis of complex data. Such machine learning methods are widely used in systems biology and bioinformatics. This course provides an introduction to statistical learning and assumes familiarity with key statistical methods. Students may not receive credit for BENG 285 and ECE 204 and BNFO 285.",
  "prerequisite": "ECE 271A or ECE 271B or MATH 283; or consent of instructor."
 },
 {
  "code": "BENG 291",
  "title": "Senior Seminar I: Professional Issues in Bioengineering",
  "unit": "2",
  "description": "(Conjoined with BENG 191.) Instills skills for personal and organizational development during lifelong learning. Student prepares portfolio of personal attributes and experiences, prepares for career interviews plus oral report of interviewing organizational CEO. Graduate students will prepare a NIH small business research grant.",
  "prerequisite": "consent of instructor. (F)"
 },
 {
  "code": "BENG 292",
  "title": "Scientific Ethics",
  "unit": "1",
  "description": "Lectures, readings, and discussions about the responsible conduct and reporting of research, working with others in science, and social responsibilities; the course is designed as an option for meeting federal regulations for such training. Students should review the following web page prior to enrollment: <https://ethics.ucsd.edu/courses/ethics/index.html>. (S/U grades only.)",
  "prerequisite": "doctoral students only or consent of department. (F,W,S)"
 },
 {
  "code": "BENG 295",
  "title": "Bioengineering Design Project and Industrial Training",
  "unit": "4",
  "description": "Independent work by graduate students focused on design, applied research, and professional experience.",
  "prerequisite": "consent of instructor and department approval. (F,W,S)"
 },
 {
  "code": "BENG 296",
  "title": "Independent Study",
  "unit": "4",
  "description": "",
  "prerequisite": "consent of instructor. (F,W,S)"
 },
 {
  "code": "BENG 298",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study on a topic or in a field not included in regular department curriculum, by special arrangement with a faculty member. (S/U grades only.)",
  "prerequisite": "consent of instructor. (F,W,S)"
 },
 {
  "code": "BENG 298L",
  "title": "Laboratory Research Rotation",
  "unit": "4",
  "description": "Laboratory research rotation for first-year BENG PhD students. Students will write a final paper. (S/U grades only.)",
  "prerequisite": "PhD student in bioengineering. (F,W,S)"
 },
 {
  "code": "BENG 299",
  "title": "Graduate Research",
  "unit": "1-12",
  "description": "Independent work by graduate students engaged in research and writing theses. (S/U grades only.)",
  "prerequisite": "consent of instructor. (F,W,S)"
 },
 {
  "code": "BENG 500",
  "title": "Apprentice Teaching for Specialization in Multi-Scale Biology",
  "unit": "2, 4",
  "description": "Teaching experience in one of the six bioengineering lab courses designated as a part of the BENG PhD Specialization in Multi-Scale Biology. Student is under the direction of the faculty member in charge of the course. (S/U grades only.)",
  "prerequisite": "consent of instructor and department approval. (F,W,S)"
 },
 {
  "code": "BENG 501",
  "title": "Teaching Experience",
  "unit": "2, 4",
  "description": "Teaching experience in an appropriate bioengineering undergraduate course under direction of the faculty member in charge of the course. Lecturing one to two hours per week in either a problem-solving section or regular lecture. (S/U grades only.)",
  "prerequisite": "consent of instructor and department approval. (F,W,S)"
 }
]