[
 {
  "code": "BNFO 281",
  "title": "Seminar in Bioinformatics and Systems Biology",
  "unit": "1",
  "discription": "Weekly seminars by faculty and visiting bioinformaticists presenting their research. S/U grades only. May be taken for credit nine times.",
  "prerequsite": null
 },
 {
  "code": "BNFO 283",
  "title": "Bioinformatics Student Research Talks",
  "unit": "1",
  "discription": "Weekly presentations by bioinformatics and systems biology students about research projects that are proposed or completed. Faculty mentors are present to contribute critiques and suggestions. S/U grades only. May be taken for credit nine times.",
  "prerequsite": "bioinformatics and systems biology program graduate students only."
 },
 {
  "code": "BNFO 284",
  "title": "Nonlinear Dynamics in Quantitative Biology",
  "unit": "4",
  "discription": "Qualitative, analytical and computational mathematical modeling techniques applied to regulatory networks and signaling networks. Stability, bifurcations, oscillations, multistability, hysteresis, multiple timescales, and chaos. Introduction to experimental data analysis and control techniques. Applications to synthetic biology, cellular population dynamics, ad canonical signaling networks (inflammation, tumor suppression, metabolism). Letter grades only.",
  "prerequsite": "bioinformatics and systems biology graduate students only."
 },
 {
  "code": "BNFO 285",
  "title": "Statistical Learning in Bioinformatics",
  "unit": "4",
  "discription": "A hallmark of bioinformatics is the computational analysis of complex data. The combination of statistics and algorithms produce statistical learning methods that automate the analysis of complex data. Such machine learning methods are widely used in systems biology and bioinformatics. This course provides an introduction to statistical learning and assumes familiarity with key statistical methods. Letter grades only.",
  "prerequsite": "MATH 283."
 },
 {
  "code": "BNFO 286",
  "title": "Network Biology and Biomedicine",
  "unit": "4",
  "discription": "(Cross-listed with MED 283). Networks are pervasive in molecular biology and medicine. This course introduces biomolecular networks and their major analysis techniques and roles in biomedical research, including pathway-based genetic analysis. Recommended familiarity with bioinformatics programming; course examples are taught in Python.",
  "prerequsite": "Genetics (BICD 100, BGGN 223, or BIOM 252) and graduate-level statistics (MED 268, MATH 283, MATH 281A, MATH 281C, FMPH 221, or FMPH 222). Prerequisites may be waived with consent of instructor."
 },
 {
  "code": "BNFO 294",
  "title": "Scientific Ethics",
  "unit": "1",
  "discription": "Lectures, readings, and discussions about the responsible conduct and reporting of research, working with others in science, and social responsibilities; the course is designed as an option for meeting federal regulations for such training. S/U grades only.",
  "prerequsite": "bioinformatics and systems biology graduate students only. Students should review the following web page prior to enrollment: <https://ethics.ucsd.edu/courses/ethics/index.html>."
 },
 {
  "code": "BNFO 298",
  "title": "Research Rotation",
  "unit": "4",
  "discription": "Laboratory research of special topics under the direction of a program faculty member. The purpose is to train students in specific research methodologies and identify a laboratory in which to pursue doctoral dissertation research. Three quarters are required for PhD candidates. May be taken for credit up to six times.",
  "prerequsite": "bioinformatics graduate students and consent of instructor and program."
 },
 {
  "code": "BNFO 299",
  "title": "Graduate Research",
  "unit": "1–12",
  "discription": "Independent work by graduate students engaged in research and writing theses. S/U grades only. May be taken for credit fifteen times.",
  "prerequsite": "bioinformatics and systems biology graduate students and consent of instructor."
 },
 {
  "code": "BNFO 500",
  "title": "Teaching Assistantship",
  "unit": "2–4",
  "discription": "Teaching experience in an appropriate bioinformatics undergraduate or graduate course under direction of the faculty member in charge of the course. Each PhD candidate must complete two academic quarters of experience for S/U grade only. May be taken for credit four times.",
  "prerequsite": "graduate standing and consent of instructor (department stamp). (F,W,S)"
 }
]