[
 {
  "code": "CCS 101",
  "title": "Carbon Neutrality Initiative at University of California",
  "unit": "2",
  "discription": "The University of California-wide goals of the Carbon Neutrality Initiative are introduced through a series of modules where students learn basic principles of carbon neutrality, participate in seminars with campus operations staff, and tour relevant campus infrastructure including the UC San Diego microgrid, Leadership in Energy and Environmental Design (LEED) certified buildings, and sustainable transportation efforts.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "CCS 102",
  "title": "Research Perspectives on Climate Change",
  "unit": "2",
  "discription": "This course introduces students to exciting and current research topics related to climate change as presented by faculty and researchers across UC San Diego. The course is offered as a series of reading topics followed by seminars on original research presented by faculty and researchers.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "CCS 123",
  "title": "Policy and Politics of Climate Change",
  "unit": "4",
  "discription": "Climate change has forced decision makers in the public and private sectors to develop and adopt policies to help facilitate a transition to a clean energy economy and avoid some of the worst consequences of climate change. In this course we will discuss state, federal, and international policies related to climate change. The political context in which these policy responses have developed, and in which they will continue to evolve, will be emphasized throughout.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "CCS 197",
  "title": "Carbon Neutrality Internship",
  "unit": "1–4",
  "discription": "A campus-based internship, typically designed by the student, that will help the university meet our stated carbon neutrality goals. The project can be developed either individually or as part of a team. A written contract involving all parties will include learning objectives, a paper or project outline, and means of supervision and progress evaluation. May be taken for credit up to three times for a maximum of eight units. P/NP grades only.",
  "prerequsite": "CCS 101, CCS 102, and department approval."
 },
 {
  "code": "CCS 199",
  "title": "Supervised Independent Study or Research",
  "unit": "2–4",
  "discription": "Independent reading or research on a topic related to climate change by special arrangement with a faculty member. May be taken for credit up to three times for a maximum of eight units. P/NP grades only.",
  "prerequsite": "CCS 101, CCS 102, and department approval."
 }
]