[
 {
  "code": "CGS 2A",
  "title": "Introduction to Critical Gender Studies: Key Terms and Concepts",
  "unit": "4",
  "description": "This course will be a general introduction to the key terms, issues, and concepts in the fields of gender and sexuality studies.",
  "prerequisite": null
 },
 {
  "code": "CGS 2B",
  "title": "Introduction to Critical Gender Studies: Social Formations",
  "unit": "4",
  "description": "An introduction to the social relations of power that are shaped by and that shape gender and sexuality. It will build more on the basic concepts and skills introduced in CGS 2A.",
  "prerequisite": null
 },
 {
  "code": "CGS 87",
  "title": "Critical Gender Studies First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small, seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "CGS 100A",
  "title": "Conceptualizing Gender: Theoretical Approaches",
  "unit": "4",
  "description": "This course explores the significance of gender as a category of analysis by examining diverse theoretical frameworks from the field of critical gender studies. Particular attention is given to gender in relation to race, class, sexuality, nation, (dis)ability, and religion. Students will not receive credit for both CGS 100 and 100A.",
  "prerequisite": "CGS 2A-B or at least one CGS upper-division course."
 },
 {
  "code": "CGS 100B",
  "title": "Conceptualizing Gender: Methods and Methodologies",
  "unit": "4",
  "description": "Introduction to interdisciplinary research methodologies used in critical gender studies. Students will learn to identify and utilize humanities, social science, and natural science methods for studying gender and sexuality, and to evaluate how knowledge about gender and sexuality is produced.",
  "prerequisite": "CGS 2A-B or at least one CGS upper-division course."
 },
 {
  "code": "CGS 101",
  "title": "Gender and Globalization",
  "unit": "4",
  "description": "This course explores effects of globalization on transnational relations of gender and sexuality. Topics include the division of labor, politics of production and consumption, constructions of gender and sexuality within global grassroots movements, and the migration of people, capital, and culture.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "CGS 105",
  "title": "Queer Theory",
  "unit": "4",
  "description": "Examines the different methodologies and disciplinary histories that together constitute the interdisciplinary project called queer studies. Of particular interest will be how these different methodologies and history construe and construct the relations between gender, race, class, and nation.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "CGS 106",
  "title": "Gender and the Law",
  "unit": "4",
  "description": "Explores the legal treatment of discrimination on the basis of gender, including equal protection doctrine and some statutory law such as Title VII. Topics include the meaning of gender equality in such areas as single-sex education, military service, sexual harassment, discrimination on the basis of pregnancy, and other current issues.",
  "prerequisite": null
 },
 {
  "code": "CGS 108",
  "title": "Gender, Race, and Artificial Intelligence",
  "unit": "4",
  "description": "(Cross-listed with LTCS 108.) This course explores the idea of artificial intelligence in both art and science, its relation to the quest to identify what makes us human, and the role gender and race have played in both. Students may not receive credit for CGS 108 and LTCS 108.",
  "prerequisite": null
 },
 {
  "code": "CGS 111",
  "title": "Gender and the Body",
  "unit": "4",
  "description": "Various approaches to the study of gendered bodies. Possible topics to include masculinities/femininities; lifecycles; biology, culture, and identity; medical discourses; and health issues. May be taken for credit three times when topics vary.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "CGS 112",
  "title": "Sexuality and Nation",
  "unit": "4",
  "description": "(Cross-listed with ETHN 127.) This course explores the nexus of sex, race, ethnicity, gender, and nation and considers their influence on identity, sexuality, migration movement and borders, and other social, cultural, and political issues that these constructs affect.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "CGS 113",
  "title": "Gender and Sexuality in the Arts",
  "unit": "4",
  "description": "Examines gender and sexuality in artistic practices: music, theatre, dance, performance, visual arts, and new media. Topics may include study of specific artists, historical moments, genres, cross-cultural analyses, and multiculturalism. May be taken three times when topics vary.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "CGS 114",
  "title": "Gender, Race, Ethnicity, and Class",
  "unit": "4",
  "description": "(Cross-listed with ETHN 183.) Gender is often neglected in studies of ethnic/racial politics. This course explores the relationship of race, ethnicity, class, and gender by examining the participation of working-class women of color in community politics and how they challenge mainstream political theory.",
  "prerequisite": null
 },
 {
  "code": "CGS 117",
  "title": "Transgenderisms",
  "unit": "4",
  "description": "(Cross-listed with ANSC 117.) This course contrasts mainstream Anglo-American conceptualizations of transgenderism with ethnographic accounts of the experiences and practices of gender expansive people of color (African, Native, Asian/Pacific Islander, and Latinx Americans) in the United States and abroad. It will question the idea of transgenderism as a crossing from one gender to another one, the distinction between gender identity and sexuality, and the analytic of intersectionality. Students will not receive credit for both CGS 117 and ANSC 117.",
  "prerequisite": null
 },
 {
  "code": "CGS 118",
  "title": "Gender and Incarceration",
  "unit": "4",
  "description": "(Cross-listed with ANSC 186.) This course investigates the ways in which forces of racism, gendered violence, and state control intersect in the penal system. The prison-industrial complex is analyzed as a site where certain types of gendered and racialized bodies are incapacitated, neglected, or made to die. Students may not receive credit for CGS 118 and ANSC 186.",
  "prerequisite": null
 },
 {
  "code": "CGS 120",
  "title": "Capitalism and Gender",
  "unit": "4",
  "description": "(Cross-listed with ANSC 180.) Drawing insight from anti-colonial and queer of color critique, this course critically examines the demands capitalism makes on us to perform gender, and how that relates to processes of exploitation and racialization. We will explore alternatives and develop strategies for navigating jobs in this system. Students may receive credit for one of the following: CGS 120, CGS 180, and ANSC 180.",
  "prerequisite": null
 },
 {
  "code": "CGS 121",
  "title": "Selected Topics in Critical Gender Studies",
  "unit": "4",
  "description": "An interdisciplinary course focusing on one of a variety of topics in gender studies, such as gender and science, the body, reproductive technologies, and public policy. May be taken for credit three times when topics vary.",
  "prerequisite": "CGS 2A-B, at least one CGS upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 122",
  "title": "Advanced Topics in Comparative Perspectives",
  "unit": "4",
  "description": "Focuses on the relationship between gender and culture from a multiplicity of perspectives. Possible topics could include gender and ethnicity, gender across class, and other topics to be examined in a cross-cultural framework. May be taken for credit two times when topics vary.",
  "prerequisite": "CGS 2A-B, at least one CGS upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 123",
  "title": "Gender and Reproductive Politics",
  "unit": "4",
  "description": "Legal treatment of gender, reproductive rights, and the family, particularly as evolving law, primarily in the U.S., has created conflicting rights, roles, and responsibilities. Topics include abortion, fetal rights, surrogacy, marriage, and child custody issues. Students will not receive credit for both CGS 107 and 123.",
  "prerequisite": "CGS 2A-B, at least one CGS upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 124",
  "title": "Girls and Sexuality: Moral Panics, Perils, and Pleasures",
  "unit": "4",
  "description": "Explores how girls’ sexualities are shaped by gender, race, class, educational and penal institutions, and sexual norms. Engages with interdisciplinary scholarship that examines how and why the topic of girls and sexuality has become a volatile subject of public debate, and the manner in which girls’ sexualities are represented in various media, particularly film. Students will not receive credit for both CGS 116 and 124.",
  "prerequisite": "CGS 2A-B, at least one CGS upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 125",
  "title": "Women of Color Writers",
  "unit": "4",
  "description": "For women of color, writing has been more than just artistic expression. Women of color have also used the written word to challenge dominant ideas of race, gender, desire, power, violence, and intimacy, and to construct new ways of knowing, writing, and being. This course examines writing by women of color to understand how literary texts can shape and reflect social and political contexts.",
  "prerequisite": "CGS 2A or CGS 2B or at least one CGS upper- division course."
 },
 {
  "code": "CGS 126",
  "title": "Muslims on Gender and Sexuality",
  "unit": "4",
  "description": "This course will critically examine selected feminist, queer, and trans activist and scholarly productions of Muslim women and nonbinary people who are engaging with urgent questions about gender and sexuality in relation to Islam and Muslimness in the Islamicate and diasporas. It will encourage students to explore questions of gender and queerness at the Muslim sacred and seemingly secular sites of the Qur’an, law, borders, immigration, home, labor, desire, fashion, and activism.",
  "prerequisite": "CGS 2A or 2B or at least one CGS upper-division course."
 },
 {
  "code": "CGS 137",
  "title": "Latina Issues and Cultural Production",
  "unit": "4",
  "description": "(Cross-listed with ETHN 137.) This course will focus on the intersection of labor, class, race, ethnicity, gender, sexuality, and immigration in Latina cultural production. Examined from a socio-economic, feminist, and cultural perspective, class readings will allow for historically grounded analyses of these issues. May be taken for credit three times.",
  "prerequisite": "CGS 2A-B, ETHN 1, 2, or 3, at least one CGS or ETHN upper-division course, or permission of the instructor. Students may receive a combined total of twelve units for CGS 137 and ETHN 137."
 },
 {
  "code": "CGS 147",
  "title": "Black Feminisms, Past and Present",
  "unit": "4",
  "description": "(Cross-listed with ETHN 147.) An advanced introduction to historical and contemporary black feminisms in the United States and transnationally. Students will explore the theory and practice of black feminists/womanists and analyze the significance of black feminism to contemporary understandings of race, class, gender, and sexuality. Students may not receive credit for CGS 147 and ETHN 147.",
  "prerequisite": "CGS 2A-B, ETHN 1, 2, 3, at least one CGS or ETHN upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 150",
  "title": "Visuality, Sexuality, and Race",
  "unit": "4",
  "description": "(Cross-listed with ETHN 150.) Examines the role of the visual in power relations; the production of what we see regarding race and sexuality; the interconnected history of the caste system, plantation slavery, visuality and contemporary society; decolonial and queer counternarratives to visuality. Students may not receive credit for CGS 150 and ETHN 150.",
  "prerequisite": "CGS 2A-B, ETHN 1, 2, 3, at least one CGS or ETHN upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 165",
  "title": "Gender and Sexuality in African American Communities",
  "unit": "4",
  "description": "(Cross-listed with ETHN 165.) This course will investigate the changing constructions of sexuality, gender, and sexuality in African American communities defined by historical period, region, and class. Topics will include the sexual division of labor, myths of black sexuality, the rise of black feminism, black masculinity, and queer politics. Students may not receive credit for CGS 165 and ETHN 165.",
  "prerequisite": "CGS 2A-B, ETHN 1, 2, 3, at least one CGS or ETHN upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 187",
  "title": "Latinx Sexualities",
  "unit": "4",
  "description": "(Cross-listed with ETHN 187.) The construction and articulation of Latinx sexualities will be explored in this course through interdisciplinary and comparative perspectives. We will discuss how immigration, class, and norms of ethnicity, race, and gender determine the construction, expression, and reframing of Latinx sexualities. Students will not receive credit for both CGS 115 and 187.",
  "prerequisite": "CGS 2A-B, ETHN 1, 2, 3, at least one CGS or ETHN upper-division course, or permission of the instructor."
 },
 {
  "code": "CGS 190",
  "title": "Honors Seminar",
  "unit": "4",
  "description": "Interdisciplinary readings in feminist theory and research methodology to prepare students for writing an honors thesis. Open to critical gender studies majors who have been admitted to Critical Gender Studies Honors Program. May be applied toward primary concentration in critical gender studies major.",
  "prerequisite": "consent of instructor and department preauthorization required."
 },
 {
  "code": "CGS 196A",
  "title": "Critical Gender Studies Honors Research",
  "unit": "4",
  "description": "A program of independent study providing candidates for critical gender studies honors to develop, in consultation with an adviser, a preliminary proposal for the honors thesis. An IP grade will be awarded at the end of this quarter. A final grade for both quarters will be given upon completion of Critical Gender Studies 196B.",
  "prerequisite": "consent of instructor and department preauthorization required."
 },
 {
  "code": "CGS 196B",
  "title": "Honors Thesis",
  "unit": "4",
  "description": "Honors thesis research and writing for students who have completed Critical Gender Studies 190 and 196A. A letter grade for both Critical Gender Studies 196A and 196B will be given at the completion of this quarter.",
  "prerequisite": "consent of instructor and department preauthorization required."
 },
 {
  "code": "CGS 198",
  "title": "Directed Group Study",
  "unit": "2-4",
  "description": "Directed group study on a topic not generally included in the critical gender studies curriculum.",
  "prerequisite": "consent of instructor and director of Critical Gender Studies Program and department stamp required."
 },
 {
  "code": "CGS 199",
  "title": "Independent Study",
  "unit": "2-4",
  "description": "Tutorial; independent study on a topic not generally included in the curriculum.",
  "prerequisite": "consent of instructor and director of Critical Gender Studies Program and department stamp required."
 },
 {
  "code": "CGS 200",
  "title": "Advanced Studies in Critical Gender Studies",
  "unit": "4",
  "description": "This course, the first in the graduate specialization in Critical Gender Studies, is designed to give students a broad but advanced survey of historical and current research in studies of gender and sexuality in the arts, humanities, and social sciences.",
  "prerequisite": null
 },
 {
  "code": "CGS 208",
  "title": "Gender Variance",
  "unit": "4",
  "description": "(Cross-listed with ANTH 208.) This seminar critically examines gender variance by contrasting local and global contexts. We will interrogate Western analytical frameworks of sex, gender, and sexuality including the idea of transgenderism as a crossing from one gender to an opposite one, the distinction between gender identity and sexuality, and the assumed relationship between sex and gender in relation to other social formations and processes. Students will not receive credit for both CGS 208 and ANTH 208.",
  "prerequisite": null
 },
 {
  "code": "CGS 280",
  "title": "Special Topics in Critical Gender Studies",
  "unit": "4",
  "description": "Specialized study in critical gender studies, with topics to be determined by the instructor any given quarter. Special topics in CGS will be offered at least once per year.",
  "prerequisite": null
 },
 {
  "code": "CGS 299",
  "title": "Advanced Practicum in Critical Gender Studies",
  "unit": "4",
  "description": "This course, the capstone in the graduate specialization in Critical Gender Studies, is designed for students in their final year of dissertation writing. Members of the practicum will present their dissertation research and mutually explore the interdisciplinary dimensions and implications of their work.",
  "prerequisite": null
 },
 {
  "code": "CGS 500",
  "title": "Apprentice Teaching in Critical Gender Studies",
  "unit": "4",
  "description": "Consideration of pedagogical methods appropriate to undergraduate teaching in critical gender studies courses under supervision of instructor of course. Instructor will define apprentice's responsibilities in preparing class presentations, directing student discussions, evaluating and grading students' work, and maintaining productive association with students.",
  "prerequisite": null
 }
]