[
 {
  "code": "CLRE 230",
  "title": "Digital Health",
  "unit": "2",
  "discription": "This course covers how to develop and implement a digital strategy to drive a health research organization's online presence, specifically the processes for selecting, using, managing, and evaluating the effectiveness of web, social media, and mobile technologies.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 231",
  "title": "Implementation Science",
  "unit": "2",
  "discription": "The goal of implementation science is to ensure that the knowledge and materials produced by health research actually leads to improved population health by: 1) reaching the people for whom they are intended; 2) being adapted to local circumstances; and 3) being implemented effectively, safely, equitably, and in a timely and patient-centered manner.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 232",
  "title": "Qualitative Research",
  "unit": "2",
  "discription": "This course provides skills in designing and carrying out a qualitative study useful for program management (planning, monitoring, and evaluation) and ensuring quality in health-care delivery. The methods included in the course are a sample of commonly used qualitative methods: structured and unstructured interviews, participatory learning methods, group and individual methods.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 233",
  "title": "Regulatory Science",
  "unit": "2",
  "discription": "This course provides students with a strong foundation in regulatory science and drug device development and a hands-on introduction to current good manufacturing, laboratory and clinical practices, as well as product development. It offers graduates unique instruction for the specialized jobs in regulatory science in federal, academic, and industry work settings.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 234",
  "title": "Social Media Research",
  "unit": "2",
  "discription": "This course will provide an overview of Institutional Review Board (IRB) considerations of social media in research, including those major ethical challenges and data security issues that may arise with the use of social media for recruitment, consent processes, data collection, and data dissemination.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 235",
  "title": "Team Science",
  "unit": "2",
  "discription": "This course offers practical guidance about how best to engage in interdisciplinary and multidisciplinary team science: to pursue complex science questions, to work effectively with team members, and to produce high impact research outcomes that help meet society's needs.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 236",
  "title": "Translational Research Fundamentals",
  "unit": "2",
  "discription": "Students learn principles and practices of translational medicine applied to discovery and development of drugs, devices, and diagnostics. Topics covered include biomarkers, intellectual property, omics, translational imaging, pharmacogenomics-driven treatment, and discovery and development of diagnostics, stem cell therapies, and drugs.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 237",
  "title": "Translational Regenerative Medicine",
  "unit": "2",
  "discription": "This course covers the basics of regenerative medicine for understanding what stem cell-targeted therapy is and what are the principles for taking a cell- based product from preclinical to first-in-human clinical studies. Topics covered include the regulatory, ethical, and study design considerations for developing stem cell-targeted therapies. Students will grasp the complexities of stem cell-targeted therapies and be able to understand the framework for developing new products. This course provides a good overview for those entering a field that may deliver stem cell therapies, stem cell-targeted treatments, or other cellular based therapies ( _e.g.,_ car-t-cell).",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 238",
  "title": "Applied Translational Research",
  "unit": "2",
  "discription": "Students will gain a comprehensive and integrative operational understanding of an entire life science innovation cycle, from drug idea to market and back, through case studies done by mining publicly disclosed information in teams mentored by biopharmaceutical professionals.",
  "prerequsite": "CLRE 236 and admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 239",
  "title": "Applied Translational Research II",
  "unit": "2",
  "discription": "Building upon the case studies laid out in Applied Translational Research (CLRE 238), this course will analyze in depth specific issues by emulating the biomedical industry modus operandi. Mentored student teams will analyze publically available information, develop a business case, and defend it in front of a jury of biomedical industry research and development (R&D) leaders. In the process, students will learn and apply teamwork and brainstorming techniques and tools.",
  "prerequsite": "CLRE 238 and admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 250",
  "title": "Patient-Oriented Research I",
  "unit": "2",
  "discription": "This course will develop and apply the theory of clinical trials design and analysis, discuss the practical issues of financing and implementing clinical trials, and describe issues of monitoring trials and working in cooperative groups. The scholar will design and present to a group of peers a concept sheet for a phase I/II and phase II/III clinical trial. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": null
 },
 {
  "code": "CLRE 251",
  "title": "Epidemiology I",
  "unit": "2",
  "discription": "Scholars will recognize and understand different types of study designs, the relative strengths and limitations of each, and the proper choice of study design in conducting their own research. They will also be able to identify and calculate the correct measure of risk for each study design. Participants will recognize major sources of bias, confounding and misclassification, and understand design and analysis methods of dealing with each. They will also be familiar with criteria to differentiate association from causation. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": null
 },
 {
  "code": "CLRE 252",
  "title": "Health Services Research",
  "unit": "2",
  "discription": "Scholars will evaluate relevant outcomes in patient-oriented research from the patient (quality of life) and societal (economic) perspectives and locate potential resources for assessing the relevant outcomes in a wide variety of study designs. They will also be able to describe the relative strengths of different health services research approaches to a clinical problem. Finally, they will understand the components of clinical practice guidelines, including patient preferences, and how these guidelines both depend upon as well as inform patient-oriented research. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": null
 },
 {
  "code": "CLRE 253",
  "title": "Biostatistics I",
  "unit": "2",
  "discription": "Scholars will understand principles of measurement of clinical data, recognize data types, and correctly identify statistical methods appropriate for analysis of a given clinical data set. They will gain experience in assembling a clinical dataset in formats suitable for analysis by STATA or other comparable statistical packages. They will learn skills to conduct graphical and numerical exploratory data analysis, comparative tests of categorical, ordinal, and continuous data, linear and logistic regression analysis, and survival analysis by life table and Kaplan-Meier techniques. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": null
 },
 {
  "code": "CLRE 254",
  "title": "Biostatistics II",
  "unit": "2",
  "discription": "Scholars will understand and conduct advanced biostatistical analyses including multiple linear and logistic regression, survival analysis, and Cox and extended Cox regression. The scholar will also be familiar with person- time rate analysis with Poisson regression and longitudinal data analysis in the presence of missing values and varying measurement times. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": "CLRE 253."
 },
 {
  "code": "CLRE 255",
  "title": "Data Management and Informatics",
  "unit": "2",
  "discription": "This course provides an orientation to database design and management and covers key issues regarding data handling for clinical research and clinical trials. Scholars will also become familiar with technology assessment and decision-making methods and analysis. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": null
 },
 {
  "code": "CLRE 256",
  "title": "Patient-Oriented Research II",
  "unit": "2",
  "discription": "This course will review the ethics and basic regulatory issues for research involving human subjects, including access and confidentiality. Scholars will prepare a mock submission to an IRB for peer review and practice and will also review their peers’ proposals. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": "CLRE 250."
 },
 {
  "code": "CLRE 257",
  "title": "Epidemiology II",
  "unit": "2",
  "discription": "Scholars will select the appropriate sampling method and determine the sample size necessary for specific projects and adjust for confounding. Participants will be familiar with several specialized analytic techniques, including matched, cluster, and meta-analyses. They will also be familiar with methodological issues, unique to ecological, behavioral, and genetic studies. Class sessions may also be offered live via distance learning with established remote site.",
  "prerequsite": "CLRE 251."
 },
 {
  "code": "CLRE 258",
  "title": "Professional Development in Clinical Research",
  "unit": "2",
  "discription": "Students participate in a series of seminars on professional development topics that will focus on skills and knowledge to enhance the ability of clinical researchers to be successful. Seminar topics may include research management, team building and collaboration, leadership skills, career development in the clinical research field, negotiation skills, research project management, and research budgeting/financial management.",
  "prerequsite": "MAS program or permission of department."
 },
 {
  "code": "CLRE 259",
  "title": "Scientific Communication Skills",
  "unit": "2",
  "discription": "This course covers the key elements of scientific communication skills that are designed to enhance the clinical research's ability to be successful. Topics include secrets of making good oral presentations and engaging the audience, how to write and prepare abstracts, basics of grant writing and submission, and how grants are reviewed. Course includes mock grant study section.",
  "prerequsite": "MAS program or permission of department."
 },
 {
  "code": "CLRE 260",
  "title": "Directed Studies in Clinical Research",
  "unit": "2",
  "discription": "Faculty member will direct a student's study in selected professional development topics in clinical research. Specific content will be tailored to the student's particular needs and interests. Students must make arrangements with the program and individual faculty member prior to enrolling in the course.",
  "prerequsite": "MAS program or permission of department."
 },
 {
  "code": "CLRE 262",
  "title": "Analyzing Medical Data Using \"R\"",
  "unit": "2",
  "discription": "Course will introduce the R Statistical Platform and help to build proficiency for data analysis. Students will perform their own analysis of the data, using linear regression methods, ANOVA, logistic regression, and regression methods for survival data. They will understand the assumptions, areas of applicability, and limitations of these statistical methods.",
  "prerequsite": "CLRE 253."
 },
 {
  "code": "CLRE 263",
  "title": "Longitudinal Data Analysis",
  "unit": "2",
  "discription": "The class will introduce statistical methods and techniques for analyzing medical data from longitudinal studies using PASW/SPSS software. Students will understand the challenges and statistical issues for designing and analyzing longitudinal studies, recognize and use longitudinal data analysis methods and perform analysis.",
  "prerequsite": "CLRE 253."
 },
 {
  "code": "CLRE 264",
  "title": "Clinical Decision Analysis",
  "unit": "2",
  "discription": "The course provides an introduction to the use of decision sciences in health care. Student will be able to construct and evaluate an appropriate decision analysis probability tree, value health outcomes, use sensitivity analysis and understand how to conduct a cost-effectiveness analysis.",
  "prerequsite": "MAS program or permission of department."
 },
 {
  "code": "CLRE 265",
  "title": "Advanced Regression Methods",
  "unit": "2",
  "discription": "This course will expose and familiarize students with important advanced statistical methods such as methods for numeric outcomes (Linear regression), nonlinear regression, methods for binary outcomes (Logistic regression), methods for counts (Poisson regression) and categorical outcomes (Log-linear models).",
  "prerequsite": "CLRE 253, CLRE 254."
 },
 {
  "code": "CLRE 267",
  "title": "Advanced Statistics Using \"R\"",
  "unit": "2",
  "discription": "This course introduces biostatistical methods used in more advanced clinical research work, including longitudinal data analysis, meta-analysis, predictive modeling (LASSO, random forests, neural networks), competing risks survival analysis. Uses the R statistical package.",
  "prerequsite": "CLRE 253, CLRE 254, CLRE 262."
 },
 {
  "code": "CLRE 268",
  "title": "Behavioral Science Research Methods",
  "unit": "2",
  "discription": "The objective of the course is to provide students instruction in contemporary methods and statistical analyses in behavioral science research. Will teach hands-on practical skills in developing and validating assessment measures, designing clinical trials in behavioral sciences, dissemination and implementation methods, and meta-analysis.",
  "prerequsite": "access to SPSS statistical software, MAS Clinical Research program, or permission of department."
 },
 {
  "code": "CLRE 270",
  "title": "Experiential Learning in Clinical Research",
  "unit": "2",
  "discription": "This experiential course builds on the knowledge gained in the core curriculum through hands-on lab and simulation-based exercises. Students will learn basic lab methods and communication skills pertinent to engaging subjects in clinical research. May be taken for credit four times. While students are required to take the course two times, the course would apply toward general elective requirements when taken a third and fourth time.",
  "prerequsite": "CLRE 250, CLRE 251, and admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 295A",
  "title": "Independent Study Project (ISP) Seminar Series A",
  "unit": "2",
  "discription": "Students conduct a systemic review of the literature leading to the background and hypothesis/specific aim of their ISP, culminating in a written paper and class presentation for faculty and peer feedback. Mentorship and career development topics will be discussed by a series of guest speakers.",
  "prerequsite": "admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 295B",
  "title": "Independent Study Project (ISP) Seminar Series B",
  "unit": "2",
  "discription": "Students present a research-in-progress talk related to their ongoing ISP work. They will submit an institutional review board (IRB) proposal/report including a master's protocol that would be submitted to the IRB. This will consist of the data management plans including case report forms, data analysis plans, sample size calculations, and budget. Mentorship and career development topics will be discussed by guest speakers from academia and industry.",
  "prerequsite": "CLRE 295A and admission to the MAS Clinical Research Program or consent of department."
 },
 {
  "code": "CLRE 297",
  "title": "Independent Study Project",
  "unit": "2",
  "discription": "Students conduct a high-level clinical research project that integrates what they have learned in their formal course work. The ISP will include their course work in CLRE 295A-B and be presented as a final report that includes a complete description of the project including the study manual, study results, statistical analysis, and a discussion of the findings. Students will make an oral presentation of their ISP to their three-member ISP committee comprised of faculty and industry advisers. The ISP is an independent, creative, and scholarly activity, and students will be graded on their written and oral presentations.",
  "prerequsite": "CLRE 295A and admission to the MAS Clinical Research Program or consent of instructor."
 },
 {
  "code": "CLRE 298",
  "title": "Independent Study Project",
  "unit": "4",
  "discription": "The ISP is the cornerstone of the MAS program. Students will be involved in a high-level clinical research project that integrates what they have learned in their formal course work. The ISP will be an independent and creative scholarly activity in an area related to one or more of the topics covered in the formal curriculum. Students’ work will be evaluated by a committee of faculty and may also include industry advisors when appropriate.",
  "prerequsite": "admission to the MAS in Clinical Research Program or consent of department."
 }
]