[
 {
  "code": "COGS 1",
  "title": "Introduction to Cognitive Science",
  "unit": "4",
  "description": "A team-taught course highlighting development of the field and the broad range of topics covered in the major. Example topics include addiction, analogy, animal cognition, human-computer interaction, language, neuroimaging, neural networks, reasoning, robots, and real-world applications.",
  "prerequisite": null
 },
 {
  "code": "COGS 2",
  "title": "Cognitive Neuroeconomics",
  "unit": "4",
  "description": "This course is an introduction to the neuroscience behind the principles of economic decision-making. The topics in this course are aimed at exploring the underlying cognitive and neural mechanisms that drive the decisions behind traditional economic models.",
  "prerequisite": null
 },
 {
  "code": "COGS 3",
  "title": "Introduction to Computing",
  "unit": "4",
  "description": "Covers the fundamental concepts that underlie all programming languages and provides an introduction to the essential information about algorithms and data structures. Students design and implement web applications using HTML5, CSS3, JavaScript, and Photoshop. No previous programming experience is required.",
  "prerequisite": null
 },
 {
  "code": "COGS 8",
  "title": "Hands-on Computing",
  "unit": "4",
  "description": "Introductory-level course that will give students insight into the fundamental concepts of algorithmic thinking and design. The course will provide the students with first-person, hands-on experience programming a web crawler and simple physical robots.",
  "prerequisite": null
 },
 {
  "code": "COGS 9",
  "title": "Introduction to Data Science",
  "unit": "4",
  "description": "Concepts of data and its role in science will be introduced, as well as the ideas behind data-mining, text-mining, machine learning, and graph theory, and how scientists and companies are leveraging those methods to uncover new insights into human cognition.",
  "prerequisite": null
 },
 {
  "code": "COGS 10",
  "title": "Cognitive Consequences of Technology",
  "unit": "4",
  "description": "This course examines the interrelationships of cognition and technology from the perspective of cognitive science. We address questions of importance for our increasingly technological society: How does technology shape our minds? How should what we know about our minds shape technology?",
  "prerequisite": null
 },
 {
  "code": "COGS 11",
  "title": "Minds and Brains",
  "unit": "4",
  "description": "How damaged and normal brains influence the way humans solve problems, remember or forget, pay attention to things; how they affect our emotions, and the way we use language in daily life.",
  "prerequisite": null
 },
 {
  "code": "COGS 12",
  "title": "Language, Culture, and Cognition",
  "unit": "4",
  "description": "Do people who speak different languages think differently? Does learning new languages change the way you think? Are some thoughts unthinkable without language? Course will bring together ideas and findings from psychology, linguistics, anthropology, neuroscience, and philosophy.",
  "prerequisite": null
 },
 {
  "code": "COGS 13",
  "title": "Field Methods: Studying Cognition in the Wild",
  "unit": "4",
  "description": "This course introduces students to multiple methods to investigate cognition and behavior in natural settings. Students will learn about ethnography, videography (video data collection, coding, and analysis), surveys design and conducting interviews, and how to move from observations to modeling.",
  "prerequisite": null
 },
 {
  "code": "COGS 14A",
  "title": "Introduction to Research Methods",
  "unit": "4",
  "description": "Introduction to the scientific method. Methods of knowledge acquisition, research questions, hypotheses, operational definitions, variables, control. Observation, levels of measurement, reliability, validity. Experimentation and design: between-groups, within-subjects, quasi-experimental, factorial, single-subject. Correlational and observational studies. Ethics in research.",
  "prerequisite": null
 },
 {
  "code": "COGS 14B",
  "title": "Introduction to Statistical Analysis",
  "unit": "4",
  "description": "Introduction to descriptive and inferential statistics. Tables, graphs, measures of central tendency and variability. Distributions, Z-scores, correlation, regression. Probability, sampling, logic of inferential statistics, hypothesis testing, decision theory. T-test, one and two-way Anova, nonparametric tests (Chi-square).",
  "prerequisite": "COGS 14A."
 },
 {
  "code": "COGS 15",
  "title": "What the *#!?: An Uncensored Introduction to Language",
  "unit": "4",
  "description": "This course uses the study of swearing to introduce topics in language: how children learn it, why it changes over time, and how people pronounce and understand it. Students who believe they could be offended by the study of swearing and other taboo language might not find this course appropriate for them.",
  "prerequisite": null
 },
 {
  "code": "COGS 17",
  "title": "Neurobiology of Cognition",
  "unit": "4",
  "description": "Introduction to the organization and functions of the nervous system. Topics include molecular, cellular, developmental, systems, and behavioral neurobiology. Specifically, structure and function of neurons, peripheral and central nervous systems, sensory, motor, and control systems, learning and memory mechanisms. (Students may not receive credit for both BILD12 and COGS 17. This course fulfills general-education requirements for Marshall and Roosevelt Colleges as well as Warren by petition.)",
  "prerequisite": null
 },
 {
  "code": "COGS 18",
  "title": "Introduction to Python",
  "unit": "4",
  "description": "This class will teach fundamental Python programming skills and practices, including the \"Zen of Python.\" Students will focus on scientific computing and learn to write functions and tests, as well as how to debug code using the Jupyter Notebook programming environment. Students with limited computing experience may take COGS 3 for preparation.",
  "prerequisite": null
 },
 {
  "code": "COGS 20",
  "title": "Exploring the Musical Mind",
  "unit": "4",
  "description": "(Cross-listed with MUS 20.) How do we transform complex sounds into comprehensible and meaningful music? What physiological, neurological, cognitive, and cultural systems are involved? Why do we make music in such diverse ways around the globe? Does music have evolutionary or ecological significance? What is the relationship between music, motion, and emotions? This course explores contemporary understandings of how we hear and how we become musical and invites students to listen to new music in new ways. Students may not receive credit for both COGS 20 and MUS 20.",
  "prerequisite": null
 },
 {
  "code": "COGS 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year Student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "COGS 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "description": "Special topics in cognitive science are discussed. P/NP grades only. (May be repeated when topics vary.)",
  "prerequisite": null
 },
 {
  "code": "COGS 91",
  "title": "SCANS Presents",
  "unit": "1",
  "description": "The department faculty and the Students for Cognitive and Neurosciences (SCANS) offer this seminar exploring issues in cognitive science. It includes informal faculty research presentations, investigations of topics not covered in the curriculum, and discussions on graduate school and careers. (May be repeated when topics vary.)",
  "prerequisite": null
 },
 {
  "code": "COGS 92",
  "title": "Resiliency in the Face of Adversity",
  "unit": "2",
  "description": "Psychological resiliency will be addressed both scientifically and pragmatically. Students will explore the way cognitive and behavioral factors contribute to one’s ability to cope with the stresses of life and emerge from them stronger than before. P/NP only.",
  "prerequisite": null
 },
 {
  "code": "COGS 99",
  "title": "Independent Study",
  "unit": "2 or 4",
  "description": "Independent literature or laboratory research by arrangement with and under direction of a Department of Cognitive Science faculty member.",
  "prerequisite": "lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Special Studies form."
 },
 {
  "code": "COGS 100",
  "title": "Cyborgs Now and in the Future",
  "unit": "4",
  "description": "Covers the theories of situated, distributed, enactive, and embodied cognition. Explains how cyborgs are a natural consequence of our current understanding of embodied minds embedded in culturally shaped niches; how mental systems can be distributed over other people and things.",
  "prerequisite": "COGS 1 or COGS 10."
 },
 {
  "code": "COGS 101A",
  "title": "Sensation and Perception",
  "unit": "4",
  "description": "An introduction to the experimental study of cognition with a focus on sensation and perception.",
  "prerequisite": "COGS 1."
 },
 {
  "code": "COGS 101B",
  "title": "Learning, Memory, and Attention",
  "unit": "4",
  "description": "A survey of the experimental study of learning, memory, and attention. Topics include conditioning, automaticity, divided attention, memory systems, and the nature of mental representation.",
  "prerequisite": "COGS 1. Recommended: COGS 101A."
 },
 {
  "code": "COGS 101C",
  "title": "Language",
  "unit": "4",
  "description": "An introduction to structure of natural language, and to the cognitive processes that underline its acquisition, comprehension, and production. This course covers findings from linguistics, computer science, psychology, and cognitive neuroscience to provide an integrated perspective on human language abilities.",
  "prerequisite": "COGS 1 and 14A."
 },
 {
  "code": "COGS 102A",
  "title": "Cognitive Perspectives",
  "unit": "4",
  "description": "Explores current theoretical frameworks of high-level human cognition that emphasize how we interact with the material, social, and cultural world. Themes include the philosophy and history of cognitive science, the role of artifacts, and how cognition extends beyond the individual.",
  "prerequisite": "COGS 1 and COGS 10."
 },
 {
  "code": "COGS 102B",
  "title": "Cognitive Ethnography",
  "unit": "4",
  "description": "Examines memory, reasoning, language, culture, planning, and interaction directly in everyday, real-world settings. Focuses on ethnographic methods, their history, and their application. The course work includes projects in which students make observations of real-world activity and analyze their cognitive significance.",
  "prerequisite": "COGS 102A."
 },
 {
  "code": "COGS 102C",
  "title": "Cognitive Design Studio",
  "unit": "6",
  "description": "This project-based course focuses on learning and applying the process of human-centered cognitive design. Students work in teams to design and evaluate a prototype application or redesign an existing system. Emphasizes contextual inquiry, user research, ideation, iterative design, and evaluation.",
  "prerequisite": "COGS 102B."
 },
 {
  "code": "COGS 107A",
  "title": "Neuroanatomy and Physiology",
  "unit": "4",
  "description": "This first course in the sequence focuses on principles of brain organization, from neurons to circuits to functional networks. It explores developmental plasticity, neuronal connectivity, cellular communication, complex signaling, and how these various dimensions form functional brain systems.",
  "prerequisite": "COGS 1 or COGS 17."
 },
 {
  "code": "COGS 107B",
  "title": "Systems Neuroscience",
  "unit": "4",
  "description": "This course focuses on the electrical dynamics of neurons and how their patterns relate to perception, thought, and action. Neural activity patterns underlying vision, touch, audition, proprioception, and head orientation are examined in detail. Also examined are motor control, sleep/wake state production, action planning, learning, memory, attention, spatial cognition and function of the cerebellum, basal ganglia, and hippocampus.",
  "prerequisite": "COGS 107A."
 },
 {
  "code": "COGS 107C",
  "title": "Cognitive Neuroscience",
  "unit": "4",
  "description": "This course reviews research investigating the neural bases for human mental processes, including processing of affective, social, linguistic, and visuospatial information, as well as memory, attention, and executive functions. Also discussed are brain development and brain aging, and the nature of intelligence and creativity.",
  "prerequisite": "COGS 107B and its prerequisites."
 },
 {
  "code": "COGS 108",
  "title": "Data Science in Practice",
  "unit": "4",
  "description": "Data science is multidisciplinary, covering computer science, statistics, cognitive science and psychology, data visualization, artificial intelligence and machine learning, among others. This course teaches critical skills needed to pursue a data science career using hands-on programming and experimental challenges.",
  "prerequisite": "CSE 11 or CSE 8A or COGS 18 or DSC 10 or MAE 8."
 },
 {
  "code": "COGS 109",
  "title": "Modeling and Data Analysis",
  "unit": "4",
  "description": "Exposure to the basic computational methods useful throughout cognitive science. Computing basic statistics, modeling learning individuals, evolving populations, communicating agents, and corpus-based linguistics will be considered.",
  "prerequisite": "COGS 14B, MATH 18 or MATH 31AH, and COGS 18 or CSE 7 or CSE 8A or CSE 11."
 },
 {
  "code": "COGS 110",
  "title": "The Developing Mind",
  "unit": "4",
  "description": "(Cross-listed with HDS 121.) This course examines changes in thinking and perceiving the physical and social world from birth through childhood. Evidence of significant changes in encoding information, forming mental representations, and solving problems is culled from psychological research, cross-cultural studies, and cognitive science. Cross-listed course. HDS 121 has been renumbered from HDP 121. Students may receive credit for one of the following: COGS 110, HDS 121, or HDP 121.",
  "prerequisite": "COGS 1 or HDP 1 or HDS 1."
 },
 {
  "code": "COGS 111",
  "title": "Beauty and the Brain",
  "unit": "4",
  "description": "What is beauty? The subjective experience of aesthetic appreciation dominates culture. But what determines this illusive quality? Why is it so important, how did it evolve, and how is it represented in the brain?",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 112",
  "title": "Humor",
  "unit": "4",
  "description": "In this course we will explore the psychology, philosophy, and evolutionary origins of humor and laughter.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 115",
  "title": "Neurological Development and Cognitive Change",
  "unit": "4",
  "description": "This course provides an overview of neurological development and explores the relations between physiological change and the experience for the child from the prenatal period through adolescence.",
  "prerequisite": "BILD 10 or BILD 12 or COGS 107A or COGS 107B or COGS 17 or HDP 110."
 },
 {
  "code": "COGS 118A",
  "title": "Supervised Machine Learning Algorithms",
  "unit": "4",
  "description": "This course introduces the mathematical formulations and algorithmic implementations of the core supervised machine learning methods. Topics in 118A include regression, nearest neighborhood, decision tree, support vector machine, and ensemble classifiers. COGS 118A-B may be taken in either order.",
  "prerequisite": "COGS 18 or CSE 8B or CSE 11 and MATH 18 or MATH 31AH and MATH 20E and MATH 180A and COGS 108 or COGS 109 or COGS 118B or CSE 150 or CSE 151 or CSE 158 or ECE 174 or ECE 175A or consent of instructor."
 },
 {
  "code": "COGS 118B",
  "title": "Introduction to Machine Learning II",
  "unit": "4",
  "description": "This course, with COGS 118A, forms a rigorous introduction to machine learning. Topics in 118B include maximum likelihood estimation, Bayesian parameter estimation, clustering, principal component analysis, and some application areas. COGS 118A-B may be taken in either order.",
  "prerequisite": "CSE 8B or CSE 11 and MATH 18 or MATH 31AH and MATH 20E and MATH 180A or consent of instructor."
 },
 {
  "code": "COGS 118C",
  "title": "Neural Signal Processing",
  "unit": "4",
  "description": "This course will cover theoretical foundations and practical applications of signal processing to neural data. Topics include EEG/field potential methods (filtering, Fourier (spectral) analysis, coherence) and spike train analysis (reverse correlation, spike sorting, multielectrode recordings). Some applications to neural imaging (optical microscopy, fMRI) data will also be discussed.",
  "prerequisite": "MATH 18 or MATH 31AH, COGS 14B or PSYC 60, and COGS 108 or COGS 109."
 },
 {
  "code": "COGS 118D",
  "title": "Mathematical Statistics for Behavioral Data Analysis",
  "unit": "4",
  "description": "Statistical methods for analyzing behavioral data. A mathematically sophisticated course covering both classical and Bayesian statistical methods for estimation, hypothesis testing, regression, and model comparison. Emphasis on both mathematical understanding of statistical methods as well as common applications.",
  "prerequisite": "MATH 18 or MATH 31AH and MATH 180A and COGS 108 or COGS 109, or consent of instructor."
 },
 {
  "code": "COGS 119",
  "title": "Programming for Experimental Research",
  "unit": "4",
  "description": "This course will help students in the behavioral sciences (cognitive science, psychology, linguistics, neuroscience, and related fields) learn how to program experiments and analyze and present data.",
  "prerequisite": "COGS 14B and MATH 18 or MATH 31AH and MAE 8."
 },
 {
  "code": "COGS 120",
  "title": "Interaction Design",
  "unit": "5",
  "description": "(Cross-listed with CSE 170.) Introduces fundamental methods and principles for designing, implementing, and evaluating user interfaces. Topics: user-centered design, rapid prototyping, experimentation, direct manipulation, cognitive principles, visual design, social software, software tools. Learn by doing: work with a team on a quarter-long design project. Recommended preparation: basic familiarity with HTML. Students may not receive credit for both COGS 120 and CSE 170.",
  "prerequisite": "CSE 11 or CSE 8B or DSC 30 and COGS 1 or COGS 187A or DSGN 1."
 },
 {
  "code": "COGS 121",
  "title": "Human Computer Interaction Portfolio Design Studio",
  "unit": "4",
  "description": "Create a personal portfolio of web/mobile/product design projects, oral presentations, and practice pitches to stakeholders.",
  "prerequisite": "COGS 120 or CSE 170 and COGS 18 or CSE 8B or CSE 11 or DSC 30."
 },
 {
  "code": "COGS 122",
  "title": "Start-up Studio",
  "unit": "4",
  "description": "Explores tools and processes for innovating novel business concepts to solve problems involving the interaction between humans and technology. Students will work with an interdisciplinary team to understand unmet user needs and to create a value proposition that balances technical feasibility, financial viability, and desirability.",
  "prerequisite": "DSGN 100 or COGS 187B or COGS 187A or COGS 120 or CSE 170."
 },
 {
  "code": "COGS 123",
  "title": "Social Computing",
  "unit": "4",
  "description": "This course explores the intersection of social behavior and computational systems. Students will examine a range of organizational, technical, and business challenges related to social computing, and learn how to use tools to analyze, design, and build online communities.",
  "prerequisite": "COGS 102C or COGS 120 or COGS 187A or COGS 187B or DSGN 1."
 },
 {
  "code": "COGS 124",
  "title": "HCI Technical Systems Research",
  "unit": "4",
  "description": "In this advanced project-based course, we study the state-of-the-art in research on technical systems for human-computer interaction (HCI). Students will deconstruct the systems described in top-tier HCI papers and work in teams to create novel technical systems of their own.",
  "prerequisite": "COGS 120 and COGS 121."
 },
 {
  "code": "COGS 125",
  "title": "Advanced Interaction Design",
  "unit": "4",
  "description": "This is a studio class for students who are passionate about diving deep into interaction design and honing their design skills. Introduces social computing, input and interaction techniques, and information design. Students will regularly present work in a studio format.",
  "prerequisite": "CSE 11 or 8B and COGS 120 or CSE 170."
 },
 {
  "code": "COGS 126",
  "title": "Human-Computer Interaction",
  "unit": "4",
  "description": "This course surveys the field of human-computer interaction and the ideas and technologies that have shaped its development.",
  "prerequisite": "COGS 120 or COGS 121 or CSE 170."
 },
 {
  "code": "COGS 127",
  "title": "Data-Driven UX/Product Design",
  "unit": "4",
  "description": "Create a UX/product design case study for your portfolio; team project with user research, data science, prototyping, and user testing.",
  "prerequisite": "COGS 18 or CSE 11 or CSE 8B or DSC 30 and COGS 1 or COGS 187A or DSGN 1."
 },
 {
  "code": "COGS 128",
  "title": "Information Visualization",
  "unit": "4",
  "description": "This course frames information visualization as a quintessential cognitive science problem within our interdisciplinary field. Students learn conceptual and practical aspects of creating high-quality, interactive information displays to support a variety of cognitive tasks and then apply them to real- world data.",
  "prerequisite": "COGS 10 or DSGN 1 and COGS 108."
 },
 {
  "code": "COGS 138",
  "title": "Neural Data Science",
  "unit": "4",
  "description": "Project-based course in which students will use computational notebooks to perform exploratory data analyses and to test hypotheses in large neuroscience datasets, including the differences between unique neuron types, leveraging text mining of the neuroscience literature, and human neuroimaging analyses.",
  "prerequisite": "COGS 18 and COGS 118C."
 },
 {
  "code": "COGS 143",
  "title": "Animal Cognition",
  "unit": "4",
  "description": "Examines the contrasts and parallels between primates and cetaceans in sensorimotor constraints, neuroanatomy, field behavior, and cognition in the lab, with a focus on the demands of competition and cooperation that helped shape the evolution of social cognition. Students may not receive credit for COGS 143 and COGS 143GS.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 144",
  "title": "Social Cognition: A Developmental and Evolutionary Perspective",
  "unit": "4",
  "description": "This course presents the building blocks of social cognition from a developmental and evolutionary perspective and focuses on how and when children develop these abilities and how humans compare to other species such as great apes, birds, and dogs.",
  "prerequisite": "COGS 14A-B."
 },
 {
  "code": "COGS 151",
  "title": "Analogy and Conceptual Systems",
  "unit": "4",
  "description": "Human thought and meaning are deeply tied to the capacity for mapping conceptual domains onto each other, inducing common schemas and performing mental simulation. This course examines major aspects of this cognitive activity including metaphor, conceptual blending, and embodied cognition.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 152",
  "title": "Cognitive Foundations of Mathematics",
  "unit": "4",
  "description": "How the human mind/brain creates mathematics: embodiment, innovation, and creativity. The emergence and power of abstract concepts, such as infinity, infinitesimals, imaginary numbers, or zero. Cognitive approaches that connect mathematics to human thought in general.",
  "prerequisite": "COGS 1 or PHIL 1 or PSYC 1 or EDS (20 or 30 or 31); upper-division standing."
 },
 {
  "code": "COGS 153",
  "title": "Language Comprehension",
  "unit": "4",
  "description": "The processes and representations involved in understanding language—processing words, syntax, semantics, and discourse—are examined in light of evidence from both psychological experiments and computer simulations.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 154",
  "title": "Communication Disorders in Children and Adults",
  "unit": "4",
  "description": "Neural bases of language use in normal adults, and neural bases of language and communication development in normal children. Evidence on the language and communication deficits in adults (especially aphasia and dementia) and children (specific language impairment, focal brain injury, retardation, and autism).",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 155",
  "title": "Gesture and Cognition",
  "unit": "4",
  "description": "Spontaneous gestures and their relationship to speech, cognition, brain, and culture. The course covers, among others, gesture and language development, gesture and conceptual systems, speech-gesture coproduction and its brain bases, evolution of language, and gestural behavior in special populations.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 156",
  "title": "Language Development",
  "unit": "4",
  "description": "A comprehensive survey of theory, method and research findings on language development in children ranging from the earliest stages of speech perception and communication at birth to refinements in narrative discourse and conventional fluency through middle childhood and adolescence.",
  "prerequisite": "upper-division standing and background in development psychology and/or linguistics is recommended."
 },
 {
  "code": "COGS 157",
  "title": "Music and the Mind",
  "unit": "4",
  "description": "Explores how humans (and other species) process music, including pitch, meter, emotion, motor aspects, links to language, brain activity. Students should have experience reading musical notation.",
  "prerequisite": "COGS 101A or COGS 101B or COGS 101C."
 },
 {
  "code": "COGS 160",
  "title": "Upper-Division Seminar on Special Topics",
  "unit": "4",
  "description": "Special topics in cognitive science are discussed. (May be repeated when topics vary.)",
  "prerequisite": "department approval."
 },
 {
  "code": "COGS 163",
  "title": "Metabolic Disorders of the Brain",
  "unit": "4",
  "description": "Research is showing that cellular metabolic processes are mediating normal and abnormal brain function. For example, neurocognitive disorders often co-occur with metabolic disturbances, such as insulin resistance, diabetes, and obesity. An understanding of these mechanisms will provide insight to new treatments for cognitive and neurological disorders. The course will cover topics on the role of abnormal cellular structure, genetic, epigenetic and pathogenic influences on synaptic signaling.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 164",
  "title": "Neurobiology of Motivation",
  "unit": "4",
  "description": "This course will address principles of motivation, valuation, and reward, spanning a large territory of topics, from rules of synaptic learning to classroom learning. Recommended preparation: courses in basic biology, physiology, COGS 107A or 107B or 107C, or courses in education.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 165",
  "title": "Neuroimaging of Cognition",
  "unit": "4",
  "description": "Introduction to functional magnetic resonance imaging (fMRI) methods for cognitive neuroscience research. This course will cover basic aspects of the physics and biological principles underlying MRI and fMRI, technical aspects of experimental design and data collection for fMRI, as well as basic data processing and analysis approaches.",
  "prerequisite": "COGS 107B or COGS 107C or PSYC 106 or PSYC 108."
 },
 {
  "code": "COGS 169",
  "title": "Genetic Information for Behavior: From Single Cells to Mammals",
  "unit": "4",
  "description": "Behavior draws on a wide range of genes acting as a complex source of information. Model organisms—bacteria, Paramecium, C. elegans, Drosophila, and mice—have provided insight into how genes influence both innate and learned behaviors.",
  "prerequisite": "COGS 1 and 107A or permission of instructor."
 },
 {
  "code": "COGS 170",
  "title": "Brain Waves Across Scales",
  "unit": "4",
  "description": "This course will provide an interactive and hands-on introduction to rhythms and large-scale electrical potentials of the brain. Topics will include the resonance properties of neurons, rhythmic interactions between neurons, the coordination of activity across large populations of neurons that is measurable in the local field potential (LFP) and electroencephalogram (EEG), the advantages of temporally coordinated neural activity, and relevant insights about the brain and cognitive disorders. ",
  "prerequisite": "COGS 17 or BILD 12."
 },
 {
  "code": "COGS 171",
  "title": "Mirror Neuron System",
  "unit": "4",
  "description": "This class will examine the neuroanatomy, physiology, and functional correlates of the human mirror neuron system and its putative role in social cognition, e.g., action understanding, empathy, and theory of mind. We will examine the developmental, neuroimaging, electrophysiological, as well as clinical evidence, for and against this hypothesis.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "COGS 172",
  "title": "Brain Disorders and Cognition",
  "unit": "4",
  "description": "A review of the patterns of impaired and intact cognitive abilities present in brain-damaged patients in terms of damage to one or more components of a model of normal cognitive functioning.",
  "prerequisite": "COGS 107A."
 },
 {
  "code": "COGS 174",
  "title": "Drugs: Brain, Mind, and Culture",
  "unit": "4",
  "description": "This course explores how drugs interact with the brain/mind and culture. It covers evolutionary and historical perspectives, brain chemistry, pharmacology, expectancies and placebo effects, and models of addiction. It also provides a biopsychosocial survey of commonly used and abused substances.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "COGS 176",
  "title": "From Sleep to Attention",
  "unit": "4",
  "description": "This course will combine an examination of the neural character of quiet and active sleep states and their potential functions with an examination of the different mechanisms by which the brain mediates attention to specific features of the world.",
  "prerequisite": "COGS 107A."
 },
 {
  "code": "COGS 177",
  "title": "Space and Time in the Brain",
  "unit": "4",
  "description": "The course examines features of neural dynamics that map spatial and temporal relationships. Lectures will cover interval timing, mapping of item-to- observer position, mapping of observer-to-world position, and the conjunction of spatial and temporal coding in hippocampus.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "COGS 178",
  "title": "Genes, Brains, and Behavior",
  "unit": "4",
  "description": "Evidence for genetic mediation of behavioral and neural differences, mechanisms that may mediate these effects, and the roles of the environment and experience are discussed.",
  "prerequisite": "COGS 107A-B or consent of instructor."
 },
 {
  "code": "COGS 179",
  "title": "Electrophysiology of Cognition",
  "unit": "4",
  "description": "Survey the theory and practice of using electrical recordings (event-related brain potentials) to study cognition and behavior including attention, language, mental chronometry, memory, and plasticity.",
  "prerequisite": "COGS 107A or COGS 17."
 },
 {
  "code": "COGS 180",
  "title": "Decision Making in the Brain",
  "unit": "4",
  "description": "This course covers recent advances in the understanding of neural mechanisms and computational principles underlying the brain’s ability to make decisions. The role of various factors, as well as their neural encoding, will be considered, e.g., observation noise, reward, risk, internal uncertainty, emotional state, external incentives.",
  "prerequisite": "BILD 12 or COGS 17 and COGS 108 or COGS 109 or CSE 150A and MATH 18 or MATH 20B or MATH 31AH."
 },
 {
  "code": "COGS 181",
  "title": "Neural Networks and Deep Learning",
  "unit": "4",
  "description": "This course will cover the basics about neural networks, as well as recent developments in deep learning including deep belief nets, convolutional neural networks, recurrent neural networks, long-short term memory, and reinforcement learning. We will study details of the deep learning architectures with a focus on learning end-to-end models for these tasks, particularly image classification.",
  "prerequisite": "COGS 18 or CSE 11 or CSE 8B and MATH 18 or MATH 31AH and MATH 20E and MATH 180A and COGS 118A or COGS 118B or CSE 150 or CSE 151A or CSE 158 or ECE 174 or ECE 175A."
 },
 {
  "code": "COGS 184",
  "title": "Modeling the Evolution of Cognition",
  "unit": "4",
  "description": "This interdisciplinary course integrates data on evolutionary theory, hominid prehistory, primate behavior, comparative neuroanatomy, cognitive development, and collaboration. After lectures, readings, and discussion of the literature, students generate a detailed timeline of five million years of human cognitive evolution. Students may not receive credit for COGS 184 and COGS 184GS.",
  "prerequisite": "COGS 17 or COGS 107A or COGS 107B or COGS 107C or BILD 12."
 },
 {
  "code": "COGS 185",
  "title": "Advanced Machine Learning Methods",
  "unit": "4",
  "description": "This course is an advanced seminar and project course that follows the introduction to machine learning courses. Advanced and new machine learning methods will be discussed and used.",
  "prerequisite": "COGS 118A or COGS 188 or CSE 151A."
 },
 {
  "code": "COGS 187A",
  "title": "Usability and Information Architecture",
  "unit": "4",
  "description": "Examines the cognitive basis of successful web and multimedia design. Topics: information architecture, navigation, usability, graphic layout, transaction design, and how to understand user interaction.",
  "prerequisite": "COGS 18 or CSE 11 or CSE 8A and COGS 10 or DSGN 1."
 },
 {
  "code": "COGS 187B",
  "title": "Practicum in Professional Web Design",
  "unit": "4",
  "description": "This course follows up on the basics of multimedia design taught in COGS 187A. Students will probe more deeply into selective topics, such as animation, navigation, graphical display of information, and narrative coherence.",
  "prerequisite": "COGS 187A or consent of instructor."
 },
 {
  "code": "COGS 188",
  "title": "Artificial Intelligence Algorithms",
  "unit": "4",
  "description": "This class will cover a broad spectrum of machine learning algorithms. It builds on students' previous exposure to machine learning. It covers new artificial intelligence algorithms ranging from topic models as used in the text data analysis to genetic algorithms.",
  "prerequisite": "COGS 109 or COGS 118A or COGS 118B."
 },
 {
  "code": "COGS 189",
  "title": "Brain Computer Interfaces",
  "unit": "4",
  "description": "This course will discuss signal processing, pattern recognition algorithms, and human-computer interaction issues in EEG-based brain-computer interfaces. Other types of brain-computer interfaces will also be discussed.",
  "prerequisite": "COGS 108 or COGS 109 or COGS 118A or COGS 118B."
 },
 {
  "code": "COGS 190A",
  "title": "Pre-Honors Project in Cognitive Science",
  "unit": "4",
  "description": "This course prepares students for the Cognitive Science Honors Program. The aim is to refine the research project and to teach students what a successfully written proposal entails. Students may be admitted to the Honors Program contingent upon completion and progress in the course. See “[Cognitive Science Honors Program](../curric/COGS-ug.html#honors)” section for more information. Course should be taken for a letter grade.",
  "prerequisite": "upper-division standing; instructor and department approval."
 },
 {
  "code": "COGS 190B",
  "title": "Honors Studies in Cognitive Science",
  "unit": "4",
  "description": "This course will allow cognitive science honors students to explore advanced issues in the field of cognitive science research. It will also provide the opportunity to develop a thesis on the topic of their choice and begin work under faculty supervision. See “[Cognitive Science Honors Program](../curric/COGS-ug.html#honors)” section for more information.",
  "prerequisite": "COGS 190A and formal admittance to the Cognitive Science Honors Program; department stamp."
 },
 {
  "code": "COGS 190C",
  "title": "Honors Thesis in Cognitive Science",
  "unit": "4",
  "description": "This course will provide honors candidates an opportunity to complete the research on and preparation of an honors thesis under close faculty supervision. Oral presentation of student's thesis is required to receive honors; additionally, student must receive grade of A- or better in 190B and 190C to receive honors. See “[Cognitive Science Honors Program](../curric/COGS-ug.html#honors)” section for more information.",
  "prerequisite": "COGS 190B with grade of A- or better and formal admittance to the Cognitive Science Honors Program."
 },
 {
  "code": "COGS 190D",
  "title": "Preparation for Thesis Presentation",
  "unit": "1",
  "description": "This course is affiliated with the honors program (190A-B-C) and is required of honors students during spring quarter. Its aim is to prepare students to present research results to an audience. Emphasis will be on the oral presentation (organization, wording, graphics), but there will also be some discussion about written research reports. Seminar style format with occasional short lectures wherein students will practice oral presentations and provide constructive criticism to each other.",
  "prerequisite": "must be concurrently enrolled in 190B or 190C."
 },
 {
  "code": "COGS 195",
  "title": "Instructional Apprenticeship in Cognitive Science",
  "unit": "4",
  "description": "Students, under the direction of the instructor, lead laboratory or discussion sections, attend lectures, and meet regularly with the instructor to help prepare course materials and grade papers and exams. Applications must be submitted to and approved by the department. P/NP grades only. May be taken for credit three times.",
  "prerequisite": "upper-division standing; 3.0 GPA; instructor and department approval."
 },
 {
  "code": "COGS 197",
  "title": "Cognitive Science Internship",
  "unit": "2 or 4",
  "description": "The student will undertake a program of practical research in a supervised work environment. Topics to be researched may vary, but in each case the course will provide skills for carrying out these studies. P/NP grades only. May be taken for credit up to three times.",
  "prerequisite": "upper-division standing; 2.5 GPA; department approval."
 },
 {
  "code": "COGS 198",
  "title": "Directed Group Study",
  "unit": "2 or 4",
  "description": "This independent study course is for small groups of advanced students who wish to complete a one-quarter reading or research project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit three times.",
  "prerequisite": "upper-division standing; 2.5 GPA; consent of instructor and department approval."
 },
 {
  "code": "COGS 199",
  "title": "Special Project",
  "unit": "2 or 4",
  "description": "This independent study course is for individual, advanced students who wish to complete a one-quarter reading or research project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit three times.",
  "prerequisite": "upper-division standing; 2.5 GPA; consent of instructor and department approval."
 },
 {
  "code": "COGS 200",
  "title": "Cognitive Science Seminar",
  "unit": "4",
  "description": "This seminar emphasizes the conceptual basis of cognitive science, including representation, processing mechanisms, language, and the role of interaction among individuals, culture, and the environment. Current developments in each field are considered as they relate to issues in cognitive science. (May be repeated for credit.)",
  "prerequisite": null
 },
 {
  "code": "COGS 201",
  "title": "Neural Dynamics of Cognition",
  "unit": "4",
  "description": "Examination of the neurophysiological and neuroanatomical basis for perception, cognition, and learning. Lectures will focus on the dynamics of neural activity in cortical and subcortical structures as they relate to sensory processing, motor control, attention, arousal state, and memory.",
  "prerequisite": null
 },
 {
  "code": "COGS 205",
  "title": "Introduction to Thesis Research",
  "unit": "4",
  "description": "This course is taken to focus the students' development of a thesis topic and research proposal. Students prepare an outline of thesis proposal and make an oral public presentation of the proposed topic prior to the end of the third year. S/U only.",
  "prerequisite": null
 },
 {
  "code": "COGS 210A-B-C",
  "title": "Introduction to Research",
  "unit": "4-4-4",
  "description": "This sequence is an intensive research project. Students under faculty mentorship perform a thorough analysis of the problem and the literature, carry out original studies, and prepare oral and written presentations. Students should aim for a report of publishable quality. Letter grade required.",
  "prerequisite": null
 },
 {
  "code": "COGS 211A-B-C",
  "title": "Research Methods in Cognitive Science",
  "unit": "2-2-2",
  "description": "Issues in design, implementation, and evaluation of research in cognitive science are discussed. Students will present and comment on their own research projects in progress. Discussions also include presentations of research to various audiences, abstracts, reviews, grant process, and scientific ethics. Letter grade required.",
  "prerequisite": null
 },
 {
  "code": "COGS 219",
  "title": "Programming for Behavioral Sciences",
  "unit": "4",
  "description": "An applied hands-on programming course that focuses on the design, implementation, and analysis of experiments. Topics include experiment design, stimulus presentation, response collection, file manipulation, data analysis, display, and presentation. Course work includes both team and individual projects. Graduate students who have not programmed at all should speak with the professor beforehand.",
  "prerequisite": null
 },
 {
  "code": "COGS 220",
  "title": "Information Visualization",
  "unit": "4",
  "description": "This seminar surveys current research in information visualization with the goal of preparing students to do original research. The focus is on the cognitive aspects of information design, dynamic representations, and computational techniques. Topics vary each time course is offered.",
  "prerequisite": null
 },
 {
  "code": "COGS 225",
  "title": "Image Recognition",
  "unit": "4",
  "description": "This course is designed to open the doors for students who are interested in learning about the basic tools and technologies for image classification and recognition. We will focus on traditional computer vision techniques as well as graphics processing unit (GPU) powered deep learning techniques that are critical to modern image data analysis such as large-scale image recognition, object detection, and video analysis.",
  "prerequisite": null
 },
 {
  "code": "COGS 229",
  "title": "Design at Large",
  "unit": "1",
  "description": "(Cross-listed with CSE 219.) New societal challenges, cultural values, and technological opportunities are changing design, and vice versa. The seminar explores this increased scale, real-world engagement, and disruptive impact. Invited speakers from UC San Diego and beyond share cutting-edge research on interaction, design, and learning. S/U grades only. May be taken for credit up to eighteen times.",
  "prerequisite": null
 },
 {
  "code": "COGS 230",
  "title": "Topics in Human-Computer Interaction",
  "unit": "4",
  "description": "(Cross-listed with CSE 216.) Prepares students to conduct original HCI research by reading and discussing seminal and cutting-edge research papers. Topics include design, social software, input techniques, mobile, and ubiquitous computing. Student pairs perform a quarter-long mini research project that leverages campus research efforts. Letter grades only.",
  "prerequisite": null
 },
 {
  "code": "COGS 231",
  "title": "Design Seminar on Human-Centered Programming Tools",
  "unit": "4",
  "description": "Graduate-level seminar studying the design of programming tools from a human- centered perspective, relying primarily on the latest research literature combined with classical theory in cognitive science and human-computer interaction. Course work involves critical reading, discussion, and programming projects. Letter grades only. Recommended preparation: COGS 120 or CSE 170.",
  "prerequisite": null
 },
 {
  "code": "COGS 234",
  "title": "Distributed Cognition",
  "unit": "4",
  "description": "This course focuses on aspects of individual and socially distributed cognition. Empirical examples are drawn from natural and experimental settings that presuppose, tacitly or explicitly, socially distributed knowledge among participants. The class examines the way locally managed, pragmatic conditions influence how decisions are framed.",
  "prerequisite": null
 },
 {
  "code": "COGS 238",
  "title": "Topics in Cognitive Linguistics",
  "unit": "1-4",
  "description": "(Cross-listed with LIGN 238.) Basic concepts, empirical findings, and recent developments in cognitive and functional linguistics. Language viewed dynamically in relation to conceptualization, discourse, meaning construction, and cognitive processing. (As topics vary, may be repeated for credit.)",
  "prerequisite": null
 },
 {
  "code": "COGS 241",
  "title": "Ethics and Survival Skills in Academia",
  "unit": "2",
  "description": "(Cross-listed with NEU 241.) Lectures, readings, and discussions about the responsible conduct and reporting of research, working with others in science, social responsibilities, and various career advancement skills; the course is designed as an option for meeting current federal regulations. S/U grades only.",
  "prerequisite": null
 },
 {
  "code": "COGS 243",
  "title": "Statistical Inference and Data Analysis",
  "unit": "2 or 4",
  "description": "This course provides a rigorous treatment of hypothesis testing, statistical inference, model fitting, and exploratory data analysis techniques used in the cognitive and neural sciences. Students will acquire an understanding of mathematical foundations and hands-on experience in applying these methods using Matlab. Cognitive science PhD students must enroll for four units and will be required to do assignments and a final project. All other students can enroll for two units and will be required to complete all assignments but not a final project (or by request a project and no assignments).",
  "prerequisite": null
 },
 {
  "code": "COGS 252",
  "title": "Cognitive Science of Mathematics",
  "unit": "4",
  "description": "Empirical investigation of the nature of mathematics. How the human mind/brain creates abstract concepts, such as infinity, infinitesimals, imaginary numbers, or zero: embodiment, creativity, and history. Cognitive approaches that connect mathematics to human thought in general.",
  "prerequisite": null
 },
 {
  "code": "COGS 260",
  "title": "Seminar on Special Topics",
  "unit": "1-4",
  "description": "Specific topics in cognitive science are discussed. (May be repeated when topics vary.)",
  "prerequisite": null
 },
 {
  "code": "COGS 277",
  "title": "Mirroring in Social Cognition",
  "unit": "4",
  "description": "The discovery of mirror neurons in the monkey brain raised the possibility that \"mirroring\" constitutes instances of mental simulation. In this seminar, we will examine the neural basis of social cognition and specifically the relationship between mirroring processes and cognition.",
  "prerequisite": null
 },
 {
  "code": "COGS 278",
  "title": "Genetics and Individuality",
  "unit": "4",
  "description": "Evidence for the heritability and for the association of genetic variants with behavioral and neural phenotypes will be reviewed. Integrative models of gene- environment interaction will be discussed. Guest faculty will describe their own work in this area.",
  "prerequisite": null
 },
 {
  "code": "COGS 279",
  "title": "Electrophysiology of Cognition",
  "unit": "4",
  "description": "(Cross-listed with NEU 279) This course surveys the theory and practice of using recordings of electrical and magnetic activity of the brain to study cognition and behavior. It explores what brain waves reveal about normal and abnormal perception, processing, decision making, memory, preparation, and comprehension. Graduate students will be required to do additional readings for the material each week (different for each grad) and to present orally (as well as in a written page) a critical analysis of the readings.",
  "prerequisite": "COGS 107A or PSYC 106; COGS 101A or PSYC 105."
 },
 {
  "code": "COGS 280",
  "title": "Neural Oscillations",
  "unit": "4",
  "description": "Brain rhythms play a critical role in perception and cognition. What are they? Where do they come from? This course will examine the origin and function of neural oscillations and the role they play in neural computation, representation, and cognition.",
  "prerequisite": "department approval. Python/Matlab experience required prior to enrollment."
 },
 {
  "code": "COGS 281",
  "title": "Advanced Neural Signal Processing",
  "unit": "4",
  "description": "Mathematical foundations and applications of neural signal processing techniques used in electrophysiology and neuroimaging (including microscopy), covering spectral analysis, correlation, high-dimensional data, and spike- train analysis.",
  "prerequisite": null
 },
 {
  "code": "COGS 283",
  "title": "Big Visual Data Processing",
  "unit": "4",
  "description": "This course is designed for students interested in learning about basic tools and technologies for dealing with big image data in the sense of collecting, crawling, processing, and classifying images, focusing on matching, hashing, deep learning, and online learning.",
  "prerequisite": null
 },
 {
  "code": "COGS 290",
  "title": "Cognitive Science Laboratory Rotation",
  "unit": "2",
  "description": "Laboratory rotations provide students with experience in the various experimental methods used in cognitive science.",
  "prerequisite": "consent of instructor. S/U only."
 },
 {
  "code": "COGS 291",
  "title": "Laboratory Research",
  "unit": "1-4",
  "description": "Students engage in discussions of reading of recent research in an area designated and directed by the instructor and also participate in the design and execution of original research. Students are expected to demonstrate oral and written competence in presenting original research.",
  "prerequisite": "consent of the instructor and department approval. (May be repeated for credit.)"
 },
 {
  "code": "COGS 298",
  "title": "Directed Independent Study",
  "unit": "1-12",
  "description": "Students study and research selected topics under the direction of a member of the faculty.",
  "prerequisite": null
 },
 {
  "code": "COGS 299",
  "title": "Thesis Research",
  "unit": "1-12",
  "description": "Students are provided directed research on their dissertation topic by faculty advisers.",
  "prerequisite": null
 },
 {
  "code": "COGS 500",
  "title": "Teaching Apprenticeship",
  "unit": "1-4",
  "description": "This practicum for graduate students provides experience in teaching undergraduate cognitive science courses. S/U only.",
  "prerequisite": null
 }
]