[
 {
  "code": "COMM 10",
  "title": "Introduction to Communication",
  "unit": "4",
  "description": "Introduction to the history, theory, and practice of communication, including language and literacy, representation and semiotics, mediated technologies and institutional formations, and social interaction. Integrates the study of communication with a range of media production (for example, writing, electronic media, film, performance). COMM 10 may be taken concurrently with the COMM A-B-C courses and intermediate electives. Course is offered fall, winter, and summer quarters.",
  "prerequisite": null
 },
 {
  "code": "COMM 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "COMM 100A",
  "title": "Communication, the Person, and Everyday Life",
  "unit": "4",
  "description": "A critical introduction to processes of interaction and engagement in lived and built environments. Includes historical survey of theories/methods, including actor network theory, conversation analysis, ethnography, ethnomethodology, cultural linguistics, performance, and social cognition; and integrates scholarly study with production-oriented engagement. Students will not receive credit for COHI 100 and COMM 100A.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 100B",
  "title": "Communication, Culture, and Representation",
  "unit": "4",
  "description": "A critical introduction to the practice and the effects of representation within historically situated cultural contexts. Surveys a range of theories/methods in interpretations and identity to understand the effects of these practices upon the form and content of various representational genres and integrates scholarly study with production-oriented engagement. Students will not receive credit for COCU 100 and COMM 100B.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 100C",
  "title": "Communication, Institutions, and Power",
  "unit": "4",
  "description": "A critical introduction to structures of communication formed across the intersections of the state, economy, and civil society. Includes historical survey of communication industries, legal and policy-based arenas, civic and political organizations, and other social institutions; and integrates scholarly study with production-oriented engagement. Students will not receive credit for COSF 100 and COMM 100C.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 190",
  "title": "Junior Seminar in Communication",
  "unit": "4",
  "description": "The junior seminar entails a detailed examination of a specific topic from the field of communication, exploring in greater depth theories and methods introduced in the core communication curriculum. Seminars are limited to thirty students, with a heavy focus on class participation. Students complete a research project with a significant final product (typically a research paper). Students will not receive credit for both COGN 150 and COMM 190.",
  "prerequisite": "junior or senior standing and COMM 10 and at least one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 101",
  "title": "Introduction to Audiovisual Media Practices",
  "unit": "4",
  "description": "This upper-level undergraduate course is required as the gateway to all future media production courses. Students will learn about historical and theoretical contemporary media practices such as film, video, internet, and social media production and how these practices are informed by technical and social constraints. In lab, students will work hands-on with video and new media equipment to apply what they have learned through genre and practical technique.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 101A",
  "title": "Media Activism",
  "unit": "4",
  "description": "In this course, we ask what techniques, strategies, and platforms we might engage to present these stories to a broader audience in an impactful and ethical way. While we engage with a specific web-based platform each quarter, the class maintains an emphasis on documentary storytelling and audiovisual production. The aim of this class is to demystify the idea of a \"media activist\" by guiding students through the development of their own media activism.",
  "prerequisite": "COMM 10 and COMM 101."
 },
 {
  "code": "COMM 101D",
  "title": "MPL: Nonlinear/Digital Editing",
  "unit": "4",
  "description": "This course will prepare students to edit on nonlinear editing facilities and introduce aesthetic theories of editing: time code editing, timeline editing on the Media 100, digital storage and digitization of audio and video, compression, resolution, and draft mode editing. By the end of the course students will be able to demonstrate mastery of the digital editing facilities. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101."
 },
 {
  "code": "COMM 101E",
  "title": "MPL: Ethnographic Methods for Media Production",
  "unit": "4",
  "description": "This is a practical course on ethnographic fieldwork—obtaining informed consent, interviewing, negotiating, formulating a research topic, finding relevant literature, writing a research paper, and assisting others with their research. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101."
 },
 {
  "code": "COMM 101K",
  "title": "MPL: Documentary Sketchbook",
  "unit": "4",
  "description": "Digital video is the medium used in this class both as a production technology and as a device to explore the theory and practice of documentary production. Technical demonstrations, lectures, production exercises, and readings will emphasize the interrelation between production values and ethics, problems of representation, and documentary history. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101."
 },
 {
  "code": "COMM 101M",
  "title": "MPL: Communication and Computers",
  "unit": "4",
  "description": "This course introduces students to computers as media of communication. Each quarter, students participate in a variety of networking activities designed to show the interactive potential of the medium. Fieldwork designed to teach basic methods is combined with readings designed to build a deeper theoretical understanding of computer-based communication.",
  "prerequisite": "COMM 10.  "
 },
 {
  "code": "COMM 101N",
  "title": "MPL: Sound Production and Manipulation",
  "unit": "4",
  "description": "Advanced seminar in sound production, design, and editing. Students create projects by recording original sounds and editing on a Pro-Tools system. We consider the potential of sound in film, radio, TV, and on the web by reviewing work and reading sound theory.",
  "prerequisite": "COMM 10 and COMM 101."
 },
 {
  "code": "COMM 101T",
  "title": "MPL: Topics in Production",
  "unit": "4",
  "description": "Specialized study in production with topics to be determined by the instructor for any given quarter. Students will use studio, editing rooms, cameras to construct a variety of in or outside studio productions that can include YouTube, Documentary shorts, Vimeo, with topics that show the effects on social issues. May be taken for credit three times.",
  "prerequisite": "COMM 101 or COGN 22 or VIS 70N prerequisites can be taken concurrently by permission."
 },
 {
  "code": "COMM 102C",
  "title": "MMPP: Practicum in New Media and Community Life",
  "unit": "6",
  "description": "A combined lecture/lab in a specially designed after-school setting in southeastern San Diego working with children and adults. Students design new media and produce special projects, and explore issues related to human development, social justice, and community life. May be taken for credit three times.",
  "prerequisite": "none"
 },
 {
  "code": "COMM 102D",
  "title": "MMPP: Practicum in Child Development",
  "unit": "6",
  "description": "A combined lecture/lab course on after-school learning, social change, and community-based research. Students are expected to participate in a supervised after-school setting at one of four community labs in San Diego County. Students will learn ethnographic field methods, develop culturally relevant curriculum, and work in diverse settings. May be taken for credit three times.",
  "prerequisite": "none.  "
 },
 {
  "code": "COMM 102M",
  "title": "MMPP: Studio Television",
  "unit": "6",
  "description": "This course offers students the opportunity to produce and engage in critical discussions around various television production formats. We will study and produce a variety of projects, including public service announcements, panel programs, scripted drama, and performance productions. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101 or COGN 22 or VIS 70N."
 },
 {
  "code": "COMM 102P",
  "title": "MMPP: Television Analysis and Production",
  "unit": "6",
  "description": "An introduction to the techniques and conventions common in television production with equal emphasis on method and content. Studio sessions provide students with opportunities to experiment in framing subject matter through a variety of cinematographic methods. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101 or COGN 22 or VIS 70N."
 },
 {
  "code": "COMM 102T",
  "title": "MMPP: Television Documentary",
  "unit": "6",
  "description": "An advanced television course that examines the history, form, and function of the television documentary in American society. Experimentation with documentary techniques and styles requires prior knowledge of television or film production. Laboratory sessions apply theory and methods in the documentary genre via technological process. Integrates research, studio, and field experience of various media components. May be taken for credit three times.",
  "prerequisite": "COMM 10 and COMM 101 or COGN 22 or VIS 70N."
 },
 {
  "code": "COMM 103D",
  "title": "CM: Documentary History and Theory",
  "unit": "4",
  "description": "History of nonfiction film and video. Through film and written texts, we survey the nonfiction film genre, considering technological innovations, ethical issues, and formal movements related to these representations of the \"real.\"",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 103E",
  "title": "CM: History of Electronic Media",
  "unit": "4",
  "description": "This course considers the social, cultural, economic, and technological contexts that have shaped electronic media, from the emergence of radio and television to their convergence through the internet, and how these pervasive forms of audiovisual culture have impacted American society.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 103F",
  "title": "CM: How to Read a Film",
  "unit": "4",
  "description": "This course increases our awareness of the ways we interpret or make understanding from movies to enrich and increase the means by which one can enjoy and comprehend movies. We will talk about movies and explore a range of methods and approaches to film interpretation. Readings will emphasize major and diverse theorists, including Bazin, Eisenstein, Cavell, and Mulvey.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 104D",
  "title": "CMS: Asia",
  "unit": "4",
  "description": "The development of media systems in Asia, focusing on India and China. Debates over nationalism, regionalism, globalization, new technologies, identity politics, censorship, privatization, and media piracy. Alignments and differences with North American and European media systems will also be considered.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 104E",
  "title": "CMS: Europe",
  "unit": "4",
  "description": "The development of media systems and policies in Europe. Differences between European and American journalism. Debates over the commercialization of television. The role of media in postcommunist societies in Eastern Europe.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 104F",
  "title": "CMS: Africa",
  "unit": "4",
  "description": "This course will critically examine the role of the mass media in sub-Saharan Africa in the areas of colonial rule, nationalist struggles, authoritarianism, and popular movements. It will examine general trends regionally and internationally, as well as individual national cases, from the early twentieth century to the internet news services of the information age.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 104G",
  "title": "CMS: Latin America and the Caribbean",
  "unit": "4",
  "description": "The development of media systems and policies in Latin America and the Caribbean. Debates over dependency and cultural imperialism. The news media and the process of democratization. Development of the regional television industry.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 105G",
  "title": "CT: Computer Games Studies",
  "unit": "4",
  "description": "Course considers computer games both as media and as sites of communication. Games are studied through hands-on play and texts from a variety of disciplinary perspectives. Course encompasses commercial, academic, and independent games.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 105M",
  "title": "CT: Mobile Communication",
  "unit": "4",
  "description": "Movement is central to our lives. This course draws on the latest research into how we travel, trade, and move. Diverse topics will be covered, including kids in cars, the New York subway, and theories of mobility.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 105P",
  "title": "CT: Photographic Technologies",
  "unit": "4",
  "description": "This course examines photographic technologies as a set of instruments and practices that modern societies have developed and used to tell stories about themselves and make particular claims about truth and reality, focusing on the domains of science, policing, journalism, advertising, and self-expression.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106A",
  "title": "CI: Introduction",
  "unit": "4",
  "description": "Course examines the organization of some of the many industries (e.g., film, music, gaming, and publishing) that make up the cultural landscape with an eye toward discerning the conditions that shape the production of cultural goods and services: how is production organized within cultural industries; how are products distributed; and what is the impact of both the organization and distribution of goods on the conditions of work and labor?",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106C",
  "title": "CI: History Through Comics—Japan",
  "unit": "4",
  "description": "Pasts have been conveyed through various media for millennia. This course will use comics to explore how this medium impacts how we might learn and understand Japanese history. Topics discussed include memory, storytelling, perspective, and visuality.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106F",
  "title": "CI: Film Industry",
  "unit": "4",
  "description": "A study of the social organization of the film industry throughout its history. Who makes films, by what criteria, and for what audience? The changing relationships between studios, producers, directors, writers, actors, editors, censors, distributors, audience, and subject matter of the films will be explored.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106G",
  "title": "CI: Tourism: Global Industry and Cultural Form",
  "unit": "4",
  "description": "The largest industry in the world has far-reaching cultural ramifications. We will explore tourism's history and its contemporary cultural effects, taking the perspective of the \"toured\" as well as that of the tourist.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106I",
  "title": "CI: Internet Industry",
  "unit": "4",
  "description": "The political economy of the emergent internet industry, charted through analysis of its hardware, software, and services components. The course specifies leading trends and changing institutional outcomes by relating the internet industry to the adjoining media, telecommunications, and computer industries.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106T",
  "title": "CI: Television Culture and the Public",
  "unit": "4",
  "description": "How and what does television communicate? Emphasis will be on contemporary US television programming, placed in comparative and historical context. Special topics may include TV genres, TV and politics, TV and other media. Frequent in-class screenings.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 106V",
  "title": "CI: TV Industry",
  "unit": "4",
  "description": "Course examines political economy of television throughout its history. How TV is made, who is involved, how is industry organized, how does it get regulated, distributed? Consider how these answers changed over time and look at recent influences of digital technologies.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 107",
  "title": "Visual Culture",
  "unit": "4",
  "description": "How visual images contribute to our understanding of the world and ourselves. Theoretical approaches from media studies, art history, gender studies, and social theory will be used to analyze cultures of science, art, mass media, and everyday life.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 108A",
  "title": "POB: Introduction",
  "unit": "4",
  "description": "How do political contests and debates come to be organized on and around bodies? In what sense is the natural body a sign system and how does its organization represent and reproduce cultural values, moral assumptions, social relations, and economic rationales? This course examines these and other questions through political, historical, and media analysis.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 108D",
  "title": "POB: Disability",
  "unit": "4",
  "description": "Cultural and historical ways of defining and understanding disability relative to communication and assistive technologies, including the impact of digital technologies and the Americans with Disabilities Act. Course use of audiovisual texts and writings from fields including science and technology studies, and cultural studies.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 108G",
  "title": "POB: Gender and Biomedicine",
  "unit": "4",
  "description": "Historical and cultural aspects of media, information, imaging technology use in biomedical research, clinical care, health communication to constructions of gender and identity. We approach the subject through audiovisual texts and writings from fields including science and technology studies and cultural studies.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 109D",
  "title": "MC: Advertising and Society",
  "unit": "4",
  "description": "Advertising in historical and cross-cultural perspectives. Ideology and organization of the advertising industry; meaning of material goods; gifts in capitalist, socialist, and nonindustrial societies; natures of needs, desires, and whether advertising creates needs, desires; and approaches to decoding the advertising messages.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 109N",
  "title": "MC: American News Media",
  "unit": "4",
  "description": "History, politics, social organization, and ideology of the American news media. Surveys of the development of the news media as an institution, from earliest new newspapers to modern mass news media.",
  "prerequisite": "SOCI 1 or COMM 10."
 },
 {
  "code": "COMM 109P",
  "title": "MC: Propaganda and Persuasion",
  "unit": "4",
  "description": "Propaganda, in political-economic, national settings; Soviet Union; Nazi Germany; US World War I and II. Propaganda films, contribution of filmmakers to propaganda campaign. Explore issues in propaganda; persuasive communication; political propaganda; persuasive advertising; public relations; practical, ethical perspectives.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 110G",
  "title": "LLC: Communication in Organizations",
  "unit": "4",
  "description": "Organizations are analyzed as historically evolving discursive systems of activity mediated by talk, text, and artifacts. The class covers sense making, coordinating, symbolizing, talking, negotiating, reading and writing, storytelling, joking, and visualizing in organizations. Exemplary case studies employing several complementary frameworks are used to analyze these communicative processes.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 110M",
  "title": "LLC: Communication and Community",
  "unit": "4",
  "description": "This course examines forms of communication that affect people's everyday lives. Focusing on ways that ethnic communities transmit and acquire information and interact with mainstream institutions, we examine a variety of alternative local media, including murals, graffiti, newsletters, and community radio.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 110P",
  "title": "LLC: Language and Human Communication",
  "unit": "4",
  "description": "This course examines the interaction of language and culture in human communication. Beginning with language evolution, the course then discusses a broad range of human languages, including indigenous languages, sign languages, and hybrid languages spoken in urban centers.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 110T",
  "title": "LLC: Language, Thought, and Media",
  "unit": "4",
  "description": "This course examines the ways in which various communicative channels mediate human action and thought. A basic premise of the course is that human thought is shaped in important ways by the communicative devices used to communicate. There is a particular emphasis on how thought develops, both historically and in the individual.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111A",
  "title": "CCP: Communication and Cultural Production: Introduction",
  "unit": "4",
  "description": "This course examines the products of culture industries (e.g., music, television, fashion, food, landscape, architectural design) to analyze, specifically, how culture is consumed and by whom. How are spectators hailed and audiences fostered and shaped? And what is the role of audiences in fostering and shaping cultural forms and products?",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111B",
  "title": "CCP: Global Borders: Communication and Conflict",
  "unit": "4",
  "description": "Across the globe, geopolitical borders are charged sites of cross-cultural communication and conflict. While borders are commonly conceived as fixed physical demarcations, in this course we will examine borders as sites of exchange, as contested boundaries where diverse actors and practices converge and diverge, and as complex historical and socio-spatial formations that call into question presumed divisions between inside/outside, us/them, human/nonhuman, and technological/ecological.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111C",
  "title": "CCP: Cities and Politics of Space",
  "unit": "4",
  "description": "This course offers an introduction to the production of urban space. Cities are produced by sociocultural shifts wrought by migration, technological changes, new forms of production, globalization, and climate change. How is the landscape or built environment of the city shaped by the combined and often contradictory forces of capital, expert knowledge, social movements, and urban dwellers?",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111F",
  "title": "CCP: Folklore and Communication",
  "unit": "4",
  "description": "Folklore is characterized by particular styles, forms, and settings. Course introduces a range of folklore genres from different cultures, historical periods, oral narrative, material folk arts, dramas, rituals. Study of the relationship between expressive form and social context.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111G",
  "title": "CCP: Popular Culture",
  "unit": "4",
  "description": "An overview of the historical development of popular culture from the early modern period to the present. Also, a review of major theories explaining how popular culture reflects and/or affects patterns of social behavior.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111P",
  "title": "CCP: Performance and Cultural Studies",
  "unit": "4",
  "description": "Explores performance as a range of aesthetic conventions (theatre, film, performance art) and as a mode of experiencing and conveying cultural identity. Texts include critical writing from anthropology, psychology, linguistics, media studies, as well as film/video, play scripts, live performance.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 111T",
  "title": "CCP: Cultural Politics of Sport",
  "unit": "4",
  "description": "Examine sports as play, performance, competition, an arena where there are politics, culture, power, identity struggles. Establishing the social meanings of sport, we address ethics, race, class, nation, gender, body, science, technology, entertainment industries, commerce, spectatorship, consumption, amateurism, professionalism.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 112C",
  "title": "IM: The Idea of Childhood",
  "unit": "4",
  "description": "Our understanding of childhood as a stage of innocence is a modern idea. The idea of childhood has not been constant; different cultures, communities, and classes have shaped the integration of children according to their own standards. We examine the different ways that attitudes toward children have changed, how these attitudes have been connected to an understanding of the human being, and how the desires of society and parents are manifested in what they think the child should be.",
  "prerequisite": "COMM 10 or HDP 1."
 },
 {
  "code": "COMM 112G",
  "title": "IM: Language and Globalization",
  "unit": "4",
  "description": "The interaction of language and culture in human communication. New and old languages, standard and dialect, dominant and endangered are the special focus. Selected languages as examples of how languages exist in contemporary contexts.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 113T",
  "title": "Intermediate Topics in Communication",
  "unit": "4",
  "description": "Specialized study of communication topics, to be determined by the instructor, for any given quarter. May be taken for credit three times.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114C",
  "title": "CSI: On Constitutions",
  "unit": "4",
  "description": "Consider \"constitutions\" as meaning-making, world-building mechanisms and practices. Explore how constitutions work: as interpretive instruments designed to frame, organize, guide human thought, action, and systems (according to certain rules or principles often represented as divine in origin and universal in effect) and; as ongoing, dynamic interpretative processes that nevertheless congeal in objects, bodies, and social arrangements and are thus considered binding or unalterable.",
  "prerequisite": "COMM 10 or COGN 20."
 },
 {
  "code": "COMM 114D",
  "title": "CSI: New Media, Youth, and Democracy",
  "unit": "4",
  "description": "Does “new media” deliver on its promise to expand access to public participation? We will analyze, produce, and counter narratives about media, youth, and democracy. The course should interest students who care about politics, human development, community engagement, or human computer interaction.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114E",
  "title": "CSI: Gender, Labor, and Culture in the Global Economy",
  "unit": "4",
  "description": "This course introduces students to different theories of globalization and of gender. Against this theoretical background, students critically examine the gendered (and racialized) nature of labor in the production of material, social, and cultural goods in the global economy.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114F",
  "title": "CSI: Law, Communication, and Freedom of Expression",
  "unit": "4",
  "description": "Examination of the legal framework of freedom of expression in the United States. Covers fundamentals of First Amendment law studying key cases in historical content. Prior restraint, incitement, obscenity, libel, fighting words, public forum, campaign finance, commercial speech, and hate speech are covered.",
  "prerequisite": "COMM 10 or DOC 2 or POLI 40."
 },
 {
  "code": "COMM 114G",
  "title": "CSI: Gender and Science",
  "unit": "4",
  "description": "This course will focus on arguments about cognitive differences between men and women in science. We will review current arguments about essential differences, historical beliefs about gender attributes and cognitive ability, and gender socialization into patterns of learning in school.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114I",
  "title": "CSI: Media Technologies and Social Movements",
  "unit": "4",
  "description": "Course explores the roles of media technologies in activist campaigns, social movements. Blending theory, historical case studies, and project-based group work, students will investigate possibilities and limitations of attempts to enroll new and old media technologies in collective efforts to make social change.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114J",
  "title": "CSI: Food Justice",
  "unit": "4",
  "description": "Examine food justice from multiple analytical and theoretical perspectives: race, class, diversity, equity, legal-institutional, business, ethical, ecological, scientific, cultural, and socio-technical. Compare political strategies of food justice organizations/movements aimed at creating healthy and sustainable food systems locally and globally.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114K",
  "title": "CSI: Community Fieldwork",
  "unit": "2",
  "description": "Specialized study in community-based and/or participatory design research with topics to be determined by the instructor, for any given quarter. Students who choose the option to do fieldwork for any given course, need to register for COMM 114K. May be taken for credit three times.",
  "prerequisite": "none."
 },
 {
  "code": "COMM 114M",
  "title": "CSI: Communication and the Law",
  "unit": "4",
  "description": "Using classic and modern texts, the course explores fundamental questions of law and political theory: What are rights and where do they come from? What is the balance between freedom and equality, between individual and common goods? These theoretical explorations are then oriented to specifically communication concerns: What is the relationship between privacy and personhood? Between free speech and democracy? Between intellectual property and efficient markets?",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114N",
  "title": "CSI: Communication and the Law: The Body in Law",
  "unit": "4",
  "description": "This course concentrates on one area of law specific to the concerns of communication: the relationship between privacy, personhood, and bodily autonomy. Using a combination of legal texts, court cases, and theoretical literature, we will consider the changing nature of each dimension of this relationship as the courts have been called upon to adjudicate conflicting claims and visions in matters of reproduction, sexual identity, genetic engineering, and the commodification of body parts.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114P",
  "title": "CSI: Public History and Museum Studies",
  "unit": "4",
  "description": "This course will explore the role that \"public history\"—history as created for general audiences—plays in communicating cultural and national identities by examining museum exhibitions, their controversies, and how material objects mediate interpretations of the past.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 114T",
  "title": "CSI: Science Communication",
  "unit": "4",
  "description": "Examine science communication as a profession and unique form of storytelling. Identify who does science communication, how, why, and with what impacts. Highlight science communication's role in democracy, power, public reason, technological trajectories, the sustainability transition, and shifting university-community relations.",
  "prerequisite": "COMM 10."
 },
 {
  "code": "COMM 120I",
  "title": "AMP: Social Issues in Media Production",
  "unit": "4",
  "description": "Analyze forms of social issue media production, photography, audio/radio, arts, crafts, web, print zines, political documentary. Students work with several forms of media making: video, audio, web design, and a project in their chosen format.",
  "prerequisite": "COMM 10 and two of COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 120M",
  "title": "AMP: Media Stereotypes",
  "unit": "4",
  "description": "An examination of how the media present society's members and activities in stereotypical formats. Reasons for and consequences of this presentation are examined. Student responsibilities will be (a) participation in measurement and analysis of stereotype presentations. (b) investigating techniques for assessing both cognitive and behavioral effects of such scripted presentations on the users of media. Students will not receive credit for COMT 105 and COMM 120M.",
  "prerequisite": "COMM 10 and two of COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 120N",
  "title": "AMP: News Media Workshop",
  "unit": "4",
  "description": "Designed for students working in student news organizations or off-campus internships or jobs in news, public relations, or public information. A workshop in news writing and news analysis.",
  "prerequisite": "COMM 10 and two from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 120P",
  "title": "AMP: Digital Media in Education",
  "unit": "4",
  "description": "This course develops critical understanding of educational uses of digital media through firsthand experience in public educational settings, and readings/discussions of challenges, benefits, and pitfalls of educational applications of media technology. Three hours/week of fieldwork required.",
  "prerequisite": "COMM 10 and two from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 120W",
  "title": "AMP: Writing for Digital Media",
  "unit": "4",
  "description": "Practice, history, and theory of writing for digital media. Text combines with images, sounds, movement, and interaction. New network technologies (email, blogs, wikis, and virtual worlds) create new audience relationships. Computational processes enable texts that are dynamically configured and more.",
  "prerequisite": "COMM 10 and two from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 124A",
  "title": "Critical Design Practice/Advanced Studio",
  "unit": "4",
  "description": "Hands-on course introduces design as political activity. How will differently designed objects, environments perpetuate, interrupt status quo. Examine design, architecture, media activism, workday life. Examine ambiguous problems, take and give feedback, create prototypes to engage communities, broader publics. Students see design as part of longer-term social transformations.",
  "prerequisite": "COMM 10 or COGS 1 or ESYS 10 or POLI 10 or POLI 10D or USP 1."
 },
 {
  "code": "COMM 124B",
  "title": "Critical Design Practice/Topic Studio",
  "unit": "4",
  "description": "Course builds on understanding design as political activity. Group work to design quarter-long projects that explore political role of design, include design in built environments, organizations, media technologies. Deepened capacities to design in public, for publics, with publics. May be taken for credit three times.",
  "prerequisite": "COMM 124A."
 },
 {
  "code": "COMM 126",
  "title": "Children and Media",
  "unit": "4",
  "description": "A course that analyzes the influence of media on children's behavior and thought processes. The course takes a historical perspective, beginning with children's print literature, encompassing movies, music, television, and computers. Students will study specific examples of media products intended for children and apply various analytic techniques, including content analysis and experimentation to these materials.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 127",
  "title": "Problem of Voice",
  "unit": "4",
  "description": "This course will explore the problem of self-expression for members of various ethnic and cultural groups. Of special interest is how writers find ways of describing themselves in the face of others' sometimes overwhelming predilection to describe them.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 129",
  "title": "Race, Nation, and Violence in Multicultural California",
  "unit": "4",
  "description": "How does media representation of race, nation, and violence work? Taking multicultural California as our site, we will explore how social power is embedded in a variety of visual texts, and how media not only represents but also reproduces conflict.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 131",
  "title": "Communication, Dissent, and the Formation of Social Movements",
  "unit": "4",
  "description": "Emergence of dissent in different societies, and relationship of dissent to movements of protest and social change. Movements studied include media concentration, antiwar, antiglobalization, death penalty, national liberation, and labor. Survey of dissenting voices seeking to explain the relationship of ideas to collective action and outcomes.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 132",
  "title": "Advanced Topics in Communication, Politics, and Society",
  "unit": "4",
  "description": "Specialized study of communication, politics, and society with topics to be determined by the instructor for any given quarter. May be taken for credit three times.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 133",
  "title": "Television and Citizenship",
  "unit": "4",
  "description": "Television is a contested site for negotiating the rationales of inclusion and exclusion associated with citizenship and national belonging. Historical and contemporary case studies within international comparative contexts consider regulation, civil rights, cultural difference, social movements, new technologies, and globalization.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 134",
  "title": "Media Audiences",
  "unit": "4",
  "description": "Examines the complex relationship between mass media and the consumers and viewers they target. This course covers theories about audiences, reading practices of audiences, the economics of audiences, and the role of audiences in the digital era.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 135",
  "title": "Contemporary Minority Media Makers and the Festival Experience",
  "unit": "4",
  "description": "This advanced course examines, analyzes, and discusses media works by contemporary Asian American, Native American, African American, and Latina/o American filmmakers. The course does not offer a historical survey of films by minority makers but rather will operate on themes such as cultural identity, urbanization, personal relationships, gender relations, cultural retentions, and music. The course will require students to attend some off-campus screenings, especially those at area film festivals.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 136",
  "title": "Transmedia",
  "unit": "4",
  "description": "Transmedia is a mode of production in which a text or story unfolds across multiple media platforms. Exploring all the facets of this widespread phenomenon—historical, aesthetic, industrial, theoretical, and practical. This course explores and critically analyzes the art and economics of contemporary transmedia.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 137",
  "title": "Black Women Filmmakers",
  "unit": "4",
  "description": "Students examine film and video media produced by black women filmmakers worldwide. This course will use readings from the writings of the filmmakers themselves as well as from film studies, women's studies, literature, sociology, and history.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 138",
  "title": "Black Women, Feminism, and Media",
  "unit": "4",
  "description": "This course examines the challenges that arise in using feminist theory to understand black women's experience in Africa and the United States. It also looks at the mass media and popular culture as arenas of black feminist struggle.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 140",
  "title": "Cinema in Latin America",
  "unit": "4",
  "description": "Analysis of the changing content and sociopolitical role in Latin America of contemporary media, including the \"new cinema\" movement, recent developments in film, and popular television programming, including the telenovela. Examples drawn from Mexico, Brazil, Cuba, and other countries.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 143",
  "title": "Science Fiction",
  "unit": "4",
  "description": "Focuses on science fiction's critical investigation of history, identity, and society across a range of media forms, including film, television, and literature.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 144",
  "title": "American Television in the 1970s",
  "unit": "4",
  "description": "Course will explore the politics and culture of the 1970s through the lens of network television programming and the decade's most provocative sitcoms, dramas, variety shows, and news features. Students will analyze television episodes and read relevant media studies scholarship.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 145",
  "title": "History, Memory, and Popular Culture",
  "unit": "4",
  "description": "What role does popular culture play in shaping and creating our shared memory of the past? The course examines diverse sources such as school textbooks, monuments, holidays and commemorations, museums, films, music, and tourist attractions.",
  "prerequisite": "COMM 10 and two from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 146",
  "title": "Advanced Topics in Cultural Production",
  "unit": "4",
  "description": "Specialized advanced study in cultural production with topics to be determined by the instructor for any given quarter. May be taken for credit three times.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 151",
  "title": "The Information Age: Fact and Fiction",
  "unit": "4",
  "description": "Analysis of the forces propelling the Information Age. An examination of the differential benefits and costs, and a discussion of the presentation in the general media of the Information Age.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 153",
  "title": "Architecture as Communication",
  "unit": "4",
  "description": "This course examines how buildings, cities, towns, gardens, neighborhoods, roads, bridges, and other bits of infrastructure communicate. We consider both the materiality and language like properties of physical things in order to understand how built environments are represented, experienced, and remembered.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 155",
  "title": "Latinx Space, Place, and Culture",
  "unit": "4",
  "description": "Develop a critical understanding of the history, politics, and poetics of the Latino barrio as a distinct urban form. Course covers key concepts such as the production of space, landscapes of power, spatial apartheid, everyday urbanism, urban renewal, and gentrification.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 158",
  "title": "Representations of the Israeli/Palestinian Conflict",
  "unit": "4",
  "description": "The conflict between the state of Israel and the group of people known as Palestinians is arguably the most intractable conflict in the world today. This course is a critical engagement with debates about this conflict, and the different representations of these debates.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 159",
  "title": "Tourism, Power, and Place",
  "unit": "4",
  "description": "Explores tourism encounters around the world to question the discourses, imaginaries, and social practices involved in the construction, consumption, and reproduction of stereotypical representations of otherness (place, nature, culture, bodies).",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 160",
  "title": "Political Economy and International Communication",
  "unit": "4",
  "description": "The character and forms of international communications. Emerging structures of international communications. The United States as the foremost international communicator. Differential impacts of the free flow of information and the unequal roles and needs of developed and developing economies in international communications.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 162",
  "title": "Advanced Studies in Cultural Industries",
  "unit": "4",
  "description": "We examine how people interact with products of popular culture, production of cultural goods by looking at conditions in cultural industries. We examine film, music, publishing, focusing on how production is organized, what kind of working conditions arise, how products are distributed.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 163",
  "title": "Concepts of Freedom",
  "unit": "4",
  "description": "This course examines some of the changing cultural, social, technological, and political meanings; practices; and aspirations that together constitute what is and has been called _freedom_.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 166",
  "title": "Surveillance, Media, and the Risk Society",
  "unit": "4",
  "description": "Contributions of the field of communication to the study of surveillance and risk. Critical and legal perspectives on consumer research, copyright enforcement, the surveillance capacity of Information and Communication Technologies (ICTs), closed-circuit television, interactive media, and the \"rhetorics of surveillance\" in television and film.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 168",
  "title": "Bilingual Communication",
  "unit": "4",
  "description": "This course is designed to introduce students to multiple settings where bilingualism is the mode of communication. Examination of how such settings are socially constructed and culturally based. Language policy, bilingual education, and linguistic minorities, as well as field activities included.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 170",
  "title": "Biography and Life Stories",
  "unit": "4",
  "description": "Course examines several different ways of telling stories as a form of communication: our own life and about the lives of others. There are also the occasions that the life stories of ordinary people are told at and celebrated, for example, funerals, Festschrifts, retirement dinners, fiftieth-anniversary parties, and retrospective art shows.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 171",
  "title": "Environmental Communication",
  "unit": "4",
  "description": "Survey of the communication practices found in environment controversies. The sociological aspects of environmental issues will provide background for the investigation of environmental disputes in particular contested areas, such as scientific institutions, communities, workplaces, governments, popular culture, and the media.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 172",
  "title": "Advanced Topics in Mediation and Interaction",
  "unit": "4",
  "description": "Specialized advanced study in mediation and interaction with topics to be determined by the instructor for any given quarter. May be taken three times for credit.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 173",
  "title": "Interaction with Technology",
  "unit": "4",
  "description": "In this class we will look closely at the everyday ways in which we interact with technology to discuss sociocultural character of objects, built environments; situated, distributed, and embodied character of knowledges; use of multimodal semiotic resources, talk, gesture, body orientation, and gaze in interaction with technology.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 174",
  "title": "Communication and Social Machines",
  "unit": "4",
  "description": "An examination of the questions that developments in robotics pose to the scholars of communication: How do we communicate when our interlocutors are nonhumans? How do we study objects that are claimed to be endowed with social and affective character?",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 175",
  "title": "Cultures of Consumption",
  "unit": "4",
  "description": "This course examines the cultural politics of consumption across time and cultures through several concepts: commodity fetishism; conspicuous consumption; taste; class; and identity formation; consumption's psychological, phenomenological, and poetic dimensions; and contemporary manifestations of globalization and consumer activism.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 176",
  "title": "Communication and Religion",
  "unit": "4",
  "description": "The secularization thesis—that as society becomes more modern and standards of living rise, the importance of religion will diminish and be confined to the private sphere—may be wrong. We address religion, communication, culture, and politics in the United States.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 177",
  "title": "Culture, Domination, and Resistance",
  "unit": "4",
  "description": "Explores theories and narratives of cultural power, contemporary practices of resistance. Texts from a wide range of disciplines consider how domination is enacted, enforced, and what modes of resistance are employed to contend with uses and abuses of political power.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 180",
  "title": "Advanced Studies in Communication Theory",
  "unit": "4",
  "description": "How are messages created, transmitted, and received? What is the relationship between thinking and communicating? How are linguistic processes embedded in sociocultural practices? Course discusses classic texts in the field of communication theory stemming from linguistics, semiotics, philosophy of language, literary theory. ",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 181",
  "title": "Citizen Consumers",
  "unit": "4",
  "description": "This course considers the idea of the citizen-consumer that organizes much of contemporary urban planning and processes of identity, class, race, and gender formation in cities globally. Focusing on contemporary service oriented economies, we will critically explore how consumption spaces, such as shopping malls, theme parks, plazas, markets, parks, beaches, and tourist resorts, are critical nodes to understand neoliberal patterns of land transformation, labor exploitation, and social change.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 182",
  "title": "Education and Global Citizenship",
  "unit": "4",
  "description": "Concepts, possibilities, and dilemmas inherent in the notion of global citizenship. Formulate goals and instructional strategies for global education, expected competence of individuals within society. Examine roles that communication and curriculum play in the formation of identity, language use, and civic responsibility of global citizens.",
  "prerequisite": "COMM 10, COMM 100A, 100B, and 100C."
 },
 {
  "code": "COMM 183",
  "title": "Global Economy and Consumer Culture",
  "unit": "4",
  "description": "This course critically examines social and economic forces that shape the making of this new global consumer culture by following the flows of consumption and production between the developed and developing worlds in the 1990s. We will consider how consumers, workers, and citizens participate in a new globalized consumer culture that challenges older distinctions between the First and the Third World. In this course, we will focus on the flows between the United States, Asia, and Latin America.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 184",
  "title": "Global Nature/Global Culture",
  "unit": "4",
  "description": "Considers globalization's impact on concepts of nature in and through media texts, information systems, circulation of consumer goods and services, the emergence of global brands, science, health initiatives, environmental media activism, technology transfer in the twentieth and early twenty-first centuries.",
  "prerequisite": "COMM 10 and one from COMM 100A, 100B, 100C."
 },
 {
  "code": "COMM 194",
  "title": "Research Seminar in Washington, D.C.",
  "unit": "4",
  "description": "(Same as POLI 194, USP 194, HITO 193, SOCI 194, and COGS 194) Course attached to six-unit internship taken by students participating in the UCDC program. Involves weekly seminar meetings with faculty and teaching assistants and a substantial research paper.",
  "prerequisite": "participation in UCDC program."
 },
 {
  "code": "COMM 196A",
  "title": "Honors Seminar in Communication",
  "unit": "4",
  "description": "Preparation of an honors thesis, which can be either a research paper or a media production project. Open to students who have been admitted to the honors program. Grades will be awarded upon completion of the two-quarter sequence.",
  "prerequisite": "admission to the honors program."
 },
 {
  "code": "COMM 196B",
  "title": "Honors Seminar in Communication",
  "unit": "4",
  "description": "Preparation of an honors thesis, which can be either a research paper or a media production project. Open to students who have been admitted to the honors program. Grades will be awarded upon completion of the two-quarter sequence.",
  "prerequisite": "admission to the honors program."
 },
 {
  "code": "COMM 198",
  "title": "Directed Group Study in Communication",
  "unit": "4",
  "description": "Directed group study on a topic or in a field not included in the regular curriculum by special arrangement with a faculty member. May be taken three times for credit.",
  "prerequisite": "consent of instructor. (P/NP grades only.)"
 },
 {
  "code": "COMM 199",
  "title": "Independent Study in Communication",
  "unit": "4",
  "description": "Independent study and research under the direction of a member of the faculty. May be taken three times for credit.",
  "prerequisite": "consent of instructor. (P/NP grades only.)"
 },
 {
  "code": "COGR 200A",
  "title": "Introduction to the Study of Communication as Social Force",
  "unit": "4",
  "description": "This course focuses on descriptive and analytical approaches to the political economy of communication and social organization of media institutions. Texts will emphasize the complex structure of communication industries (historically and cross-nationally), and will examine causal and theoretical relationships between social structures, media institutions, public opinion, consumption, and voting. Restricted to major code CM75.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201B",
  "title": "Ethnographic Methods for Communication Research",
  "unit": "4",
  "description": "A supervised and coordinated group project will allow students to develop competence in a variety of ethnographic approaches to communication. Subjects covered include choosing a fieldwork site, setting or process for participation; entry and development of relationships; techniques of observation, interviewing, note taking, and transcription. Course may also include photography and video as research tools. All participant observation and interviewing strategies fall under the review of the Committee on Human Subjects.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201C",
  "title": "Discourse Analysis",
  "unit": "4",
  "description": "Review and critique of studies employing discourse analysis, focusing on the ways that “discourse” is identified, recorded, and reported. A working notion of discourse will develop from works representing diverse disciplinary approaches. Students will record, transcribe, and report on segments of talk in an everyday setting. All participant observation and interviewing strategies fall under the review of the Committee on Human Subjects.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201D",
  "title": "Historical Methods for Communication Research",
  "unit": "4",
  "description": "Different approaches to conducting historical research in communication. Such approaches may include the social history of communication technology; structuralist and poststructuralist accounts of language, media, and collective memory; and new historicist treatments of cultural history. Sources, documentation, and the nature of argument from historical evidence are emphasized.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201J",
  "title": "Comparative Analysis",
  "unit": "4",
  "description": "The logic of comparative analysis and its role in communication research. Scientific inference in qualitative research. Selection of cases. Problems of translation across cultures.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201L",
  "title": "Qualitative Analysis of Information Systems",
  "unit": "4",
  "description": "Historical and ethnographic studies of information systems—the design and use of information and communication technologies in their social, ethical, political, and organizational dimensions. Objects of study range from the invention of file folders to email use and distributed databases as communication systems.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201M",
  "title": "Content Analysis",
  "unit": "4",
  "description": "History uses methodology of quantitative analysis of media content. Includes conceptual issues concerning the quantification of meaning and practical procedures for coding and data analysis. Students read examples of studies using content analysis and carry out their own pilot analyses.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 201N",
  "title": "Genealogical Analysis",
  "unit": "4",
  "description": "Training in genealogical analysis based on Foucault and Nietzsche. Weekly exercises in genealogical methods, and class discussions of findings. A final paper: a genealogy of an object, practice, utterance, or discourse.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 210",
  "title": "Information and Society",
  "unit": "4",
  "description": "The social, legal, and economic forces affecting the evolution of mass communication institutions and structure in the industrialized world. Differential impacts of the free flow of information and unequal roles and needs of developed and developing economies.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 211",
  "title": "Memory Practices",
  "unit": "4",
  "description": "Examines theories of social and distributed memory—Maurice Halwachs to Ed Hutchins, John Sutton, and nature of the archive (Foucault and Derrida), reading databases (as memory prostheses), beginning with Manovich's work. Enquiry into mediated nature of memory practices.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "COGR 215",
  "title": "Regulation of Telecommunications",
  "unit": "4",
  "description": "The course will look at the history of, and rationales for, the regulation of mass communications in the United States. The course will cover both broadcasting and common carrier regulation. We will analyze telecommunications regulatory structures as they were constituted historically with the 1934 Communications Act and examine their breakdown in the late 1970s. In a larger vein, the course will examine the rise and functions of regulatory agencies in modern American history.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 219",
  "title": "Discourse and Organizations",
  "unit": "4",
  "description": "A central part of organizational life is talk, interaction both in formal and informal meetings and social situations. In this course we will examine the discourse of organizations, drawing on conversational analysis, discourse analysis, and the sociology of organizations.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 220",
  "title": "The News Media",
  "unit": "4",
  "description": "History, politics, social organization, and ideology of the American news media. Special attention will be paid to historical origins of journalism as a profession and “objective reporting” as ideology; empirical studies of print and TV journalism as social institutions; and news coverage of Vietnam and its implications for theories of the news media.",
  "prerequisite": null
 },
 {
  "code": "COGR 223",
  "title": "Communication Law and Policy",
  "unit": "4",
  "description": "This course examines the legal and policy framework for free speech in the United States. We cover First Amendment case law, free speech theory, copyright, and the different legal and regulatory treatment historically accorded print, broadcasting, cable television, telephone, and internet.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 225A",
  "title": "Introduction to Science Studies: Part 1",
  "unit": "4",
  "description": "Study and discussion of classic themes and texts in history of science, sociology of science, and philosophy of science, and of work that attempts to develop an interdisciplinary science studies approach.",
  "prerequisite": "enrollment in the Science Studies Program or consent of instructor."
 },
 {
  "code": "COGR 225B",
  "title": "Seminar in Science Studies",
  "unit": "4",
  "description": "Study and discussion of a selected topic in the science studies field with an emphasis on the development of research and writing skills. The topic varies from year to year.",
  "prerequisite": "enrollment in the Science Studies Program or consent of instructor."
 },
 {
  "code": "COGR 225C",
  "title": "Colloquium in Science Studies",
  "unit": "4",
  "description": "A forum for the presentation and discussion of research in progress in science studies by graduate students, faculty, and visitors. Students must attend the colloquium series for their entire first and second years. They receive course credit in one quarter each year.",
  "prerequisite": "enrollment in the Science Studies Program."
 },
 {
  "code": "COGR 225D",
  "title": "Introduction to Science Studies Part II",
  "unit": "4",
  "description": "Continuing the introduction developed in Part 1, this course examines recent key topics and problem situations in science studies. Emphasis is on recent theoretical perspectives and empirical studies in communication, history, philosophy, and sociology of science and technology, and the interplay between them.",
  "prerequisite": "completion of COGR 225A, HIGR 238, Phil 209A, or SOCG 255A or consent of instructor."
 },
 {
  "code": "COGR 237",
  "title": "Performance Theory",
  "unit": "4",
  "description": "Course is designed to introduce graduate students to the disciplinary, intellectual, and artistic genealogies of performance studies that bring together critical work from the fields of anthropology, art history, communication, critical gender studies, ethnic studies, film studies, literature, and theatre studies.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 238",
  "title": "The Frankfurt School on Mass Culture Social Theory",
  "unit": "4",
  "description": "This reading seminar will consider works by Frankfurt School theorists (Horkheimer, Adorno, Pollock, Lowenthal, Marcuse, Benjamin, Habermas) on mass media, mass culture, ideology, art, authority and the individual, and their relevance in the analysis of contemporary capitalism.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 239",
  "title": "Computer Game Studies",
  "unit": "4",
  "description": "Course considers computer games as media, rule systems, technology, and sites of communication. Approaches include hands-on play and reading material from a variety of disciplinary perspectives. Course encompasses both commercial games and the longer, more diverse academic and independent traditions.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 240",
  "title": "The Culture of Consumption",
  "unit": "4",
  "description": "(Cross-listed with HIGR 273.) This course will explore the development and cultural manifestations of consumerism in the nineteenth and twentieth centuries. Topics will include the rise of museums, the development of mass market journalism and literature, advertising, and the growth of commercial amusements. Readings will focus primarily, but not exclusively, on the United States. Students will be encouraged to think comparatively.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 241",
  "title": "Geography and Communication",
  "unit": "4",
  "description": "Geographies as media of political cultural communication. Not simply mapping but also territorial engineering as a way of constituting geographical significance. Cross-mapping practices—intersecting representational practices—as political forms of communication. Geographies as visual practices of power",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 242",
  "title": "Globalization",
  "unit": "4",
  "description": "Examination of historical and contemporary reorderings of space, time, and experience through culture and commerce, social movements, war and trade, communication institutions and practices. Considers various disciplinary modes of analyzing the forms of life produced by these processes as well as the possibilities for intervention and transformation.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 243",
  "title": "Media Technologies",
  "unit": "4",
  "description": "Media technologies from books to electronic media. Consideration of both technological design processes and shifting uses of media. Reflection on media and broader patterns of technological innovation. Attention to the distinctive role of media in technological change.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 244",
  "title": "Cultural Studies",
  "unit": "4",
  "description": "Course traces theoretical approaches to the study of culture from the Birmingham School to poststructuralist critiques of power, resistance, consumption, and pleasure. Students combine critical theory and empirical research in order to interpret the cultural politics of everyday life.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 245",
  "title": "Science and Technology Studies and Communication",
  "unit": "4",
  "description": "Course explores human-technology interaction, social constructivism, actor- network theory, gender and technology, critical and cultural studies of science and technology, and public understandings of science and technology. Emphasis on what STS can contribute to the study of media and communication.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 246",
  "title": "Playable Media",
  "unit": "4",
  "description": "Course provides an introduction to the design, evaluation, and development of media that invite and structure play. This includes digital and nondigital games, as well as related forms. Exercises, readings, and projects are required.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 247",
  "title": "Writing for Media",
  "unit": "4",
  "description": "Course explores the potential and constraints specific to writing for one or more media forms. Approaches include writing exercises, studying media, reading theoretical and historical texts, and project work.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 248",
  "title": "Visual Culture",
  "unit": "4",
  "description": "The visual is an increasingly important component of communication in everyday life. This course covers post-1968 theories of visual culture in domains such as art, film, news, the media, popular culture, medicine, sciences, and many other aspects of everyday life.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 250",
  "title": "Third World Cinema Screening",
  "unit": "4",
  "description": "Course examines the historical impetus, development, and construction of “Third Cinema”—a particular style of media making in Africa, Latin America, and Asia. An interdisciplinary approach interrogates how Third Cinema influences world cinema of today. Additional screening session required.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "COGR 251",
  "title": "Media Theory",
  "unit": "4",
  "description": "Theories of the media considered in a historical and comparative context from the rise of preprint reproduction technologies to the digital age. Focuses on communication processes and practices in terms of formality, technology, the politics of subjectivity, and institutions.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 252",
  "title": "Race and Racism",
  "unit": "4",
  "description": "Seminar focuses on race as a social, phenomenal, historical, and political formation. The seminar will address the historical emergence and theorization of race and the contemporary ways in which race/racism is a modern principle of social division, exclusion, and political mobilization.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 253",
  "title": "Cultural Study of Music and Sound",
  "unit": "4",
  "description": "Seminar will focus on music and sound as social, aesthetic, historical, can political formations and phenomena. The relationship between musical and extramusical forces will be examined. This course intensively addresses cultural politics of sound/music making, hearing and performance.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 254",
  "title": "Intellectual Property",
  "unit": "4",
  "description": "The conceptual and regulatory boundaries of intellectual property law are increasingly challenged by technological change and by ownership claims over non-Western forms of creativity. Course focuses on those challenges from three interrelated perspectives: historical, philosophical, and political.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 255",
  "title": "Studies in Political Theory",
  "unit": "4",
  "description": "Considers classical and contemporary texts in primarily western political thought with an eye toward understanding how such theory is and/or might be brought to bear in grounding different approaches and agendas in the study of communication.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 256",
  "title": "Postcolonial Theory",
  "unit": "4",
  "description": "This course provides an overview of intellectual and political thought developed through decolonization struggles in Africa and the Caribbean, and the subsequent emergence of postcoloniality from subaltern studies in the 1980s to contemporary work shaped by globalization and neoliberal philosophies.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 257",
  "title": "Communication and Social Theory",
  "unit": "4",
  "description": "Social theory forms the theoretical foundation for much work in communication, including political communication, questions of the public and public opinion, propaganda and ideology. The course will consider Marx, Weber, Durkheim, Simmel, Dewey, Habermas, the Frankfurt School and its critics.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 258",
  "title": "Language in Human Communication",
  "unit": "4",
  "description": "In this course language is broadly conceived as a medium of communication, expressed multimodally. Among the topics of this course are origins of speech and gesture, culture and language, language and social practice, and language in performance.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 259",
  "title": "Space, Place, and Media",
  "unit": "4",
  "description": "The course focuses on built environments and the production of space from an interdisciplinary, perspective, using the critical and methodological tools of communication, anthropology, geography, history, psychology, political science, and urban studies.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 261",
  "title": "Mediational Approaches to Culture/Mind",
  "unit": "4",
  "description": "This course will examine theories of mind in which cultural mediation is given a leading role. The work of anthropologists, psychologists, and communication scholars will be studied in depth. Emphasis will be placed on the methodological implication of cultural theories of mind for empirical research.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 262",
  "title": "Geographies of Difference, Exclusion and Conflict",
  "unit": "4",
  "description": "This seminar focuses on how differences between groups of people, and the patterns of power, exclusion and conflict resulting from such differences, become embedded in geographical landscapes. The course examines place-based sites of difference, power, and conflict beginning with the map, and moving through such spatial environments as the body, the city, the nation, the landscape, the reservation, culminating in borderland conflict here in our own backyard.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 263",
  "title": "Writing Research Proposals",
  "unit": "4",
  "description": "This course is an introduction to the art of writing a research proposal. We will concentrate on proposals for ethnographic fieldwork, although the skills learned will be useful for many other purposes. The proposal writing process will be broken into component parts. Class time will be spent discussing these parts in greater detail and commenting on one another’s work. By the end of the quarter students will have produced a research proposal of their own.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 275",
  "title": "Topics in Communication",
  "unit": "4",
  "description": "Specialized study in communication, with topics to be determined by the instructor for any given quarter.",
  "prerequisite": null
 },
 {
  "code": "COGR 278",
  "title": "Talking Culture, Culture Talking: Voices of Diversity",
  "unit": "4",
  "description": "(Cross-listed with EDS 278). This course explores the discourse of culture in American society and the problem of silenced or unheard voices. The interaction of individual and collective voice, language, and identity are discussed as they bear on the ways that culture moves through important social institutions such as schools. Of particular interest are issues of teaching, learning, displacement, inclusion, marginality, and the speaking center.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 280",
  "title": "Advanced Workshop in Communication Media",
  "unit": "4",
  "description": "This course is a project course in which students prepare a production or experiment using one of the forms of media. The course is designed to allow students to experiment in a communication form other than the usual oral presentation in class or a term paper. Students can do a video production, a coordinated photographic essay or exhibit, a computer instructional game, a published newspaper or magazine article directed at a special audience, a theatrical presentation, or some form other than those listed.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 281",
  "title": "Understanding Everyday Life",
  "unit": "4",
  "description": "In this course we review how we might go about studying and thinking about the everyday life both as a concept and as a domain of study. The course will have a balance of both theoretical and empirical work.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 282",
  "title": "Reading and Memory",
  "unit": "4",
  "description": "Approaching reading from a historical perspective, the course concentrates on two analytic frames to connect memory to texts: ideas about “the memory palace,” locating memories in things, and figured worlds theory, treating objects as forms of intellectual scaffolding and memory.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 283",
  "title": "Political Economy",
  "unit": "4",
  "description": "Political economy is an older interdisciplinary approach explaining how the state, political environment, law, and economic system influence one another. The course engages classic texts, with attention to issues in the political economy of communication toward the end.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 284",
  "title": "Time",
  "unit": "4",
  "description": "This seminar will introduce key issues and readings in our understanding of time. Time is historical, not natural. We will examine ways that modern time structures and orders human interaction.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 285",
  "title": "Ethnography Practicum",
  "unit": "4",
  "description": "This course offers students a primer in ethnographic research. We examine all parts of the ethnographic process: from the concept work of project formulation and design to practical issues around the conduct of ethnographic research. This course is intended for graduate students at any stage of ethnographic research. Students may not receive credit for ANTH 287 and COGR 285 and ETHN 287.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 294",
  "title": "The History of Communication Research",
  "unit": "4",
  "description": "Intellectual history of the field of communication studies from Robert Park to the present. Explication and assessment of major research approaches and classic studies representing both empirical and critical traditions.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 296",
  "title": "Communication Research as an Interdisciplinary Activity",
  "unit": "4",
  "description": "A course that introduces students to the interdisciplinary nature of the field of communication research as represented by the work of faculty in the Department of Communication. Through faculty research, students are presented with concrete examples of communication research theory and practice that can provide them with insights for conducting their own research projects.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 298",
  "title": "Directed Group Study",
  "unit": "1-12",
  "description": "The study and analysis of specific topics to be developed by a small group of graduate students under the guidance of an interested faculty member.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "COGR 299",
  "title": "Graduate Research",
  "unit": "1-12",
  "description": "Advanced independent study in communication under the guidance of Department of Communication faculty.",
  "prerequisite": null
 },
 {
  "code": "COGR 500",
  "title": "Practice Teaching in Communication",
  "unit": "4",
  "description": "A doctoral student in communication is required to assist in teaching undergraduate Department of Communication courses for a total of six quarters. One meeting per week with the instructor, one meeting per week with the assigned sections, and attendance at the lecture of the undergraduate course in which he or she is participating are part of this requirement.",
  "prerequisite": null
 }
]