[
 {
  "code": "AESE 278A",
  "title": "Complexity and Large-Scale Systems",
  "unit": "4",
  "description": "Comprehensive introduction to system and event complexity, software and systems engineering practices for complexity management, agile and plan-driven development, development and management processes and process models, data-, information- and knowledge-management, basics of distributed data and computation. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE or instructor approval. AESE 278A is cross-listed with CSE 278A, ECE 205A, and MAE 277A."
 },
 {
  "code": "AESE 278B",
  "title": "Enterprise Architecting",
  "unit": "4",
  "description": "Architectural foundations, frameworks, standards, and infrastructures with an emphasis on layered architectures, loose coupling, architecture evolution, service- and component-oriented architectures, enterprise service buses, metadata and information virtualization, ontologies, Semantic Web, policy and governance, service-level agreements, information assurance essentials. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE, MGT 291, MGT 406, and AESE 278A or MAE 277A or ECE 205 or CSE 278A or instructor approval."
 },
 {
  "code": "AESE 278C",
  "title": "Modeling, Simulation, and Analysis",
  "unit": "4",
  "description": "Model-driven architecture and development concepts, business process and workflow modeling, structured analysis and IDEF modeling methods, object-, component- and service-orientation and the Unified Modeling Language, event- and stream models, colored Petri Nets, executable architectures, distributed simulation for performance analysis. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE, MGT 291, AESE 278A, AESE 278B or instructor approval. AESE 278C is cross-listed with CSE 278C, ECE 206, and MAE 278A."
 },
 {
  "code": "AESE 278D",
  "title": "Engineering Essentials for Open, Distributed Systems",
  "unit": "4",
  "description": "Engineering tools and their use in defining the layered and service-oriented architectures, Unified Modeling Language and enterprise architecture tools, business and process modeling tools, visualization methods, data and information management tools, comprehensive domain modeling, architecture implementation via enterprise service buses. This workshop course meets once a quarter from Wednesday to Saturday from 8:00 a.m. to 5:00 p.m. for more intensive interaction.",
  "prerequisite": "enrollment in MAS-AESE, AESE 278A (or CSE 278A or ECE 205A or MAE 277A), AESE 278C (or CSE 278C or ECE 206 or MAE 278A) or instructor approval."
 },
 {
  "code": "AESE 278E",
  "title": "Patterns for Enterprise Architecting",
  "unit": "4",
  "description": "Fundamental aspects of pattern methodologies and re-use, requirements, design and architecture patterns, patterns for service-oriented architectures, enterprise application and integration patterns, E-business patterns, event- driven architectures and patterns for complex event processing, process patterns, architecture evolution and refactoring using patterns. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE, AESE 278B, AESE 278C, AESE 278D or instructor approval."
 },
 {
  "code": "AESE 241",
  "title": "Decision and Risk Analysis",
  "unit": "4",
  "description": "Focuses on analytic techniques supporting rational business decision making, providing systematic approaches to complex decision situations. Addresses analysis of conflicting objectives and use of tools such as value trees, decision trees, influence diagrams, and value hierarchies, Bayesian networks, and data mining. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE, or permission of the instructor. AESE 241 is cross-listed with MGT 241."
 },
 {
  "code": "AESE 261",
  "title": "Managing Stakeholder Relationships",
  "unit": "4",
  "description": "Addresses critical processes and frameworks required to build effective business relationships internally and externally. Focuses on the skills required by functional or technical leaders to envision strategic value and create business development strategies aligned with organizational needs. This workshop meets once a quarter from Wednesday to Saturday from 8:00 a.m. to 5:00 p.m. for more intensive interaction.",
  "prerequisite": "enrollment in MAS-AESE, MGT 406 or permission of the instructor. AESE 261 is cross-listed with MGT 261."
 }
]