[
 {
  "code": "DOC 1",
  "title": "Dimensions of Culture: Diversity",
  "unit": "4",
  "discription": "This course focuses on sociocultural diversity in examining class, ethnicity, race, gender, and sexuality as significant markers of differences among persons. Emphasizing American society while cultivating students' critical reading skills, it explores the cultural understandings of diversity and its economic, moral, and political consequences _._ Restrictions: Marshall College students only, must be taken for a letter grade.",
  "prerequsite": "satisfaction of UC Entry Level Writing Requirement or concurrent enrollment in AWP 1: Analytical Writing. (F)"
 },
 {
  "code": "DOC 2",
  "title": "Dimensions of Culture: Justice",
  "unit": "6",
  "discription": "This course considers the nature of justice in philosophical, historical, and legal terms. Topics include racial justice, political representation, economic justice, gender and justice, the rights of cultural minorities, and crime and punishment. The course offers intensive instruction in writing university- level expository prose, specifically thesis-based argumentative essays. Restrictions: Marshall College students only, must be taken for a letter grade.",
  "prerequsite": "satisfaction of UC Entry Level Writing Requirement and completion of DOC 1. Enrollment by department approval only. (W)"
 },
 {
  "code": "DOC 3",
  "title": "Dimensions of Culture: Imagination",
  "unit": "6",
  "discription": "This course examines the relevance of sociocultural diversity and the nature of justice in explicitly local and contemporary contexts. Students are asked to imagine and propose rigorously researched and interdisciplinary solutions to issues relevant to their own lived experiences. The course offers intensive instruction in writing university-level expository prose, with special emphasis on developing a research process. Restrictions: Marshall College students only, must be taken for a letter grade.",
  "prerequsite": "DOC 2. (S)"
 },
 {
  "code": "DOC 100D",
  "title": "Dimensions of Culture: Promises and Contradictions in US Culture",
  "unit": "4",
  "discription": "This course provides a broad overview of key historical contradictions in US history and explores the origins of social stratifications and movements. Students acquire tools for analyzing national tensions. Central aspects include slavery, women's rights, and rising corporate power. Course introduces concepts at the intersections of class, gender, religion, race, and sexuality. Students learn to analyze and discuss complex historical/societal artifacts. Designed for two student sectors: 1) Marshall College transfer students who have not taken the DOC sequence, and 2) Transfer and other upper-division students from all seven colleges who want to fulfill the campuswide diversity requirement.",
  "prerequsite": "upper-division standing and completion of college writing."
 }
]