[
 {
  "code": "DSC 10",
  "title": "Principles of Data Science",
  "unit": "4",
  "description": "This introductory course develops computational thinking and tools necessary to answer questions that arise from large-scale datasets. This course emphasizes an end-to-end approach to data science, introducing programming techniques in Python that cover data processing, modeling, and analysis.",
  "prerequisite": "none."
 },
 {
  "code": "DSC 20",
  "title": "Programming and Basic Data Structures for Data Science",
  "unit": "4",
  "description": "Provides an understanding of the structures that underlie the programs, algorithms, and languages used in data science by expanding the repertoire of computational concepts introduced in DSC 10 and exposing students to techniques of abstraction. Course will be taught in Python and will cover topics including recursion, higher-order functions, function composition, object-oriented programming, interpreters, classes, and simple data structures such as arrays, lists, and linked lists.",
  "prerequisite": "DSC 10."
 },
 {
  "code": "DSC 30",
  "title": "Data Structures and Algorithms for Data Science",
  "unit": "4",
  "description": "Builds on topics covered in DSC 20 and provides practical experience in composing larger computational systems through several significant programming projects using Java. Students will study advanced programming techniques including encapsulation, abstract data types, interfaces, algorithms and complexity, and data structures such as stacks, queues, priority queues, heaps, linked lists, binary trees, binary search trees, and hash tables.",
  "prerequisite": "DSC 20."
 },
 {
  "code": "DSC 40A",
  "title": "Theoretical Foundations of Data Science I",
  "unit": "4",
  "description": "This course, the first of a two-course sequence (DSC 40A-B), will introduce the theoretical foundations of data science. Students will become familiar with mathematical language for expressing data analysis problems and solution strategies, and will receive training in probabilistic reasoning, mathematical modeling of data, and algorithmic problem solving. DSC 40A will introduce fundamental topics in machine learning, statistics, and linear algebra with applications to data analysis. DSC 40A-B connect to DSC 10, 20, and 30 by providing the theoretical foundation for the methods that underlie data science.",
  "prerequisite": "DSC 10, MATH 20C or MATH 31BH, and MATH 18 or MATH 20F or MATH 31AH. Restricted to students within the DS25 major. All other students will be allowed as space permits."
 },
 {
  "code": "DSC 40B",
  "title": "Theoretical Foundations of Data Science II",
  "unit": "4",
  "description": "The sequence DSC 40A-B introduces the theoretical foundations of data science and covers the following topics: mathematical language for expressing data analysis problems and solution strategies, probabilistic reasoning, mathematical modeling of data, and algorithmic problem solving. DSC 40B, the second course in the sequence, introduces fundamental topics in combinatorics, graph theory, probability, and continuous and discrete algorithms with applications to data analysis.",
  "prerequisite": "DSC 20 and 40A. Restricted to students within the DS25 major. All other students will be allowed as space permits."
 },
 {
  "code": "DSC 80",
  "title": "The Practice and Application of Data Science",
  "unit": "4",
  "description": "The marriage of data, computation, and inferential thinking, or \"data science,\" is redefining how people and organizations solve challenging problems and understand the world. This course bridges lower- and upper- division data science courses as well as methods courses in other fields. Students master the data science life-cycle and learn many of the fundamental principles and techniques of data science spanning algorithms, statistics, machine learning, visualization, and data systems.",
  "prerequisite": "DSC 30 and DSC 40A."
 },
 {
  "code": "DSC 90",
  "title": "Seminar in Data Science",
  "unit": "2",
  "description": "Students will learn about a variety of topics in data science through interactive presentations from faculty and industry professionals.",
  "prerequisite": "DSC 10. Restricted to students within the DS25 major. All other students will be allowed as space permits."
 },
 {
  "code": "DSC 95",
  "title": "Tutor Apprenticeship in Data Science",
  "unit": "2",
  "description": "Students will receive training in skills and techniques necessary to be effective tutors for data science courses. Students will also gain practical experience in tutoring students on data science topics.",
  "prerequisite": "DSC 10. Students must have applied for and been accepted as a tutor for a DSC course for the first time; enrollment in DSC 95 is required for these students."
 },
 {
  "code": "DSC 96",
  "title": "Workshop in Data Science",
  "unit": "2",
  "description": "Students will explore topics and tools relevant to the practice of data science in a workshop format. The instructor works with students on guided projects to help students acquire knowledge and skills to complement their course work in the core data science classes. Topics vary from quarter to quarter. Students are strongly recommended to enroll in either DSC 10 or DSC 20 concurrently.",
  "prerequisite": "Restricted to students within the DS25 major. All other students will be allowed as space permits."
 },
 {
  "code": "DSC 97",
  "title": "Internship in Data Science",
  "unit": "2 or 4",
  "description": "Individual research on a topic related to data science, by special arrangement with and under the direction of a UC San Diego faculty member, in connection with an internship at an organization. Internship work will inform but not necessarily define the research topic. The research topic is expected to promote the study of the principles and techniques involved in the internship work. May be taken for credit up to two times.",
  "prerequisite": "MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies Form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first- year and sophomore level students."
 },
 {
  "code": "DSC 98",
  "title": "Directed Group Study in Data Science",
  "unit": "2 or 4",
  "description": "Students will investigate a topic in data science through directed reading, discussion, and project work under the supervision of a faculty member. May be taken for credit up to two times.",
  "prerequisite": "MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies Form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first-year and sophomore level students."
 },
 {
  "code": "DSC 99",
  "title": "Independent Study in Data Science",
  "unit": "2 or 4",
  "description": "Students will participate in independent study or research in data science under the direction of a UC San Diego faculty member. May be taken for credit up to two times.",
  "prerequisite": "MATH 20C or MATH 31BH and MATH 18 or MATH 31AH and DSC 20 and DSC 40A. Completion of thirty units at UC San Diego with a university GPA of 3.0. Special Studies Form, consent of the instructor, and approval of the department required. Priority enrollment is given to data science majors DS25. Restricted to first-year and sophomore level students."
 },
 {
  "code": "DSC 100",
  "title": "Introduction to Data Management",
  "unit": "4",
  "description": "This course is an introduction to storage and management of large-scale data using classical relational (SQL) systems, with an eye toward applications in data science. The course covers topics including the SQL data model and query language, relational data modeling and schema design, elements of cost-based query optimizations, relational data base architecture, and database-backed applications.",
  "prerequisite": "DSC 80 and DSC 40B."
 },
 {
  "code": "DSC 102",
  "title": "Systems for Scalable Analytics",
  "unit": "4",
  "description": "This course introduces the principles of computing systems and infrastructure for scaling analytics to large datasets. Topics include memory hierarchy, distributed systems, model selection, heterogeneous datasets, and deployment at scale. The course will also discuss the design of systems such as MapReduce/Hadoop and Spark, in conjunction with their implementation. Students will also learn how dataflow operations can be used to perform data preparation, cleaning, and feature engineering.",
  "prerequisite": "DSC 100."
 },
 {
  "code": "DSC 104",
  "title": "Beyond Relational Data Management",
  "unit": "4",
  "description": "The course will introduce a variety of No-SQL data formats, data models, high- level query languages, and programming abstractions representative of the needs of modern data analytic tasks. Topics include hierarchical graph database systems, unrestricted graph database systems, array databases, comparison of expressive power of the data models, and parallel programming abstractions, including Map/Reduce and its descendants.",
  "prerequisite": "DSC 100. Restricted to students within the DS25 major. All other students will be allowed as space permits."
 },
 {
  "code": "DSC 106",
  "title": "Introduction to Data Visualization",
  "unit": "4",
  "description": "Data visualization helps explore and interpret data through interaction. This course introduces the principles, techniques, and algorithms for creating effective visualizations. The course draws on the knowledge from several disciplines including computer graphics, human-computer interaction, cognitive psychology, design, and statistical graphics and synthesizes relevant ideas. Students will design visualization systems using D3 or other web-based software and evaluate their effectiveness. It is highly recommended that students take MATH 189 prior to taking DSC 106.",
  "prerequisite": "DSC 80."
 },
 {
  "code": "DSC 120",
  "title": "Signal Processing for Data Analysis",
  "unit": "4",
  "description": "This course will focus on ideas from classical and modern signal processing, with the main themes of sampling continuous data and building informative representations using orthonormal bases, frames, and data dependent operators. Topics include sampling theory, Fourier analysis, lossy transformations and compression, time and spatial filters, and random Fourier features and connections to kernel methods. Sources of data include time series and streaming signals and various imaging modalities.",
  "prerequisite": "MATH 18 or MATH 31AH and MATH 20C and DSC 40B."
 },
 {
  "code": "DSC 140A",
  "title": "Probabilistic Modeling and Machine Learning",
  "unit": "4",
  "description": "The course covers learning and using probabilistic models for knowledge representation and decision-making. Topics covered include graphical models, temporal models, and online learning, as well as applications to natural language processing, adversarial learning, computational biology, and robotics. Prior completion of MATH 181A is strongly recommended.",
  "prerequisite": "DSC 40B, DSC 80, and ECE 109 or ECON 120A or MAE 108 or MATH 180A or MATH 183 or MATH 186."
 },
 {
  "code": "DSC 155",
  "title": "Hidden Data in Random Matrices",
  "unit": "4",
  "description": "Rigorous treatment of principal component analysis, one of the most effective methods in finding signals amidst the noise of large data arrays. Topics include singular value decomposition for matrices, maximal likelihood estimation, least squares methods, unbiased estimators, random matrices, Wigner's semicircle law, Markchenko-Pastur laws, universality of eigenvalue statistics, outliers, the BBP transition, applications to community detection, and stochastic block model.",
  "prerequisite": "MATH 180A and (MATH 18 or MATH 31AH). Completion of MATH 102 is encouraged but not required. Students will not receive credit for both MATH 182 and DSC 155."
 },
 {
  "code": "DSC 160",
  "title": "Data Science and the Arts",
  "unit": "4",
  "description": "This course addresses the intersection of data science and contemporary arts and culture, exploring four main themes of authorship, representation, visualization, and data provenance. The course is not solely an introduction to data science techniques nor merely an arts practice course, but explores significant new possibilities for both fields arising from their intersection. Students will examine problems from complementary perspectives of artist- researchers and data scientists.",
  "prerequisite": "DSC 80."
 },
 {
  "code": "DSC 161",
  "title": "Text as Data",
  "unit": "4",
  "description": "This class explores statistical and computational methods to enable students to use text as a data source in the social sciences. Hands-on examples will equip students to work with text data in final projects.",
  "prerequisite": "ECON 5 or POLI 170A or POLI 171 or POLI 30 or POLI 30D or POLI 5 or POLI 5D. Students will not receive credit for both POLI 176 and DSC 161. Restricted to junior and senior level students."
 },
 {
  "code": "DSC 170",
  "title": "Spatial Data Science and Applications",
  "unit": "4",
  "description": "Spatial data science is a set of concepts and methods that deal with accessing, managing, visualizing, analyzing, and reasoning about spatial data in applications where location, shape and size of objects, and their mutual arrangement are important. This upper-division course explores advanced data science concepts for spatial data, introducing students to principles and techniques of spatial data analysis, including geographic information systems, spatial big data management, and geostatistics.",
  "prerequisite": "DSC 80."
 },
 {
  "code": "DSC 180A",
  "title": "Data Science Project I",
  "unit": "4",
  "description": "In this two-course sequence students will investigate a topic and design a system to produce statistically informed output. The investigation will span the entire lifecycle, including assessing the problem, learning domain knowledge, collecting/cleaning data, creating a model, addressing ethical issues, designing the system, analyzing the output, and presenting the results. 180A deals with research, methodology, and system design. Students will produce a research summary and a project proposal.",
  "prerequisite": "DSC 102 and MATH 189 and CSE 151 or CSE 158."
 },
 {
  "code": "DSC 180B",
  "title": "Data Science Project II",
  "unit": "4",
  "description": "In this two-course sequence students will investigate a topic and design a system to produce statistically informed output. The investigation will span the entire lifecycle, including assessing the problem, learning domain knowledge, collecting/cleaning data, creating a model, addressing ethical issues, designing the system, analyzing the output, and presenting the results. 180B will consist of implementing the project while studying the best practices for evaluation.",
  "prerequisite": "DSC 106 and DSC 180A."
 },
 {
  "code": "DSC 190",
  "title": "Topics in Data Science",
  "unit": "4",
  "description": "Topics of special interest in data science. Topics vary from quarter to quarter. May be taken for credit up to two times.",
  "prerequisite": "Restricted to junior and senior level students. Department and instructor approval is required to monitor enrollment and to ensure that students have the sufficient educational background for a given topic."
 },
 {
  "code": "DSC 191",
  "title": "Seminar in Data Science",
  "unit": "1 or 2",
  "description": "A seminar course on topics of current interest in data science. Topics may vary from quarter to quarter. May be taken for credit three times.",
  "prerequisite": "Restricted to junior and senior level students. Department and instructor approval is required to monitor enrollment and to ensure that students have the sufficient educational background for a given topic."
 },
 {
  "code": "DSC 197",
  "title": "Data Science Internship",
  "unit": "4",
  "description": "Directed study and research at laboratories/institutions outside of campus.",
  "prerequisite": "Restricted to junior and senior level students. Consent of the instructor and approval of the department. An application for Special Studies must be filed with the Registrar's office after approval from the instructor and the department chair."
 },
 {
  "code": "DSC 198",
  "title": "Directed Group Study in Data Science",
  "unit": "2 or 4",
  "description": "Data science topics whose study involves reading and discussion by a small group of students under supervision of a faculty member. May be taken for credit up to two times.",
  "prerequisite": "Restricted to junior and senior level students. Consent of the instructor and approval of the department. Department stamp required. An application for Special Studies must be filed with the Registrar's office after approval from the instructor and the department chair."
 },
 {
  "code": "DSC 199",
  "title": "Independent Study for Data Science Undergraduates",
  "unit": "2 or 4",
  "description": "Independent reading or research on a topic related to data science by special arrangement with a faculty member. May be taken for credit up to two times.",
  "prerequisite": "Restricted to junior and senior level students. Consent of the instructor and approval of the department. An application for Special Studies must be filed with the Registrar's Office after approval from the instructor and the department chair."
 },
 {
  "code": "DSC 290",
  "title": "Seminar in Data Science",
  "unit": "1-2",
  "description": "A graduate seminar course in which topics of special interest in data science will be presented by faculty or by graduate students under faculty direction. Restricted to graduate level students. May be repeated for credit twenty-four times as topics vary.",
  "prerequisite": null
 },
 {
  "code": "DSC 291",
  "title": "Topics in Data Science",
  "unit": "4",
  "description": "Topics of special interest in data science. Topics may vary quarter to quarter. Restricted to graduate level students. May be taken for credit up to nine times.",
  "prerequisite": null
 },
 {
  "code": "DSC 500",
  "title": "Teaching Assistantship",
  "unit": "2 or 4",
  "description": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation and grading of examinations and other written exercises, and student relations. Number of units for credit depends on number of hours devoted to class or section assistance. May be taken for credit up to seventy-two units.",
  "prerequisite": "DSC 500 is for selected teaching assistants only; therefore, consent of instructor is required."
 },
 {
  "code": "DSC 599",
  "title": "Teaching Methods in Data Science",
  "unit": "2",
  "description": "Training in teaching methods in the field of data science. This course examines theoretical and practical communication and teaching techniques particularly appropriate to data science.",
  "prerequisite": "Consent of faculty required. Only graduate students who are TAing for the first time in the data science program are eligible to enroll."
 }
]