[
 {
  "code": "DSGN 1",
  "title": "Design of Everyday Things",
  "unit": "4",
  "discription": "A project-based course examining how principles from cognitive science apply to the design of things simple (doors) and complex (new technology). Learn about affordances, constraints, mappings, and conceptual models. Learn observational and design skills. Become a human-centered design thinker.",
  "prerequsite": null
 },
 {
  "code": "DSGN 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "discription": "Special topics in design are discussed. P/NP grades only. May be taken for credit four times when topics vary.",
  "prerequsite": null
 },
 {
  "code": "DSGN 99",
  "title": "Independent Study",
  "unit": "2 or 4",
  "discription": "Independent literature or laboratory research by arrangement with and under direction of a design faculty member. P/NP grades only. May be taken for credit three times.",
  "prerequsite": "lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Special Studies form."
 },
 {
  "code": "DSGN 100",
  "title": "Prototyping",
  "unit": "4",
  "discription": "Explores cognitive principles of thinking through making. Introduces methods and tools for prototyping user experiences. Students make various prototypes and participate in weekly critique sessions. Topics: experience design, rapid prototyping, sketching, bodystorming, cardboard modeling, UI hacking, and design theory.",
  "prerequsite": "DSGN 1."
 },
 {
  "code": "DSGN 119",
  "title": "Design at Large",
  "unit": "2",
  "discription": "New societal challenges, cultural values, and technological opportunities are changing design—and vice versa. The seminar explores this increased scale, real-world engagement, and disruptive impact. Invited speakers from UC San Diego and beyond share cutting-edge research on interaction, design, and learning. P/NP grades only. May be taken for credit up to four times.",
  "prerequsite": "COMM 124A or COGS 10 or DSGN 1."
 },
 {
  "code": "DSGN 160",
  "title": "Special Topics in Design",
  "unit": "4",
  "discription": "Special topics in design. May be taken for credit three times when topics vary.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "DSGN 161",
  "title": "Design Project",
  "unit": "4",
  "discription": "Special topics in design. May be taken for credit three times when topics vary. Recommended preparation: may require shop skills.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "DSGN 195",
  "title": "Instructional Apprenticeship in Design",
  "unit": "4",
  "discription": "Students, under the direction of the instructor, lead laboratory or discussion sections, attend lectures, and meet regularly with the instructor to help prepare course materials and grade papers and exams. P/NP grades only. May be taken for credit two times.",
  "prerequsite": "upper-division standing, 3.0 GPA, consent of instructor, and department approval."
 },
 {
  "code": "DSGN 198",
  "title": "Directed Group Study",
  "unit": "2 or 4",
  "discription": "This directed group study course is for small groups of advanced students who wish to complete a one-quarter reading or research project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit up to three times.",
  "prerequsite": "upper-division standing, 2.5 GPA, consent of instructor, and department approval."
 },
 {
  "code": "DSGN 199",
  "title": "Independent Project",
  "unit": "2 or 4",
  "discription": "This independent project course is for individual, advanced students who wish to complete a design project under the mentorship of a faculty member. Students should contact faculty whose research interests them to discuss possible projects. P/NP grades only. May be taken for credit three times.",
  "prerequsite": "upper-division standing, 2.5 GPA, consent of instructor, and department approval."
 },
 {
  "code": "DSGN 260",
  "title": "Advanced Topics in Design",
  "unit": "4",
  "discription": "Special topics in design. May be taken for credit eighteen times.",
  "prerequsite": "graduate standing and consent of instructor."
 },
 {
  "code": "DSGN 261",
  "title": "Advanced Design Project",
  "unit": "4",
  "discription": "Special topics in design. S/U grades only. May be taken for credit three times. Recommended preparation: may require maker-lab or shop skills.",
  "prerequsite": "graduate standing and consent of instructor."
 },
 {
  "code": "DSGN 299",
  "title": "Independent Project",
  "unit": "2 or 4",
  "discription": "Students study, research, and implement project under the direction of a member of the faculty. S/U grades only. May be taken for credit three times. Recommended preparation: may require maker-lab or shop skills.",
  "prerequsite": "graduate standing and consent of instructor."
 }
]