[
 {
  "code": "ENG 10",
  "title": "Fundamentals of Engineering Applications",
  "unit": "2",
  "description": "Application-oriented, hands-on introduction to engineering mathematics and design processes. Key mathematical concepts as they apply to engineering, including solving systems of equations and least-squares regression. In-class activities using Python and Arduino will complement the lectures and provide students hands-on experience with solving real-world engineering problems related to design, manufacturing and prototyping, electronics, and data analysis.",
  "prerequisite": null
 },
 {
  "code": "ENG 15",
  "title": "Engineer Your Success",
  "unit": "2",
  "description": "Engineer Your Success is designed to enhance your success as an engineering student (and later as an engineer) by developing key academic and personal skills. Learn how to study more effectively and uncover how to become the best engineer you can be. This course focuses on academic and personal planning, time management, study skills, and paths to personal growth. Activities include individual and collaborative exercises, personal reflections, and a final project.",
  "prerequisite": null
 },
 {
  "code": "ENG 20",
  "title": "Introduction to Engineering Research",
  "unit": "2",
  "description": "Introduction to research in engineering. Topics include defining a research problem, finding and reading technical papers, technical writing, and effective practices for presenting research. Students write a proposal on their lab placement research project. This course is for students in the Guided Engineering Apprenticeship in Research (GEAR).",
  "prerequisite": "department approval required."
 },
 {
  "code": "ENG 100A",
  "title": "Team Engineering",
  "unit": "2",
  "description": "Introduction to theory and practice of team engineering, including temperament and work styles; stages of team development; project management; communication, problem solving, and conflict resolution skills; creativity; leadership; social entrepreneurship; and ethics. Students may not receive credit for both ENG 100 and ENG 100A.",
  "prerequisite": "concurrent enrollment in or completion of one of the following: DOC 2, CAT 2, HUM 2, MMW 2, MCWP 50, or WCWP 10B, or consent of instructor."
 },
 {
  "code": "ENG 100B",
  "title": "Engineering Leadership",
  "unit": "2",
  "description": "Engineering leadership attitudes, styles, principles, and approaches; stages of product development and evolution; strategic and critical thinking and problem solving for engineering projects; resource management; quality control; risk analysis and risk taking; engineering business economics, law, leadership and corporate ethics. Contact [gordoncenter@ucsd.edu](mailto:gordoncenter@ucsd.edu) if you are unable to enroll in the course.",
  "prerequisite": "ENG 100A, or ENG 100, or consent of the instructor."
 },
 {
  "code": "ENG 100C",
  "title": "Technical Writing/Communication for Engineers and Scientist",
  "unit": "2",
  "description": "Principles and procedures of technical writing and professional communication. The course is ideal for students pursuing careers in science and/or engineering and covers organizing information, writing for technical forms such as proposals and abstracts, and designing visual aids.",
  "prerequisite": null
 },
 {
  "code": "ENG 100D",
  "title": "Design for Development",
  "unit": "4",
  "description": "An introduction to the practice of human-centered design and team engineering within a humanitarian context. Includes a group project designing a solution for a local or global nonprofit organization. Topics include design process, contextual listening, project management, needs and capacity assessment, stakeholder analysis, ethical issues, models of leadership, gender and cultural issues, sustainable community development, and social entrepreneurship. ENG 100D is the gateway course for the Global TIES program, but it is open to all undergraduate students. Please go to [http://globalties.ucsd.edu](http://globalties.ucsd.edu/) for information about Global TIES. Recommended preparation: one university-level mathematics course.",
  "prerequisite": "CAT 2 or DOC 2 or HUM 2 or MCWP 40 or MMW 2 or WCWP 10B."
 },
 {
  "code": "ENG 100L",
  "title": "Design for Development Lab",
  "unit": "2",
  "description": "Faculty-directed, interdisciplinary, long-term humanitarian engineering, technology, and social innovation projects. Students work in teams to design, build, test, and deliver solutions to real-world problems experienced by nonprofit organizations and the communities they serve. ENG 100L is the laboratory course for the Global TIES program. Enrollment in this course is limited to students who have applied to and been accepted into the Global TIES program. Please go to <http://globalties.ucsd.edu> to apply to the program. May be taken for credit six times.",
  "prerequisite": "ENG 100D. Department approval required."
 },
 {
  "code": "ENG 201",
  "title": "Venture Mechanics",
  "unit": "4",
  "description": "Examines the engineering/entrepreneurism interface. Discovery, development, and implementation of new product ideas. Understanding markets, competitors, and selling innovations. Cultivating effective working relationships between research, engineering, manufacturing, and marketing elements of an organization. Priority enrollment given to engineering majors.",
  "prerequisite": null
 },
 {
  "code": "ENG 202",
  "title": "Enterprise Dynamics",
  "unit": "4",
  "description": "Case studies of start-ups, strategic technology management, practice in use of industrial decision-making tools, and speakers from successful firms combined with experience in making management decisions dynamically in a competitive computer-simulated enterprise. Field study of ongoing processes in a local high technology company. Priority enrollment given to engineering majors.",
  "prerequisite": null
 },
 {
  "code": "ENG 203",
  "title": "Applied Innovations",
  "unit": "4",
  "description": "Course includes the examination of business plans developed by early stage technology businesses. Students expected to work on the development of business plans for real, innovative business organizations. Will explore all of the business research and analysis that needs to be undertaken in order to develop a complete business plan. Completion of ENG 201 or ENG 202 preferred.",
  "prerequisite": null
 },
 {
  "code": "ENG 207",
  "title": "Corporate Entrepreneurship for Global Competitiveness",
  "unit": "4",
  "description": "Explore corporate entrepreneurship and innovation process using the medical device industry as a case example. This highly dynamic industry segment provides an approachable model to analyze corporate strategies and behaviors that affect overall competitiveness.",
  "prerequisite": "ENG 201, ENG 202, ENG 203, or consent of the instructor."
 },
 {
  "code": "ENG 208",
  "title": "Basics of Entrepreneurism and Technology Commercialization",
  "unit": "4",
  "description": "Learn basics of start-up through a series of lectures, workshops, and assignments. Students will learn to effectively communicate the values of their ideas to investors and partners. Learn to validate market potential of a technology.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "ENG 210",
  "title": "Systems Engineering",
  "unit": "4",
  "description": "This course examines the complexity of integrating components of product engineering, marketing and client requirements into a single engineering system. Case studies explore successes and failures in engineered systems and how to detect and avoid potential failures using strong leadership skills, systemic analysis and thinking.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "ENG 211",
  "title": "Engineering Leadership in Academia",
  "unit": "4",
  "description": "This course is designed to teach leadership in teaching and learning at the college/university level. Students will learn through readings on engineering leadership, proposal development, ethics, and cognitive science, and thorough practical experience writing and developing course and project development plans.",
  "prerequisite": "graduate standing."
 }
]