[
 {
  "code": "ESYS 10",
  "title": "Introduction to Environmental Systems",
  "unit": "4",
  "discription": "This course explores the interdisciplinary character of environmental issues through an examination of a particular topic (climate change, for example) from numerous disciplinary perspectives (e.g., biology, chemistry, physics, political science, and economics).",
  "prerequsite": "none. (W)"
 },
 {
  "code": "ESYS 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "discription": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate college, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students with preference given to entering first-year students.",
  "prerequsite": null
 },
 {
  "code": "ESYS 90",
  "title": "Perspectives on Environmental Issues",
  "unit": "1",
  "discription": "Provides an introduction to environmental systems. Faculty members from departments in the natural sciences, geosciences, and social sciences will offer perspectives in these areas. (F)",
  "prerequsite": null
 },
 {
  "code": "ESYS 101",
  "title": "Environmental Biology",
  "unit": "4",
  "discription": "This course surveys biochemical and physiological processes governing the relationship between organisms and their environments, such as those involved in element cycling and cellular homeostasis. The course introduces biological perspectives on human activities ranging from antibiotic use to genetic engineering.",
  "prerequsite": "BILD 1 or 2 or equivalent, or consent of instructor. (F)"
 },
 {
  "code": "ESYS 102",
  "title": "The Solid and Fluid Earth",
  "unit": "4",
  "discription": "Earth's dynamic physical systems interact in complex ways with profound impact on our environment. Processes such as volcanism and weathering enable geochemical exchange between solid and fluid (ocean and atmosphere) systems. Sea level and climate changes interface with tectonic processes.",
  "prerequsite": "MATH 10A or MATH 20A, CHEM 6A, PHYS 1A or 2A, or consent of instructor. (W)"
 },
 {
  "code": "ESYS 103",
  "title": "Environmental Challenges: Science and Solutions",
  "unit": "4",
  "discription": "This course explores the impacts of human, social, economic, and industrial activity on the environment. It highlights the central roles in ensuring sustainable development played by market forces, technological innovation, and government regulation on local, national, and global scales.",
  "prerequsite": "MATH 10A-C or MATH 20B or consent of instructor. (S)"
 },
 {
  "code": "ESYS 187A",
  "title": "Senior Internship Project I",
  "unit": "4",
  "discription": "The first quarter of the three-quarter senior project sequence. In this course, the student works in a self-selected internship (off-campus, research project or on-campus project), focused on an interdisciplinary environmental problem or research topic.",
  "prerequsite": "ESYS 103."
 },
 {
  "code": "ESYS 187B",
  "title": "Senior Internship Project II",
  "unit": "4",
  "discription": "This is the second quarter of the three-quarter senior project sequence. In this course, the student continues work on their self-selected internship (off-campus, research project or on-campus project), focused around an interdisciplinary environmental problem or research topic. A final evaluation of their internship signed by the student, an internship supervisor, and a faculty mentor is required at the end of the course.",
  "prerequsite": "ESYS 187A."
 },
 {
  "code": "ESYS 187C",
  "title": "Environmental Systems Senior Seminar",
  "unit": "4",
  "discription": "This is the third quarter of the three-quarter senior project sequence. This seminar provides a venue for students to develop a written report and a poster on their internship results. Students present their posters in the ESYS symposium at the end of the quarter.",
  "prerequsite": "ESYS 187B."
 },
 {
  "code": "ESYS 190A",
  "title": "Senior Project",
  "unit": "8",
  "discription": "All majors are required to complete an integrative Senior Project in their senior year. The Senior Project is designed by the student to focus on an interdisciplinary environmental problem or research topic and is developed either individually or as part of a team over two quarters. Appropriate topics could include biodiversity conservation, environmental health, and/or global change. An important component of the Senior Project is an off-campus or laboratory internship.",
  "prerequsite": "ESYS 103 and upper-division standing, department approval, majors only. (F,W)"
 },
 {
  "code": "ESYS 190B",
  "title": "Environmental Systems Senior Seminar",
  "unit": "4",
  "discription": "The seminar provides a venue for the development, presentation, and evaluation of the Environmental Systems Integrative Project. The seminar will include work on research methods as well as paper presentation skills.",
  "prerequsite": "Completion of ESYS 190A or ESYS 190A(W) sequence, senior standing and majors only. (S)"
 },
 {
  "code": "ESYS 199",
  "title": "Independent Study",
  "unit": "2-4",
  "discription": "Individually guided readings or projects in the area of environmental systems.",
  "prerequsite": null
 }
]