[
 {
  "code": "ETHN 1",
  "title": "Introduction to Ethnic Studies: Land and Labor",
  "unit": "4",
  "discription": "This course examines key historical events and debates in the field that center around land and labor, including disputes about territory and natural resources, slavery and other forms of unfree labor, labor migration and recruitment, and US and transnational borders. Students may not receive credit for both ETHN 1A and ETHN 1.",
  "prerequsite": null
 },
 {
  "code": "ETHN 2",
  "title": "Introduction to Ethnic Studies: Circulations of Difference",
  "unit": "4",
  "discription": "Focusing on historical and contemporary migration and the circulation of commodities, knowledge, bodies, and culture, this course looks at how racial formation in the United States and transnationally is shaped and contested by such movements. Students may not receive credit for both ETHN 1B and ETHN 2.",
  "prerequsite": null
 },
 {
  "code": "ETHN 3",
  "title": "Introduction to Ethnic Studies: Making Culture",
  "unit": "4",
  "discription": "Through examining the historical and contemporary politics of representation in both popular and community-focused media, film, art, music, and literature, this course tracks racial formation through studying the sphere of cultural production, consumption, and contestation. Students may not receive credit for both ETHN 1C and ETHN 3.",
  "prerequsite": null
 },
 {
  "code": "ETHN 20",
  "title": "Introduction to Asian American Studies",
  "unit": "4",
  "discription": "This course introduces students to key issues in Asian American lives, with emphasis on the global historical context of migration; changing ethnic and racial consciousness; economic, social, and political status; cultural production; and family and gender relations.",
  "prerequsite": null
 },
 {
  "code": "ETHN 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "discription": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequsite": null
 },
 {
  "code": "ETHN 97",
  "title": "Field Studies in Racial and Ethnic Communities",
  "unit": "1-4",
  "discription": "Supervised community fieldwork on topics of importance to racial and ethnic communities in the San Diego County region. Regular individual meetings with faculty sponsor and final project and/or written report are required.",
  "prerequsite": "lower-division standing, completion of at least thirty units of undergraduate study at UC San Diego, minimum 3.0 GPA at UC San Diego, consent of instructor, and completed and approved Special Studies form."
 },
 {
  "code": "ETHN 98",
  "title": "Directed Group Studies",
  "unit": "1-4",
  "discription": "Directed group study on a topic or in a field not included in the regular department curriculum by special arrangement with a faculty member.",
  "prerequsite": "lower-division standing, completion of at least thirty units of undergraduate study at UC San Diego, minimum 3.0 GPA at UC San Diego, consent of instructor, and completed and approved Special Studies form."
 },
 {
  "code": "ETHN 99",
  "title": "Independent Study",
  "unit": "1-4",
  "discription": "Directed study on a topic or in a field not included in the regular department curriculum by special arrangement with a faculty member.",
  "prerequsite": "lower-division standing, completion of at least thirty units of undergraduate study at UC San Diego, minimum 3.0 GPA at UC San Diego, consent of instructor, and completed and approved Special Studies form."
 },
 {
  "code": "ETHN 100A",
  "title": "Ethnic Studies: Theoretical Approaches",
  "unit": "4",
  "discription": "An advanced survey of key issues, themes, and debates in the field of critical ethnic studies focusing on the connection between race and social structures. Students will use diverse theoretical frameworks to identify and interpret contemporary and historical social problems.",
  "prerequsite": "ETHN 1 or ETHN 2 or ETHN 3, ethnic studies majors or minors, or consent of instructor."
 },
 {
  "code": "ETHN 100B",
  "title": "Interdisciplinary Methodologies",
  "unit": "4",
  "discription": "An introduction to interdisciplinary research methodologies in critical ethnic studies. By developing a critical analysis of the politics of knowledge production, students will learn to identify different methodological approaches in the field and to evaluate their use in practical application.",
  "prerequsite": "ETHN 100A, ethnic studies major or minor, or consent of instructor."
 },
 {
  "code": "ETHN 100C",
  "title": "Social Justice Praxis",
  "unit": "4",
  "discription": "An intensive capstone experience for ethnic studies majors, this course combines an advanced exploration of praxis-based approaches to social justice with practicum-based independent campus, community, creative, or research projects.",
  "prerequsite": "ETHN 100A and ETHN 100B, ethnic studies major or minor, or consent of instructor."
 },
 {
  "code": "ETHN 100H",
  "title": "Honors Research Design",
  "unit": "4",
  "discription": "This discussion-based course will focus on the application of advanced research methods to the design of extensive, independent research-based projects.",
  "prerequsite": "ETHN 100A and ETHN 100B. Department approval required."
 },
 {
  "code": "ETHN 101",
  "title": "Ethnic Images in Film",
  "unit": "4",
  "discription": "An upper-division lecture course studying representations of ethnicity in the American cinema. Topics include ethnic images as narrative devices, the social implications of ethnic images, and the role of film in shaping and reflecting societal power relations.",
  "prerequsite": null
 },
 {
  "code": "ETHN 102",
  "title": "Science and Technology in Society: Race/Gender/Class",
  "unit": "4",
  "discription": "This course examines the role of science and technology in forming popular conceptions of race, gender and class, and vice versa. We also consider how some populations benefit from the results of experimentation while others come to be its subjects.",
  "prerequsite": null
 },
 {
  "code": "ETHN 103",
  "title": "Environmental Racism",
  "unit": "4",
  "discription": "This course will examine the concept of environmental racism, the empirical evidence of its widespread existence, and the efforts by government, residents, workers, and activists to combat it. We will examine those forces that create environmental injustices in order to understand its causes as well as its consequences. Students are expected to learn and apply several concepts and social scientific theories to the course material.",
  "prerequsite": null
 },
 {
  "code": "ETHN 103A",
  "title": "The United States and the Pacific World",
  "unit": "4",
  "discription": "History of the United States in the Pacific, with an emphasis on Hawai'i, Guam, the Mariana Islands, and the Marshall Islands, from the nineteenth century to the present. Topics include colonialism and imperialism, cultural representations, indigenous knowledge and sovereignty, militarism, tourism, and environmentalism. Students will not receive credit for both HIUS 103 and ETHN 103A.",
  "prerequsite": null
 },
 {
  "code": "ETHN 104",
  "title": "Race, Space, and Segregation",
  "unit": "4",
  "discription": "Through in-depth studies of housing segregation, urban renewal and displacement, neighborhood race effects, and the location of hazards and amenities, this course examines how space becomes racialized and how race becomes spatialized in the contemporary United States.",
  "prerequsite": null
 },
 {
  "code": "ETHN 105",
  "title": "Ethnic Diversity and the City",
  "unit": "4",
  "discription": "(Cross-listed with USP 104.) This course will examine the city as a crucible of ethnic identity, exploring both the racial and ethnic dimensions of urban life in the United States from the Civil War to the present.",
  "prerequsite": null
 },
 {
  "code": "ETHN 106",
  "title": "Life, Death, and the Human",
  "unit": "4",
  "discription": "Using interdisciplinary approaches, this course examines some of the contexts in which the conditions of life and death become sites of political, economic, and cultural significance, and how categories of difference impact access to the protections of “humanity.”",
  "prerequsite": null
 },
 {
  "code": "ETHN 107",
  "title": "Fieldwork in Racial and Ethnic Communities",
  "unit": "4",
  "discription": "(Cross-listed with USP 130.) This is a research course examining social, economic, and political issues in ethnic and racial communities through a variety of research methods that may include interviews and archival, library, and historical research.",
  "prerequsite": null
 },
 {
  "code": "ETHN 108",
  "title": "Race, Culture, and Social Change",
  "unit": "4",
  "discription": "(Cross-listed with MUS 151.) Aggrieved groups often generate distinctive forms of cultural expression by turning negative ascription into positive affirmation and by transforming segregation into congregation. This course examines the role of cultural expressions in struggles for social change by these communities inside and outside the United States.",
  "prerequsite": null
 },
 {
  "code": "ETHN 109",
  "title": "Race and Social Movements",
  "unit": "4",
  "discription": "This course explores collective mobilizations for resources, recognition, and power by members of aggrieved racialized groups, past and present. Emphasis will be placed on the conditions that generate collective movements, the strategies and ideologies that these movements have developed, and on the prospect for collective mobilization for change within aggrieved communities in the present and future.",
  "prerequsite": null
 },
 {
  "code": "ETHN 110",
  "title": "Cultural Worldviews of Indigenous America",
  "unit": "4",
  "discription": "Places Native Americans/indigenous people’s ways of living, knowing, and understanding the world in relation to settler-immigrant societies in North America. Students gain analytical tools for thinking about world views through themes of cosmology, land, kinship, and identity formation.",
  "prerequsite": null
 },
 {
  "code": "ETHN 111",
  "title": "Native American Literature",
  "unit": "4",
  "discription": "This course analyzes Native American written and oral traditions. Students will read chronicles and commentaries on published texts, historic speeches, trickster narratives, oratorical and prophetic tribal epics, and will delve into the methodological problems posed by tribal literature in translation.",
  "prerequsite": null
 },
 {
  "code": "ETHN 112A",
  "title": "History of Native Americans in the United States I",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 108A.) This course examines the history of Native Americans in the United States, with emphasis on the lifeways, mores, warfare, cultural adaptation, and relations with the European colonial powers and the emerging United States until 1870.",
  "prerequsite": null
 },
 {
  "code": "ETHN 112B",
  "title": "History of Native Americans in the United States II",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 108B.) This course examines the history of Native Americans in the United States, with emphasis on the lifeways, mores, warfare, cultural adaptation, and relations with the United States from 1870 to the present.",
  "prerequsite": null
 },
 {
  "code": "ETHN 112C",
  "title": "California Native American History",
  "unit": "4",
  "discription": "An introduction to California Native (Indian) history, and how it has shaped people, both Indian and non-Indian, and their possible futures. The course follows four interconnecting themes: land and people; Spanish colonization; dispossession and subordination related to the creation of California; and issues of \"survivance.\"",
  "prerequsite": null
 },
 {
  "code": "ETHN 113",
  "title": "Decolonizing Education",
  "unit": "4",
  "discription": "This course considers decolonial theories of education in relation to classroom pedagogy, focusing on US urban high schools.",
  "prerequsite": null
 },
 {
  "code": "ETHN 114A",
  "title": "Representing Native America",
  "unit": "4",
  "discription": "History and theory: Introduction to the history and theory of museum representation of American Indians in order to explore its relation to colonialism and decolonization. Study of Plains Indian drawings from 1860 to 1890 will allow the class to create new approaches to designing a museum exhibition.",
  "prerequsite": null
 },
 {
  "code": "ETHN 114B",
  "title": "Representing Native America—Exhibition Design",
  "unit": "4",
  "discription": "The class will work in teams to design all aspects of an actual museum exhibition of Plains Indian drawings from 1860 to 1890, turning theory into practice. In some quarters, the exhibition will be installed in a San Diego museum directly after completion of the course.",
  "prerequsite": "ETHN 114A."
 },
 {
  "code": "ETHN 115",
  "title": "Monsters, Orphans, and Robots",
  "unit": "4",
  "discription": "This course considers dark agencies, queer threats, and how they seep through cracks in containers meant to disable them. This class will be writing intensive with an artistic production component. Recommended: ETHN 100 is recommended prior to enrollment in this course.",
  "prerequsite": null
 },
 {
  "code": "ETHN 116",
  "title": "The United States-Mexico Border in Comparative Perspective",
  "unit": "4",
  "discription": "This course critically explores the US-Mexico frontier and the social-cultural issues on both sides of the international demarcation. Social-historical and political-economic patterns illuminate border life, ethnic identity, social diversity, and cultural expression. Border ethnography is complemented by film and music.",
  "prerequsite": null
 },
 {
  "code": "ETHN 117",
  "title": "Organic Social Movements",
  "unit": "4",
  "discription": "This course focuses on local responses to global change and social disruption through the examination of organic movements in colonial and racialized contexts around the world.",
  "prerequsite": null
 },
 {
  "code": "ETHN 118",
  "title": "Contemporary Immigration Issues",
  "unit": "4",
  "discription": "This course examines the diversity of today's immigrants—their social origins and contexts of exit and their adaptation experiences and contexts of incorporation.",
  "prerequsite": null
 },
 {
  "code": "ETHN 119",
  "title": "Race in the Americas",
  "unit": "4",
  "discription": "This course explores the genesis, evolution, and contradictions of racially heterogeneous societies in the Americas, from European conquest to the present. Topics: the social history of Native Americans, blacks, and Asians, their interactions with European settlers, and racial, sexual, and class divisions.",
  "prerequsite": null
 },
 {
  "code": "ETHN 120",
  "title": "Race and Performance: The Politics of Popular Culture",
  "unit": "4",
  "discription": "This course explores how racial categories and ideologies have been constructed through performance and displays of the body in the United States and other sites. Racialized performances, whether self-displays or coerced displays, such as world's fairs, museums, minstrelsy, film, ethnography, and tourist performances are considered.",
  "prerequsite": null
 },
 {
  "code": "ETHN 120D",
  "title": "Race and Oral History in San Diego",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 120D.) This course examines the history of racial and ethnic communities in San Diego. Drawing from historical research and interdisciplinary scholarship, we will explore how race impacted the history and development of San Diego and how \"ordinary\" folk made sense of their racial identity and experiences. Toward these ends, students will conduct oral history and community-based research, develop public and digital humanities skills, and preserve a collection of oral histories for future scholarship. Concurrent enrollment in an Academic Internship Program course strongly recommended. Students may not receive credit for HIUS 120D and ETHN 120D.",
  "prerequsite": null
 },
 {
  "code": "ETHN 121",
  "title": "Contemporary Asian American History",
  "unit": "4",
  "discription": "The course will study changes in Asian American communities as a result of renewed immigration since 1965; the influx of refugees from Vietnam, Kampuchea, and Laos; the impact of contemporary social movements on Asian Americans' current economic, social, and political status.",
  "prerequsite": null
 },
 {
  "code": "ETHN 122",
  "title": "Asian American Culture and Identity",
  "unit": "4",
  "discription": "A survey of Asian American cultural expressions in literature, art, and music to understand the social experiences that helped forge Asian American identity. Topics: culture conflict, media portrayals, assimilation pressures, the model minority myth, and interethnic and class relations.",
  "prerequsite": null
 },
 {
  "code": "ETHN 123",
  "title": "Asian American Politics",
  "unit": "4",
  "discription": "This course will examine the development of Asian American politics by studying the historical and contemporary factors, such as political and economic exclusion, that have contributed to the importance and complexity of ethnicity as a mobilizing force in politics.",
  "prerequsite": null
 },
 {
  "code": "ETHN 124",
  "title": "Asian American Literature",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 181.) Selected topics in the literature by men and women of Asian descent who live and write in the United States. May be repeated for credit when topics vary.",
  "prerequsite": null
 },
 {
  "code": "ETHN 125",
  "title": "Asian American History",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 124.) Explore how Asian Americans were involved in the political, economic and cultural formation of United States society. Topics include migration; labor systems; gender, sexuality and social organization; racial ideologies and anti-Asian movements; and nationalism and debates over citizenship.",
  "prerequsite": null
 },
 {
  "code": "ETHN 127",
  "title": "Sexuality and Nation",
  "unit": "4",
  "discription": "(Cross-listed with CGS 112.) This course explores the nexus of sex, race, ethnicity, gender, and nation and considers their influence on identity, sexuality, migration, movement, and borders and other social, cultural, and political issues that these constructs affect.",
  "prerequsite": null
 },
 {
  "code": "ETHN 128",
  "title": "Hip-Hop: The Politics of Culture",
  "unit": "4",
  "discription": "(Cross-listed with MUS 152.) Examination of hip-hop's technology, lyrics, and dance and its influences in graffiti, film, music video, fiction, advertising, gender, corporate investment, government, and censorship with a critical focus on race, gender, and popular culture and the politics of creative expression.",
  "prerequsite": null
 },
 {
  "code": "ETHN 129",
  "title": "Asian and Latina Immigrant Workers in the Global Economy",
  "unit": "4",
  "discription": "(Cross-listed with USP 135.) This course will explore the social, political, and economic implications of global economic restructuring, immigration policies, and welfare reform on Asian and Latina immigrant women in the United States. We will critically examine these larger social forces from the perspectives of Latina and Asian immigrant women workers, incorporating theories of race, class, and gender to provide a careful reading of the experiences of immigrant women on the global assembly line.",
  "prerequsite": null
 },
 {
  "code": "ETHN 130",
  "title": "Social and Economic History of the Southwest I",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 158.) This course examines the history of the Spanish and Mexican Borderlands (what became the US Southwest) from roughly 1400 to the end of the Mexican-American War in 1848, focusing specifically on the area's social, cultural, and political development.",
  "prerequsite": null
 },
 {
  "code": "ETHN 131",
  "title": "Social and Economic History of the Southwest II",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 159.) This course examines the history of the American Southwest from the Mexican-American War in 1846–48 to the present, focusing on immigration, racial and ethnic conflict, and the growth of Chicano national identity.",
  "prerequsite": null
 },
 {
  "code": "ETHN 132",
  "title": "Chicano Dramatic Literature",
  "unit": "4",
  "discription": "(Cross-listed with TDHT 110.) Focusing on the contemporary evolution of Chicano dramatic literature, the course will analyze playwrights and theatre groups that express the Chicano experience in the United States, examining relevant actors, plays, and documentaries for their contributions to the developing Chicano theatre movement.",
  "prerequsite": null
 },
 {
  "code": "ETHN 133",
  "title": "Hispanic American Dramatic Literature",
  "unit": "4",
  "discription": "(Cross-listed with TDHT 111.) This course examines the plays of leading Cuban American, Puerto Rican, and Chicano playwrights in an effort to understand the experiences of these Hispanic American groups in the United States.",
  "prerequsite": null
 },
 {
  "code": "ETHN 134",
  "title": "Immigration and Ethnicity in Modern American Society",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 180.) Comparative study of immigration and ethnic group formation in the United States from 1880 to the present. Topics include immigrant adaptation, competing theories about the experiences of different ethnic groups, and the persistence of ethnic attachments in modern American society.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "ETHN 135A",
  "title": "Early Latino/a-Chicano/a Cultural Production: 1848 to 1960",
  "unit": "4",
  "discription": "(Cross-listed with LTSP 150A.) Cross-disciplinary study of nineteenth- and early twentieth-century Latino/a-Chicano/a literature, folklore, music, testimonio, or other cultural practices. Specific periods covered will fall between the immediate aftermath of the Treaty of Guadalupe Hidalgo to the Cuban revolution. May be taken for credit two times.",
  "prerequsite": "LTSP 50A or LTSP 50B or LTSP 50C, or consent of instructor."
 },
 {
  "code": "ETHN 136",
  "title": "The Science and Critical Analysis of Environmental Justice",
  "unit": "4",
  "discription": "﻿(Cross-listed with SIO 114.) Introduction to the scientific basis and critical analysis of environmental justice, with an emphasis on case studies, activism, and community engagement. This course will prepare students to critique and develop scientific models, research designs, and measurements consistent with environmental justice. Students may not receive credit for both ETHN 136 and SIO 114.",
  "prerequsite": null
 },
 {
  "code": "ETHN 137",
  "title": "Latina Issues and Cultural Production",
  "unit": "4",
  "discription": "(Cross-listed with CGS 137.) This course will focus on the intersection of labor, class, race, ethnicity, gender, sexuality, and immigration in Latina cultural production. Examined from a socioeconomic, feminist, and cultural perspective, class readings will allow for historically grounded analyses of these issues. Course may be repeated as topics vary.",
  "prerequsite": null
 },
 {
  "code": "ETHN 139",
  "title": "Chicano Literature in English",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 180.) Introduction to the literature in English by the Chicano population, the men and women of Mexican descent who live and write in the United States. Primary focus on the contemporary period.",
  "prerequsite": null
 },
 {
  "code": "ETHN 140",
  "title": "Comparative Refugee Communities from Vietnam, Laos, and Cambodia",
  "unit": "4",
  "discription": "This course critically examines the impact of the Vietnam War on refugees from Vietnam, Laos, and Cambodia. Focusing on everyday refugee life, it pays particular attention to how the refugees have created alternative memories, epistemologies, and lifeworlds.",
  "prerequsite": null
 },
 {
  "code": "ETHN 141",
  "title": "Gandhi in the Modern World: From Civil Rights to the Arab Spring",
  "unit": "4",
  "discription": "Martin Luther King was inspired by Gandhi, but in his own time, Gandhi was as controversial as he was revered. Nonviolence was not widely accepted as a form of political protest. This course explores Gandhi’s complex legacy of nonviolence for places and peoples embroiled in conflict.",
  "prerequsite": null
 },
 {
  "code": "ETHN 142",
  "title": "Medicine, Race, and the Global Politics of Inequality",
  "unit": "4",
  "discription": "Globalization fosters both the transmission of AIDS, cholera, tuberculosis, and other infectious diseases and gross inequalities in the resources available to prevent and cure them. This course focuses on how race, ethnicity, gender, sexuality, class, and nation both shape and are shaped by the social construction of health and disease worldwide.",
  "prerequsite": null
 },
 {
  "code": "ETHN 143",
  "title": "Chicana/o Film and Media Studies",
  "unit": "4",
  "discription": "This course is a historical survey of Chicana and Chicano media from roughly 1950 to the present. The goals of the course include learning about Chicana/o history, politics, and culture through different media and gaining the critical tools to analyze Chicana/o media and media more broadly.",
  "prerequsite": null
 },
 {
  "code": "ETHN 146A",
  "title": "Ensemble",
  "unit": "4",
  "discription": "(Cross-listed with TDAC 120.) An intensive theatre practicum designed to generate theatre created by an ensemble, with particular emphasis upon the analysis of text. Students will explore and analyze scripts and authors. Ensemble segments include black theatre, Chicano theatre, feminist theatre, and commedia dell'arte. May be taken for credit two times.",
  "prerequsite": null
 },
 {
  "code": "ETHN 147",
  "title": "Black Feminisms, Past and Present",
  "unit": "4",
  "discription": "(Cross-listed with CGS 147.) An advanced introduction to historical and contemporary black feminisms in the United States and transnationally. Students will explore the theory and practice of black feminists/womanists and analyze the significance of black feminism to contemporary understandings of race, class, gender, and sexuality.",
  "prerequsite": null
 },
 {
  "code": "ETHN 149",
  "title": "African American History in the Twentieth Century",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 139.) This course examines the transformation of African America across the expanse of the long twentieth century: imperialism, migration, urbanization, desegregation, and deindustrialization. Special emphasis will be placed on issues of culture, international relations, and urban politics.",
  "prerequsite": null
 },
 {
  "code": "ETHN 150",
  "title": "Visuality, Sexuality, and Race",
  "unit": "4",
  "discription": "(Cross-listed with CGS 150.) Examines the role of the visual in power relations; the production of what we \"see\" regarding race and sexuality; the interconnected history of the casta system, plantation slavery, visuality, and contemporary society; decolonial and queer counternarratives to visuality.",
  "prerequsite": null
 },
 {
  "code": "ETHN 151",
  "title": "Ethnic Politics in America",
  "unit": "4",
  "discription": "This course will survey the political effects of immigration, ethnic mobilization, and community building in America, and the contemporary role of ethnicity in politics and intergroup relations.",
  "prerequsite": null
 },
 {
  "code": "ETHN 152",
  "title": "Law and Civil Rights",
  "unit": "4",
  "discription": "In this course, students explore the relationship between race, class, and law as it applies to civil rights both in a historical and a contemporary context. Topics include racism and the law, history of the Fourteenth Amendment, equal protection, school desegregation, and affirmative action.",
  "prerequsite": null
 },
 {
  "code": "ETHN 153",
  "title": "Citizenship and Civil Rights in the Twentieth Century",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 136.) This course traces the history of the institution of United States citizenship in the last century, tracing changing notions of racial, cultural, and gender differences, the evolution of the civil rights struggle, and changes in laws governing citizenship and access to rights.",
  "prerequsite": null
 },
 {
  "code": "ETHN 154",
  "title": "History of Mexican America",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 113.) This course explores the history of the largest minority population in the United States, focusing on the legacies of the Mexican War, the history of Mexican immigration and US-Mexican relations, and the struggle for citizenship and civil rights.",
  "prerequsite": null
 },
 {
  "code": "ETHN 155",
  "title": "US Militarism",
  "unit": "4",
  "discription": "This course considers rationales for and responses to American military expansion as well as its social, environmental, and cultural consequences. We will examine racialized, gendered, and sexualized aspects of militarized institutions and practices, including militarized colonialism, tourism, and sex work.",
  "prerequsite": "upper-division standing or instructor approval."
 },
 {
  "code": "ETHN 155GS",
  "title": "Critical Perspectives on the Vietnam War",
  "unit": "4",
  "discription": "This course examines the impact of the Vietnam War on three populations: Americans, Vietnamese in Vietnam, and Viet Kieu (overseas Vietnamese). We will supplement scholarly texts on the war with films, literature, and visits to war museums and monuments. Program or materials fees may apply.",
  "prerequsite": "students must apply and be accepted into the Global Seminars program."
 },
 {
  "code": "ETHN 157",
  "title": "Madness and Urbanization",
  "unit": "4",
  "discription": "(Cross-listed with USP 149.) This course will provide a historical and theoretical orientation for contemporary studies of the experience of mental illness and mental health-care policy in the American city, with critical attention to racial and ethnic disparities in diagnosis, treatment, and outcomes.",
  "prerequsite": null
 },
 {
  "code": "ETHN 158",
  "title": "Native American Intellectuals in the Twentieth Century",
  "unit": "4",
  "discription": "This course examines Native American intellectuals’ work. It provides a broad historical perspective on the development of twentieth-century Native American political thinking and discusses the recurring issues, problems, and themes inherent to Indian-white relations, as seen from Indian perspectives.",
  "prerequsite": null
 },
 {
  "code": "ETHN 159",
  "title": "Topics in African American History",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 183.) A colloquium dealing with special topics in the history of people of African descent in the United States. Themes will vary from quarter to quarter. Requirements will vary for undergraduate, MA, and PhD students. Graduate students will be required to submit a more substantial piece of work.",
  "prerequsite": null
 },
 {
  "code": "ETHN 160",
  "title": "Global Indigenous Studies",
  "unit": "4",
  "discription": "Focusing on transregional relationships to land and decolonization in the Pacific, Caribbean, and the Americas, this course is a comparative study of cultural and political phenomena that shape indigenous communities globally. We will examine enduring legacies of colonialism, nationalism, and Western normativities, and explore indigenous activism within the decolonial movement.",
  "prerequsite": null
 },
 {
  "code": "ETHN 162",
  "title": "Practicum in California Tribal Law and Journalism",
  "unit": "4",
  "discription": "Work with California native tribal groups, leaders, and members to identify common, pressing questions surrounding Indian law. In partnership with legal experts, develop and disseminate new media programs and useful documents accessible to native communities throughout California.",
  "prerequsite": null
 },
 {
  "code": "ETHN 163E",
  "title": "Decolonial Theory",
  "unit": "4",
  "discription": "Decolonial Theory will focus on historical and contemporary intellectual work produced by activists from colonized regions of the world. This course will be international in scope, but attentive to local struggles.",
  "prerequsite": null
 },
 {
  "code": "ETHN 163F",
  "title": "Playing Indian: Native American and First Nations Cinema",
  "unit": "4",
  "discription": "﻿(Cross-listed with TDGE 131.) This course examines recent movies by Native American/First Nations artists that labor to deconstruct and critique reductive stereotypes about America’s First Peoples in Hollywood cinema. Carving spaces of \"visual sovereignty\" (Raheja), these films propose complex narratives and characterizations of indigeneity. Students may not receive credit for TDGE 131 and ETHN 163F.",
  "prerequsite": null
 },
 {
  "code": "ETHN 163G",
  "title": "Indigenous Theatre and Performance",
  "unit": "4",
  "discription": "﻿(Cross-listed with TDHT 120.) This theoretical and embodied course examines a selection of indigenous plays and performances (dance, hip hop) and helps students develop the critical vocabulary and contextual knowledge necessary to productively engage with the political and artistic interventions performed by these works. No prior knowledge in theatre history is needed. Students may not receive credit for TDHT 120 and ETHN 163G.",
  "prerequsite": null
 },
 {
  "code": "ETHN 163I",
  "title": "Asian American Histography",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 177.) This course introduces students to the field of Asian American history, with an emphasis on historiographical shifts and debates. It includes a wide range of topics and methodologies that cross disciplinary boundaries. Fulfills the race, ethnicity, and migration and global/transnational field requirements for the history major. Students may not receive credit for both ETHN 163I and HIUS 177. May be coscheduled with HIUS 277 and ETHN 273.",
  "prerequsite": null
 },
 {
  "code": "ETHN 163J",
  "title": "Asian American Social Movements",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 125.) This course introduces students to the history of Asian American social movements from the late-nineteenth century to the present, with an emphasis on inter-ethnic, cross-racial, and transnational practices. Topics include immigration reform, antiwar and anticolonial movements, redress, hate crimes, and police brutality. Students may not receive credit for HIUS 125 and ETHN 163J.",
  "prerequsite": null
 },
 {
  "code": "ETHN 164",
  "title": "African Americans and the Mass Media",
  "unit": "4",
  "discription": "(Cross-listed with MUS 153.) This course will examine the media representations of African Americans from slavery through the twentieth century. Attention will be paid to the emergence and transmission of enduring stereotypes, and their relationship to changing social, political, and economic frameworks in the United States. The course will also consider African Americans' responses to and interpretations of these mediated images.",
  "prerequsite": null
 },
 {
  "code": "ETHN 165",
  "title": "Gender and Sexuality in African American Communities",
  "unit": "4",
  "discription": "(Cross-listed with CGS 165.) This course will investigate the changing constructions of sex, gender, and sexuality in African American communities defined by historical period, region, and class. Topics will include the sexual division of labor, myths of black sexuality, the rise of black feminism, black masculinity, and queer politics.",
  "prerequsite": null
 },
 {
  "code": "ETHN 166",
  "title": "Arab/Muslim American Identity and Culture",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 179.) This class explores (self) representations of Muslim and Arab Americans in US popular culture with a focus on the twentieth and twenty-first centuries. Topics include the racing of religion, \"the war on terror\" in the media, feminism and Islam, immigration, race, and citizenship. May be repeated for credit three times when content varies.",
  "prerequsite": null
 },
 {
  "code": "ETHN 167",
  "title": "Muslim Identity in America",
  "unit": "4",
  "discription": "This course is an introduction to the study of Muslims in the U.S. It examines the ways in which questions of race, gender, and white settler colonial plantation state practices have shaped Muslim lives, both historically and in present times. Topics include the arrival of African Muslims in slave ships, growing Latinx Muslim presence, South Asian and Arab-American Muslims, immigrant-indigenous-black Muslim debates, media representation, resistance movements, and questions of national belonging. May be taken for credit up to two times when content varies.",
  "prerequsite": null
 },
 {
  "code": "ETHN 168",
  "title": "Comparative Ethnic Literature",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 178.) A lecture-discussion course that juxtaposes the experience of two or more US ethnic groups and examines their relationship with the dominant culture. Students will analyze a variety of texts representing the history of ethnicity in this country. Topics will vary.",
  "prerequsite": null
 },
 {
  "code": "ETHN 169",
  "title": "Origins of the Atlantic World, c.1450–1650",
  "unit": "4",
  "discription": "An examination of interactions among the peoples of western Europe, Africa, and the Americas that transformed the Atlantic basin into an interconnected “Atlantic World.” Topics will include maritime technology and the European Age of Discovery, colonization in the Americas, the beginnings of the transatlantic slave trade, and early development of plantation slavery in the New World. Students may not receive credit for both ETHN 170A and 169.",
  "prerequsite": null
 },
 {
  "code": "ETHN 170",
  "title": "Slavery and the Atlantic World",
  "unit": "4",
  "discription": "The development of the Atlantic slave trade and the spread of racial slavery in the Americas before 1800. Explores the diversity of slave labor in the Americas and the different slave cultures African Americans produced under the constraints of slavery. Students may not receive credit for both ETHN 170 and 170B.",
  "prerequsite": null
 },
 {
  "code": "ETHN 172",
  "title": "Afro-American Prose",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 183.) Students will analyze and discuss the novel, the personal narrative, and other prose genres, with particular emphasis on the developing characters of Afro-American narrative and the cultural and social circumstances that influence their development.",
  "prerequsite": null
 },
 {
  "code": "ETHN 173GS",
  "title": "Gender, Sexuality, and War",
  "unit": "4",
  "discription": "This course examines the effects of war and militarism on women’s lives, focusing in particular on the experiences of Vietnamese women during and in the aftermath of the Vietnam War. Program or materials fees may apply.",
  "prerequsite": "students must apply and be accepted into the Global Seminars program."
 },
 {
  "code": "ETHN 174",
  "title": "Themes in Afro-American Literature",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 185.) This course focuses on the influence of slavery upon African American writers. Our concern is not upon what slavery was but upon what it is within the works and what these texts reveal about themselves, their authors, and their audiences.",
  "prerequsite": null
 },
 {
  "code": "ETHN 175",
  "title": "Literature of the Harlem Renaissance",
  "unit": "4",
  "discription": "(Cross-listed with LTEN 186.) The Harlem Renaissance (1917–39) focuses on the emergence of the “New Negro” and the impact of this concept on black literature, art, and music. Writers studied include Claude McKay, Zora N. Hurston, and Langston Hughes. Special emphasis on new themes and forms.",
  "prerequsite": null
 },
 {
  "code": "ETHN 177",
  "title": "Race, Sound, and Music",
  "unit": "4",
  "discription": "This course considers the history of listening to the music of the world in Western culture. We will critically examine how the history of perception directs us to listen for familiar and different sounds in music. No musical training required.",
  "prerequsite": null
 },
 {
  "code": "ETHN 178",
  "title": "Blues: An Oral Tradition",
  "unit": "4",
  "discription": "(Cross-listed with MUS 126.) This course will examine the development of the blues from its roots in work-songs and the minstrel show to its flowering in the Mississippi Delta to the development of urban blues and the close relationship of the blues with jazz, rhythm and blues, and rock and roll.",
  "prerequsite": null
 },
 {
  "code": "ETHN 179",
  "title": "Discover Jazz",
  "unit": "4",
  "discription": "(Cross-listed with MUS 127.) Offers an introduction to jazz, including important performers and their associated styles and techniques. Explores the often-provocative role jazz has played in American and global society, the diverse perceptions and arguments that have surrounded its production and reception, and how these have been inflected by issues of race, class, gender, and sexuality. Specific topics vary from year to year. May be taken for credit two times. Students may receive a combined total of eight units for MUS 127 and ETHN 179.",
  "prerequsite": null
 },
 {
  "code": "ETHN 182",
  "title": "Race, Gender, and Sexuality in Fantasy and Science Fiction",
  "unit": "4",
  "discription": "This course focuses on race, gender, and sexuality in twentieth- and twenty- first-century fantasy and science fiction. We will study literature, film, music, television, video games, and the internet in order to situate such speculative visions in historical and transmedia contexts.",
  "prerequsite": null
 },
 {
  "code": "ETHN 183",
  "title": "Gender, Race, Ethnicity, and Class",
  "unit": "4",
  "discription": "(Cross-listed with CGS 114.) Gender is often neglected in studies of ethnic/racial politics. This seminar explores the relationship of race, ethnicity, class, and gender by examining the participation of working-class women of color in community politics and how they challenge mainstream political theory.",
  "prerequsite": null
 },
 {
  "code": "ETHN 187",
  "title": "Latinx Sexualities",
  "unit": "4",
  "discription": "(Cross-listed with CGS 187.) The construction and articulation of Latinx sexualities will be explored in this course through interdisciplinary and comparative perspectives. We will discuss how immigration, class, and norms of ethnicity, race, and gender determine the construction, expression, and reframing of Latinx sexualities.",
  "prerequsite": null
 },
 {
  "code": "ETHN 188",
  "title": "African Americans, Religion, and the City",
  "unit": "4",
  "discription": "(Cross-listed with USP 132.) This course details the history of African American migration to urban areas after World War I and World War II and explores the role of religion in their lives as well as the impact that their religious experiences had upon the cities in which they lived.",
  "prerequsite": null
 },
 {
  "code": "ETHN 180",
  "title": "Topics in Mexican American History",
  "unit": "4",
  "discription": "(Cross-listed with HIUS 167.) This colloquium studies the racial representation of Mexican Americans in the United States from the nineteenth century to the present, examining critically the theories and methods of the humanities and social sciences.",
  "prerequsite": null
 },
 {
  "code": "ETHN 184",
  "title": "Black Intellectuals in the Twentieth Century",
  "unit": "4",
  "discription": "An analysis of black cultural and intellectual production since 1895. Course will explore how race and race-consciousness have influenced the dialogue between ideas and social experience; and how other factors—i.e., age, gender, and class—affected scholars' insights.",
  "prerequsite": null
 },
 {
  "code": "ETHN 185",
  "title": "Discourse, Power, and Inequality",
  "unit": "4",
  "discription": "While discourse analysis has transformed numerous disciplines, a gap separates perspectives that envision discourse as practices that construct inequality from approaches that treat discourse as everyday language. This course engages both perspectives critically in analyzing law, medicine, and popular culture.",
  "prerequsite": null
 },
 {
  "code": "ETHN 189",
  "title": "Special Topics in Ethnic Studies",
  "unit": "4",
  "discription": "A reading and discussion course that explores special topics in ethnic studies. Themes will vary from quarter to quarter; therefore, course may be repeated three times as long as topics vary.",
  "prerequsite": null
 },
 {
  "code": "ETHN 190",
  "title": "Research Methods: Studying Racial and Ethnic Communities",
  "unit": "4",
  "discription": "(Cross-listed with USP 129.) The course offers students the basic research methods with which to study ethnic and racial communities. The various topics to be explored include human and physical geography, transportation, employment, economic structure, cultural values, housing, health, education, and intergroup relations.",
  "prerequsite": null
 },
 {
  "code": "ETHN 196H",
  "title": "Honors Thesis",
  "unit": "4",
  "discription": "Independent study to complete an honors thesis under the supervision of a faculty member who serves as thesis adviser.",
  "prerequsite": "ETHN 100A and ETHN 100B and ETHN 100H. Department approval required."
 },
 {
  "code": "ETHN 197",
  "title": "Fieldwork in Racial and Ethnic Communities",
  "unit": "4",
  "discription": "This course comprises supervised community fieldwork on topics of importance to racial and ethnic communities in the greater San Diego area. Regular individual meetings with faculty sponsor and written reports are required. (May be repeated for credit.)",
  "prerequsite": null
 },
 {
  "code": "ETHN 198",
  "title": "Directed Group Studies",
  "unit": "4",
  "discription": "Directed group study on a topic or in a field not included in the regular department curriculum by special arrangement with a faculty member. (May be repeated for credit.)",
  "prerequsite": null
 },
 {
  "code": "ETHN 199",
  "title": "Supervised Independent Study and Research",
  "unit": "4",
  "discription": "Individual research on a topic that leads to the writing of a major paper. (May be repeated for credit.)",
  "prerequsite": null
 },
 {
  "code": "ETHN 200A",
  "title": "Departures: A Genealogy of Critical Racial and Ethnic Studies",
  "unit": "4",
  "discription": "Introduction to critical racial and ethnic studies and how this perspective departs from traditional constructions of race and culture; examination of relevant studies to identify themes, concepts, and formulations that indicate the critical departures that characterize the field.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 200C",
  "title": "Projects (Proseminar): Research in Ethnic Studies",
  "unit": "4",
  "discription": "Students examine research designs presented by faculty and advanced graduate students to study how to conceive of and pose research questions, integrate theoretical and methodological models, and conceptualize their own research project.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 201",
  "title": "Historical Methods and Archives",
  "unit": "4",
  "discription": "This course seeks to develop research skills in historical methods; to understand techniques and tools historians use to create historical narratives using archival and historical sources; and to compare and relate the value of these to ethnic studies research. Students may not receive credit for both ETHN 240 and ETHN 201.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 202",
  "title": "Qualitative Methods/Ethnography",
  "unit": "4",
  "discription": "This course focuses on conceptual and methodological frameworks of ethnography and qualitative inquiry, including research design, grounded theory, the field note journal, participant observation, and interviewing; major themes include the role of indigenous/insider researchers, ethics of involvement, and community collaboration. Students may not receive credit for both ETHN 242 and ETHN 202.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 203",
  "title": "Cultural Studies and Cultural Production",
  "unit": "4",
  "discription": "This course will train students in approaches to interdisciplinary research concerned with power and the production of knowledge, with a focus on conducting multimedia field research, applying discourse analysis, and recognizing forms of data across disciplinary divides. Students may not receive credit for both ETHN 241 and ETHN 203.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 214A",
  "title": "Representing Native America",
  "unit": "4",
  "discription": "This course provides an introduction to the history and theory of museum representation of American Indians in order to explore its relation to colonialism and decolonization. In addition to a wide-ranging look at the complex foundations of systems of representing Indians and Indianness, the course includes a study of a specific art form and history of a specific Native American community that will allow the class to create new approaches to designing a museum exhibition. May be coscheduled with ETHN 114A.",
  "prerequsite": null
 },
 {
  "code": "ETHN 214B",
  "title": "Representing Native America: Exhibition Design",
  "unit": "4",
  "discription": "This course follows the introduction to the history and theory of museum representation of American Indians in order to explore its relation to colonialism and decolonization (part one). Students will develop the proposals they completed in part one of the course, finishing with curatorial briefs for an exhibition of Native American art with a partner museum incorporating new and decolonizing approaches to representation. May be coscheduled with ETHN 114B.",
  "prerequsite": "ETHN 214A or consent of instructor."
 },
 {
  "code": "ETHN 230",
  "title": "Departmental Colloquium",
  "unit": "1",
  "discription": "This course is a forum for the presentation of recent research by guests, faculty, and students. This course may be taken for credit six times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 252",
  "title": "Race, Gender, and Space",
  "unit": "4",
  "discription": "This course offers scholars of race, gender, and sexuality an introduction to spatial theory and geographic methodologies. Particular attention will be given to theories of spatial formation, the interplay of social and spatial mobility and containment, and alternative spatio-political imaginaries.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 255",
  "title": "Race and Psychoanalysis",
  "unit": "4",
  "discription": "This seminar explores the centrality of race to the formation of the discipline of psychoanalysis as well as the relevance of psychoanalysis to the study of race, gender, and sexuality. We will read key texts by Freud, Lacan, and Fanon and follow the development of their ideas in the works of late twentieth and twenty-first century scholars like Spillers, Marriott, Judy, Seshadri-Crooks, Eng, and Mercer. Nongraduate students may enroll with consent of instructor.",
  "prerequsite": null
 },
 {
  "code": "ETHN 256",
  "title": "Gender, Sexuality, and Race",
  "unit": "4",
  "discription": "This course studies the body cross-culturally as the site for the construction of gender, sex, ethnic, and racial identities.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 257A-B",
  "title": "Social Theory",
  "unit": "4-4",
  "discription": "An intensive survey of social and cultural theory, focusing on how constructions of science, language, politics, and social inequality shaped early modernity, romantic nationalism, Marxism, cultural relativity, psychoanalysis, and fin de siècle social thought. The second quarter surveys poststructuralist, postmodern, feminist, subaltern studies, globalization, and other critiques. ETHN 257A is not a prerequisite for ETHN 257B.",
  "prerequsite": null
 },
 {
  "code": "ETHN 260",
  "title": "Transnationalism and Borderlands: The Local and Global",
  "unit": "4",
  "discription": "This course critically reviews the analytical frameworks of transnationalism and borderlands. The goals are to assess traditional and current social science practice on immigration, identity, and community studies, and to understand how diverse peoples engage and participate in global processes.",
  "prerequsite": null
 },
 {
  "code": "ETHN 265",
  "title": "Critical Immigration and Refugee Studies",
  "unit": "4",
  "discription": "This course surveys the field of immigration and refugee studies and introduces students to recent theories and cutting-edge research in the field. Key topics: gender and migration; diaspora and transnationalism; immigration, race, and citizenship; and globalization and immigrant labor.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 266",
  "title": "Popular Culture and Pedagogy",
  "unit": "4",
  "discription": "This course examines popular culture as a site of domination and resistance, and pedagogy broadly as (always political) educational projects in a variety of social contexts with a focus on youth popular culture in US urban public schools.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 267",
  "title": "History and Memory",
  "unit": "4",
  "discription": "We analyze how concepts of power and memory are appropriated in diverse narratives: literature, theatre, personal testimonies, monuments, museums, memorials; and examine how mutually constituted processes of remembering/forgetting work to produce official discourses of nationalism, colonialism, violence, and construction of subaltern subjectivities.",
  "prerequsite": null
 },
 {
  "code": "ETHN 268",
  "title": "Theories and Cultures of US Imperialism",
  "unit": "4",
  "discription": "How did the United States become an empire? This course approaches the historical and contemporary problem of the United States as an imperial power through analyses of hierarchies and cultures at home and outside of formal US borders. Nongraduate students may enroll with consent of instructor.",
  "prerequsite": null
 },
 {
  "code": "ETHN 270",
  "title": "Indigenous Epistemologies and their Disruptions",
  "unit": "4",
  "discription": "This seminar will explore indigenous epistemologies, their ontological dimensions, the methodological issues surrounding related research, and their significance in relation to the production of knowledge and the histories, presents, and futures of Native American and Indigenous people.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 275",
  "title": "Marxist Thought",
  "unit": "4",
  "discription": "This seminar examines critical engagements between scholarship from postcolonial, feminist and other radical Marxist traditions. We focus on philosophical and political debates stemming from issues of race and gender, tracing them in Marx’s texts and their historical contexts.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 280",
  "title": "Black Thought: Roots and Routes",
  "unit": "4",
  "discription": "This course explores major currents in black intellectual history, and some paths less well tread, structured thematically, geographically, and chronologically from the nineteenth century to the present. Students read foundational primary sources and contemporary scholarly studies of African diasporic texts.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "ETHN 287",
  "title": "Ethnography Practicum",
  "unit": "4",
  "discription": "This course offers students a primer in ethnographic research. We examine all parts of the ethnographic process: from the concept work of project formulation and design to practical issues around the conduct of ethnographic research. This course is intended for graduate students at any stage of ethnographic research. Students may not receive credit for ANTH 287 and COGR 285 and ETHN 287.",
  "prerequsite": null
 },
 {
  "code": "ETHN 289",
  "title": "Topics in Ethnic Studies Research",
  "unit": "4",
  "discription": "This course is a research seminar on themes of contemporary and historic importance in ethnic studies. Themes will be determined by instructor. Course may be repeated three times for credit.",
  "prerequsite": null
 },
 {
  "code": "ETHN 291A",
  "title": "Comprehensive Research Preparation: The Literature Review",
  "unit": "4",
  "discription": "Using key theoretical approaches, debates, and frameworks of ethnic studies, students develop a critical analysis of how existing scholarship within the field of ethnic studies informs a specific research question, topic, or object of study; this literature review demonstrates comprehensive and holistic knowledge of critical approaches and constructs a coherent theoretical framework that effectively summarizes, synthesizes, and assesses a particular body of relevant ethnic studies literature.",
  "prerequsite": null
 },
 {
  "code": "ETHN 291B",
  "title": "Comprehensive Research Preparation: The Methodologies Paper",
  "unit": "4",
  "discription": "Implementing interdisciplinary research methods, students produce independent, generative research germane to the study of race and ethnicity. Students write a twenty- to twenty-five-page critical paper that poses an appropriate research question; engages relevant literature to provide a conceptual framework; develops and incorporates appropriate research methodologies; and constructs a critical, thorough, and cohesive argument based on the collection, organization, interpretation, and analysis of evidence.",
  "prerequsite": "ETHN 291A."
 },
 {
  "code": "ETHN 298",
  "title": "Directed Reading",
  "unit": "1-12",
  "discription": "This is an independent research or individual guided tutorial in an area not covered by present course offerings. This course may be repeated for an indefinite number of times due to the independent nature of the content of the course.",
  "prerequsite": null
 },
 {
  "code": "ETHN 299",
  "title": "Thesis Research",
  "unit": "1-12",
  "discription": "Open to graduate students conducting doctoral thesis research. This course may be repeated for an indefinite number of times due to the independent nature of thesis research and writing.",
  "prerequsite": null
 },
 {
  "code": "ETHN 500",
  "title": "Apprentice Teaching in Ethnic Studies",
  "unit": "4",
  "discription": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation and grading of examinations and other written exercises, and student relations.",
  "prerequsite": null
 }
]