[
 {
  "code": "GPCO 400",
  "title": "Policy-Making Processes",
  "unit": "4",
  "description": "This course is designed to teach students how to \"read\" a country's political and economic system. The course will examine how the particular evolution of institutional frameworks in the different countries of the Pacific region influences the way that political choices are made. Renumbered from IRCO 400. Students may not receive credit for GPCO 400 and IRCO 400.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 401",
  "title": "Microeconomics for Policy and Management",
  "unit": "4",
  "description": "This course introduces microeconomics, emphasizing applications to public policy. We examine tools such as marginal analysis and game theory to understand markets, the behavior of individuals and firms, and what role policy plays when markets fail to maximize social welfare. Renumbered from IRCO 401. Students may not receive credit for GPCO 401 and IRCO 401.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 403",
  "title": "International Economics",
  "unit": "4",
  "description": "The theory and mechanics of international economics. Included will be such topics as real trade theory, international movements of capital, the effects of trade and capital flows on domestic economies, and policies toward trade and foreign investment. Renumbered from IRCO 403. Students may not receive credit for GPCO 403 and IRCO 403.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 404",
  "title": "Market Failures and Policy Interventions",
  "unit": "4",
  "description": "Builds on GPCO 410, Microeconomics for Policy and Management. Applies economic reasoning to public issues, policies, and programs with a focus on the logic of when and how policy makers intervene in the market. It considers incentives and organizations; models of economic behavior, including markets, the absence of markets, and interventions; the price system; policy objectives and instruments. Renumbered from IRCO 404. Students may not receive credit for GPCO 404 and IRCO 404.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 406",
  "title": "Public Finance and Taxation",
  "unit": "4",
  "description": "This course introduces principles of taxation and expenditure analysis, public budgeting, and assessment of budget priorities. It will introduce students to concepts related to how public finance affects the private economy, how governments raise funds (and account for their expenditures to the public, foreign investors, and international organizations), and the major public policy tools for governing public finance. Renumbered from IRCO 406. Students may not receive credit for GPCO 406 and IRCO 406.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 407",
  "title": "Policy Analysis and Decision Theory",
  "unit": "4",
  "description": "This course introduces students to the methods of policy analysis and decision-making theory, including methods to assemble panel data to capture the impact of new policy on observable data, decision-making theory, uncertainty, decision criteria, expected utility, and risk. Renumbered from IRCO 407. Students may not receive credit for GPCO 407 and IRCO 407.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 408",
  "title": "Policy Analysis and Public Welfare",
  "unit": "4",
  "description": "The course explores the political and economic foundations of public policy making, examining both the processes through which the preferences of individuals are converted into public welfare policy and the public's response. Included will be an introduction to the concepts of rationality, individual decision-making, cooperation, collective action, and market failures. Students will also learn how to write a policy memo. Cases will be comparative and will include the U.S.",
  "prerequisite": null
 },
 {
  "code": "GPCO 410",
  "title": "International Politics and Security",
  "unit": "4",
  "description": "Development of analytic tools for understanding international relations with applications to contemporary problems such as the environment, nuclear proliferation, human rights, humanitarian interventions, and the roots of conflict and cooperation among countries. Renumbered from IRCO 410. Students may not receive credit for GPCO 410 and IRCO 410.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 412",
  "title": "Globalization, the World System, and the Pacific",
  "unit": "4",
  "description": "This course examines globalization and other economic and political factors that shape the international relations of the Pacific Rim. Specific topics include financial market integration, state cooperation and intervention, and case studies of individual countries. Renumbered from IRCO 412. Students may not receive credit for GPCO 412 and IRCO 412.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 415",
  "title": "Accounting and Finance for Policy Makers",
  "unit": "4",
  "description": "This course covers basic knowledge and skills of accounting and finance necessary for policy makers in for-profit, nonprofit, and public sectors. Topics include basic financial accounting, time value of money, and risk with applications to personal, corporate, and public finance. No credit will be allowed for GPCO 415 if a student has taken IRCO 420 and/or IRCO 421. Renumbered from IRCO 415. Students may not receive credit for GPCO 415 and IRCO 415.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 453",
  "title": "Quantitative Methods I",
  "unit": "4",
  "description": "This course is designed to provide proficiency in quantitative methods that are used for optimization and decision making. The use of spreadsheets is applied to data analysis and problem solving. Statistical theory and regression analysis are introduced. Renumbered from IRCO 453. Students may not receive credit for GPCO 453 and IRCO 453.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 454",
  "title": "Quantitative Methods II",
  "unit": "4",
  "description": "The course introduces the theory and application of econometric regression for policy analysis. Students will learn the underlying mathematical formalism, basic data management and coding skills, and appropriate interpretation and meaningful presentation of results. Renumbered from IRCO 454. Students may not receive credit for GPCO 454 and IRCO 454.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 462",
  "title": "Public Policy Capstone",
  "unit": "4",
  "description": "The capstone paper should demonstrate mastery of the three components of a public policy program: 1) development of the methodologies for rigorous data collection and policy analysis; 2) an in-depth understanding of the regulatory and legal politics and processes surrounding the student's chosen policy area; and 3) mastery of the details of the particular issue area and policies intended or that were intended as solutions. Paper may focus on policy interest of the student or of a client. Letter grades only. Renumbered from IRCO 462. Students may not receive credit for GPCO 462 and IRCO 462.",
  "prerequisite": "MPP students only or consent of instructor."
 },
 {
  "code": "GPCO 463",
  "title": "Strategy and Negotiation",
  "unit": "4",
  "description": "Using class exercises, this capstone class introduces the fundamentals of business strategy, based on case studies requiring market and corporate analysis, and the principles of negotiation. Students apply analytic problem- solving skills in a strategy consulting project with a real-world client company. Renumbered from IRCO 463. Students may not receive credit for GPCO 463 and IRCO 463.",
  "prerequisite": "GPIM 474. GPS students only."
 },
 {
  "code": "GPCO 466",
  "title": "Real World Projects in Energy and the Environment",
  "unit": "4",
  "description": "The course will emphasize real world application of theories and methods of policy analysis to projects with real clients in the area of energy and the environment. The class will include case studies and seminar-style discussions of topics such as project finance and management of regulatory risk. Most of the class will be devoted to work in small teams with clients seeking strategic guidance. Students are expected to produce final projects suitable for senior management and governing boards.",
  "prerequisite": "GPCO 400 and GPPS 428 or consent of instructor."
 },
 {
  "code": "GPCO 467",
  "title": "Policy Responses to Global Problems",
  "unit": "4",
  "description": "This capstone is designed to test the analytic skills of students, using them to explain complex real-world problems: security, persistent recurring conflict, persistent inequality and intergenerational debt, women's rights, environmental change, energy/resource systems, and financial contagion. Emphasis will be placed on determining the nature and dimension of the problem, exploring a range of solutions and assessing the capacity of public institutions. Renumbered from IRCO 467. Students may not receive credit for GPCO 467 and IRCO 467.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 468",
  "title": "Evaluating Technological Innovation",
  "unit": "4",
  "description": "This capstone is intended as a culminating intellectual experience for students, particularly those in economics-oriented tracks. Students will learn to analyze \"what works,\" integrating a technical understanding of innovation with rigorous statistical analysis. The first half of the course focuses on building a set of science/engineering tools, and the second half on building statistical tools of analysis. Renumbered from IRCO 468. Students may not receive credit for GPCO 468 and IRCO 468.",
  "prerequisite": "GPEC 446 or consent of instructor."
 },
 {
  "code": "GPCO 470",
  "title": "Master of Chinese Economics and Political Affairs Capstone",
  "unit": "4",
  "description": "This is the first quarter of a two-quarter requirement. The capstone paper must demonstrate: mastery of the development of the methodologies for rigorous data collection and analysis; an in-depth understanding of the historical regulatory, political and/or economic processes surrounding the chosen \"problem\" for analysis; mastery of the working details of the \"problem\" at the center of the research; and a requisite level of research proficiency in Mandarin Chinese. Topic to be approved.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPCO 471",
  "title": "MCEPA Capstone Part II",
  "unit": "4",
  "description": "Students will work closely with the faculty of record and a GPS professor who specializes in the research who are chosen for the capstone project. This required second quarter will be focused on writing, developing a presentation, and presenting the work to either a real-world client or a panel of faculty.",
  "prerequisite": "GPCO 470 or consent of instructor."
 },
 {
  "code": "GPCO 481",
  "title": "The Politics of International and National Policy Making",
  "unit": "4",
  "description": "This course provides an introduction to the international political economy of the Pacific Rim. The course covers important international developments, such as regionalism, as well as domestic decision-making processes. Renumbered from IRCO 481. Students may not receive credit for GPCO 481 and IRCO 481.",
  "prerequisite": "MAS-IA students only."
 },
 {
  "code": "GPCO 482",
  "title": "Economies of the Pacific Rim",
  "unit": "4",
  "description": "This course studies major economies of the Pacific region by combining standard tools in economics with institutional background on each economy. Special attention is given to the challenges that economic globalization poses on the economic relations among those economies. Renumbered from IRCO 482. Students may not receive credit for GPCO 482 and IRCO 482.",
  "prerequisite": "MAS-IA students only."
 },
 {
  "code": "GPCO 483",
  "title": "Workshop on Policy Issues in the Pacific Rim",
  "unit": "4",
  "description": "Capstone class: Students collaborate on long-term projects analyzing important political, economic, and business issues in the Pacific regions using the tools acquired through other courses at GPS. Renumbered from IRCO 483. Students may not receive credit for GPCO 483 and IRCO 483.",
  "prerequisite": "GPCO 481 and GPCO 482 or consent of instructor."
 },
 {
  "code": "GPEC 406",
  "title": "Finance and Development",
  "unit": "4",
  "description": "This course analyzes the roles of money and financial institutions in the economy. The first part of the course focuses on microeconomics and the financial system. The topics include money, financial markets, financial intermediaries, banking regulations, and bank runs. The second part of the course focuses on the microeconomics aspects of financial institutions. The topics include financial development, financial liberalization, and their effects on the economy, especially economic growth and development. Renumbered from IRGN 406. Students may not receive credit for GPEC 406 and IRGN 406.",
  "prerequisite": "GPCO 403 and GPCO 415 or consent of instructor."
 },
 {
  "code": "GPEC 409",
  "title": "Economic Policy in Latin America",
  "unit": "4",
  "description": "This course examines the economic policies implemented by Latin American countries over the last half century, focusing on their role in the process of economic development in the region, and considers the central role of politics in shaping policy. Renumbered from IRGN 409. Students may not receive credit for GPEC 409 and IRGN 409.",
  "prerequisite": "GPCO 401 and GPCO 403 or consent of instructor."
 },
 {
  "code": "GPEC 411",
  "title": "Topics in China's Development",
  "unit": "4",
  "description": "Why has China been growing so fast in the past few decades? Does the authoritarianism select competent leaders? How do firms and households behave in such a quasi-market economy? The course is designed to investigate these topical questions and provide students with a general overview of existing research on China’s development. May not receive credit for GPEC 411 and IRGN 490, Topics in China's Development.",
  "prerequisite": null
 },
 {
  "code": "GPEC 412",
  "title": "Comparative Development of the East Asian Economies",
  "unit": "4",
  "description": "This course studies the economic development, current economic issues, and future prospects and challenges of East Asia, broadly defined as China, Japan, Korea, and Southeast Asia. The course focuses on the comparative development experience across the economies, regional economic integration, and economic interactions among the economies in the region. Renumbered from IRGN 412. Students may not receive credit for GPEC 412 and IRGN 412.",
  "prerequisite": null
 },
 {
  "code": "GPEC 414",
  "title": "The Economics of Energy Policy",
  "unit": "4",
  "description": "This course examines the theoretical and empirical questions around the supply and demand markets, and the use for energy in firms and households. We will consider the environmental consequences and regulations of use. The course emphasizes the application of economic theory to energy issues. Non-GPS graduate students may enroll with consent of instructor. Renumbered from IRGN 414. Students may not receive credit for GPEC 414 and IRGN 414.",
  "prerequisite": "GPS students only or consent of instructor."
 },
 {
  "code": "GPEC 415",
  "title": "The Economics of Trade Policy",
  "unit": "4",
  "description": "This course explores the rationales and consequences of trade-related government interventions from an economic perspective. We will cover classical trade theory, \"new\" trade theory, the process of global multilateral trade integration, and the political economy roots of trade policy. Non-GPS graduate students may enroll with consent of instructor. Renumbered from IRGN 415. Students may not receive credit for GPEC 415 and IRGN 415.",
  "prerequisite": null
 },
 {
  "code": "GPEC 416",
  "title": "International Trade Agreements",
  "unit": "4",
  "description": "Examines international trade agreements, their design, the strategic interactions that determine implementation and sustainability, and consequences for global welfare and inequality. The course draws on international economics, game theory, law and economics, and political economy. The tools are used to understand multilateral and bilateral trade agreements, such as NAFTA, and international organizations, such as the WTO. Students may not receive credit for GPEC 416 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPEC 417",
  "title": "Microfinance",
  "unit": "4",
  "description": "This course will begin by examining financial systems in poor countries. We will investigate how microfinance contracts overcome problems which had previously barred the extension of business credit in many environments. Renumbered from IRGN 417. Students may not receive credit for GPEC 417 and IRGN 417.",
  "prerequisite": null
 },
 {
  "code": "GPEC 418",
  "title": "Green Technology",
  "unit": "4",
  "description": "The course looks at clean energy and related technologies, including a high- level understanding of the science, policy, and market forces governing innovation. Students will develop an understanding of the renewable energy sector and the market variability of new technology. Non-GPS graduate students may enroll with consent of instructor. Renumbered from IRGN 418. Students may not receive credit for GPEC 418 and IRGN 418.",
  "prerequisite": null
 },
 {
  "code": "GPEC 421",
  "title": "Financial Institutions",
  "unit": "4",
  "description": "This course studies how the financial system works to support economic growth most of the time, but also how it gets into crisis and puts the economy into a recession. Course emphasizes the importance and incentive problems inherent in financial transactions. Renumbered from IRGN 421. Students may not receive credit for GPEC 421 and IRGN 421.",
  "prerequisite": null
 },
 {
  "code": "GPEC 422",
  "title": "Multinational Corporations",
  "unit": "4",
  "description": "This course is devoted to studying the central player in the globalization process: the multinational corporation. From the perspective of both developed and developing countries, we will analyze the determinants of flows of multinational firms and foreign direct investment across countries; explore the incentives a firm has to become an MNC, particularly those to split production, and its consequences on a domestic economy; and the transfer of managerial abilities across countries. May not receive credit for GPEC 422 and IRGN 490. Knowledge of STATA is assumed.",
  "prerequisite": null
 },
 {
  "code": "GPEC 431",
  "title": "Fiscal and Monetary Policy",
  "unit": "4",
  "description": "Effects of fiscal and monetary policies on aggregate variables such as output, nominal and real interest rates, price level, and employment. Additional topics include the inflation/ unemployment trade-off, budget deficit, and economic growth. Renumbered from IRGN 431. Students may not receive credit for GPEC 431 and IRGN 431.",
  "prerequisite": null
 },
 {
  "code": "GPEC 432",
  "title": "Immigration and Immigration Policy",
  "unit": "4",
  "description": "The goals of the course are to help students acquire analytic skills used in the study of labor economics and international migration. We examine the causes of immigration, the consequences of immigration for wages and employment in sending and receiving countries, and policies governing high- skilled immigration, undocumented immigration, and refugees. Students produce an original project that demonstrates their master of quantitative tools used in economics. Renumbered from IRGN 432. Students may not receive credit for GPEC 432 and IRGN 432.",
  "prerequisite": null
 },
 {
  "code": "GPEC 433",
  "title": "Urban Economic Policy",
  "unit": "4",
  "description": "This course examines economic models of cities, looking at the processes that drive urbanization, spatial agglomeration of economic activity, and growth. We will also study the policy challenges confronting cities—pollution, congestion, infrastructure, economic development, and housing—and alternative approaches to addressing the challenges. Students may not receive credit for GPEC 433 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPEC 435",
  "title": "Topics in International Trade",
  "unit": "4",
  "description": "This course helps students master analytical tools used by international economists. Topics covered include the causes of international trade, how trade agreements affect global commerce, and the labor-market consequences of globalization. The course is intensive in the use of data. Students produce an original econometrics project that demonstrates their quantitative aptitude in economics. Renumbered from IRGN 435. Students may not receive credit for GPEC 435 and IRGN 435.",
  "prerequisite": null
 },
 {
  "code": "GPEC 443",
  "title": "GIS and Spatial Data Analysis",
  "unit": "4",
  "description": "This course introduces GIS and spatial data analysis for social science research. We use ArcGIS to manipulate and visualize georeferenced data and learn various spatial analysis tools. We emphasize geography as an important lens through which to study society. Renumbered from IRGN 443. Students may not receive credit for GPEC 443 and IRGN 443. Basic knowledge of statistics and STATA is assumed.",
  "prerequisite": null
 },
 {
  "code": "GPEC 444",
  "title": "Advanced GIS and Remote Sensing",
  "unit": "4",
  "description": "Students will learn to design and maintain geospatial databases, validate the topology of a dataset, and produce clear and informative maps and reports. Part two will be dedicated to principles of remote sensing and to analysis of satellite imagery: geospatial database design and maintenance, topology validation and topological rules, the Network analyst extension, the surface tool set, basic concepts of remote sensing, and introduction to Google Earth Engine UI and Google Earth Engine API. May not receive credit for GPEC 444 and IRGN 490 with the subtitles: \"Advanced GIS Spatial Analysis\" or \"Advanced GIS and Remote Sensing.\" May be coscheduled with GPEC 244. GPEC 443 or the equivalent training in GIS is recommended.",
  "prerequisite": null
 },
 {
  "code": "GPEC 446",
  "title": "Applied Data Analysis and Statistical Decision Making",
  "unit": "4",
  "description": "The goal of this course is to learn how to evaluate quantitative information in business, policy, and economic contexts, and to make sound decisions in complex situations. The course work will involve statistical software and spreadsheet analysis of data. The course covers various applied multivariate statistical methods beyond basics. Renumbered from IRGN 446. Students may not receive credit for GPEC 446 and IRGN 446.",
  "prerequisite": "GPCO 453 and GPCO 454 or consent of instructor."
 },
 {
  "code": "GPEC 449",
  "title": "Corruption and Development",
  "unit": "4",
  "description": "The goal of this course is to better understand corruption in developing countries today: why it occurs, the consequences, and what can or should be done about it. Topics include the conceptual and historical background of corruption; different views on how corruption affects regulatory processes; how the organization of a bureaucracy may affect the amount of corruption; effects on redistribution; methods for reducing corruption; and the role of information and elections as limits. Student may not get credit for GPEC 449 and IRGN 490, Corruption and Development.",
  "prerequisite": null
 },
 {
  "code": "GPEC 450",
  "title": "Macroeconomics of Development",
  "unit": "4",
  "description": "This course will cover topics such as: economic growth in the long run; cross- country differences in income, labor supply, human capital, investment, and welfare; development accounting; technology adoption; misallocation and total- factor productivity; rural-urban income gaps and migration; structural transformation; and competition and productivity. Student may not receive credit for GPEC 450 and IRGN 490, Macroeconomics of Development. GPCO 401 and GPCO 403 are recommended.",
  "prerequisite": null
 },
 {
  "code": "GPEC 451",
  "title": "Economic Development",
  "unit": "4",
  "description": "This course examines comparative patterns of industrialization and agricultural modernization with a focus on certain common features of the modernization process and widely varying endowments, policies, and experiences, of different countries. Renumbered from IRGN 451. Students may not receive credit for GPEC 451 and IRGN 451.",
  "prerequisite": "GPCO 401 and GPCO 403."
 },
 {
  "code": "GPEC 453",
  "title": "Sustainable Development",
  "unit": "4",
  "description": "The course will cover the various aspects of the concept and application of sustainable development: the ways in which sustainable development can be measured, methods for the evaluation of environmental damages and benefits, and the role of discounting. We will analyze several cases demonstrating failure of the market. Renumbered from IRGN 453. Students may not receive credit for GPEC 453 and IRGN 453.",
  "prerequisite": null
 },
 {
  "code": "GPEC 455",
  "title": "Integrated Development Practice",
  "unit": "4",
  "description": "This course introduces students to the basic competencies and practical skills of a development practitioner. Lectures will be grounded in a practical, multi-sectorial approach that focuses on the interrelationship of the social sciences, health sciences, and natural sciences. It emphasizes a \"differential diagnosis for development\" through case studies of developing countries. Students will be asked to use both STATA and GIS to analyze household survey data to identify poverty hot spots. May not receive credit for GPEC 455 and the IRGN 490 course of the same title. Assumes competence in both STATA and GIS.",
  "prerequisite": null
 },
 {
  "code": "GPEC 458",
  "title": "International Environmental Policy and Politics",
  "unit": "4",
  "description": "This course analyzes multilateral environmental agreements and negotiating positions of key countries on climate change, biodiversity conservation, sustainable development, and other subjects. It explores the challenges countries face to balance economic development objectives with global environmental concerns. Renumbered from IRGN 458. Students may not receive credit for GPEC 458 and IRGN 458.",
  "prerequisite": null
 },
 {
  "code": "GPEC 462",
  "title": "Southeast Asian Economies",
  "unit": "4",
  "description": "This course applies theoretical frameworks in microeconomics, international economics, and economic development to study comparative economic development and current issues of economics in Southeast Asia. Topics include economic growth, crises, development mechanisms, households, firms, governments, and institutional foundations. Renumbered from IRGN 462. Students may not receive credit for GPEC 462 and IRGN 462. May be coscheduled with GPEC 262.",
  "prerequisite": "GPCO 401 and GPCO 403 or consent of instructor."
 },
 {
  "code": "GPEC 464",
  "title": "Designing Field Experiments",
  "unit": "4",
  "description": "This course covers the applied practice of quantitative impact evaluation. The benchmark methodology will be randomized controlled trials. The broader set of nonexperimental tools will be understood through the ways they differ from random assignment. Practical issues in research and survey design will be discussed. Renumbered from IRGN 464. Students may not receive credit for GPEC 464 and IRGN 464.",
  "prerequisite": "GPCO 453, 454, 468, and GPEC 446, or consent of instructor."
 },
 {
  "code": "GPEC 468",
  "title": "International Health Economics",
  "unit": "4",
  "description": "Course provides an overview of health economics, focusing on developing countries. We will examine both how standard economics concepts and methods can be used to understand incentives and decision making in health-related transactions and their application to health policy. Renumbered from IRGN 468. Students may not receive credit for GPEC 468, IRGN 468, and IRGN 490, International Health Economics.",
  "prerequisite": null
 },
 {
  "code": "GPEC 471",
  "title": "Japanese Economy",
  "unit": "4",
  "description": "A broad survey of the Japanese economy, together with in-depth examination of some distinctively Japanese phenomena such as savings behavior, financial structure, industrial organization, and labor markets. Renumbered from IRGN 471. Students may not receive credit for GPEC 471 and IRGN 471.",
  "prerequisite": "GPCO 401 and GPCO 403."
 },
 {
  "code": "GPEC 480",
  "title": "Comparative Development of the Latin American Economies",
  "unit": "4",
  "description": "This course studies the development, current economic issues, and future prospects and challenges of Latin America, broadly defined to include Mexico and Central and South America. The course focuses on the comparative development experience across the economies, regional economic integration, and economic interactions among the economies of the region. Renumbered from IRGN 480. Student may not receive credit for GPEC 480 and IRGN 480.",
  "prerequisite": null
 },
 {
  "code": "GPEC 485",
  "title": "The Korean Economy",
  "unit": "4",
  "description": "Analytical review of South Korea's economic performance. Examination of major policy changes (e.g., shifts toward export promotion, heavy and chemical industries promotion); Korea's industrial structure, including the role of large enterprises ( _chaebol_ ); role of government; links between Korea and other countries. Renumbered from IRGN 485. Student may not receive credit for GPEC 485 and IRGN 485.",
  "prerequisite": null
 },
 {
  "code": "GPEC 486",
  "title": "Economic and Social Development of China",
  "unit": "4",
  "description": "This course examines China's development experience from a generally economic standpoint. Contents include patterns of traditional Chinese society and economy; geography and resource constraints, impact of the West and Japan; development since 1949 and contemporary problems and options. Renumbered from IRGN 486. Student may not receive credit for GPEC 486 and IRGN 486.",
  "prerequisite": null
 },
 {
  "code": "GPEC 488",
  "title": "Environmental and Regulatory Economics",
  "unit": "4",
  "description": "This course provides a broad overview of environmental and regulatory economics and its interface with public policy. This course will be grounded in microeconomic theory with applications to specific cases. Renumbered from IRGN 488. Student may not receive credit for GPEC 488 and IRGN 488.",
  "prerequisite": "GPCO 401 and GPCO 454 or consent of instructor."
 },
 {
  "code": "GPEC 489",
  "title": "The Economics of Nonmarket Valuation",
  "unit": "4",
  "description": "Government policies with respect to cultural amenities, the environment, health, and transportation generate benefits and costs not directly priced by the market. This course covers the range of techniques economists utilize to place a monetary value on nonmarket outputs. Course renumbered from IRGN 489. Student may not receive credit for GPEC 489 and IRGN 489. ",
  "prerequisite": "GPCO 401 and GPCO 454."
 },
 {
  "code": "GPIM 410",
  "title": "Innovation and Entrepreneurship in Japan",
  "unit": "4",
  "description": "This research-oriented class introduces: (a) frameworks from organization theory and strategy on innovation, corporate renewal, and system change; (b) the specific situation of Japan, including Japan’s national system of innovation, research consortia and industrial policy, business models, HR practices, VC, and entrepreneurship. Ongoing changes toward open innovation and new management of technology in Japan are the subject of student research projects. May not receive credit for GPIM 410 and IRGN 490. Japan Lab.",
  "prerequisite": null
 },
 {
  "code": "GPIM 411",
  "title": "Business and Management in Japan",
  "unit": "4",
  "description": "This course introduces the core features of Japanese business and industrial organization, as well as Japanese management and HR practices. Business frameworks and concepts are introduced to enable students to analyze and evaluate organization change and the emergence of “New Japan” companies. Renumbered from IRGN 411. Students may not receive credit for GPIM 411 and IRGN 411.",
  "prerequisite": null
 },
 {
  "code": "GPIM 413",
  "title": "Corporate Strategy and the Environment",
  "unit": "4",
  "description": "This seminar examines the ability of firms to increase shareholder value through improved environmental performance. Topics include product differentiation, strategic use of regulations, the \"Porter hypothesis,\" and environmental management systems. Readings include case studies and research articles. Renumbered from IRGN 413. Students may not receive credit for GPIM 413 and IRGN 413.",
  "prerequisite": null
 },
 {
  "code": "GPIM 420",
  "title": "Marketing",
  "unit": "4",
  "description": "The role and function of marketing in organizations and society. Attention is given to the analysis of markets and customers using primary and secondary sources of information and the planning, implementation, and evaluation of marketing strategies and programs. Renumbered from IRGN 420. Students may not receive credit for GPIM 420 and IRGN 420.",
  "prerequisite": null
 },
 {
  "code": "GPIM 421",
  "title": "Marketplace Behavior and Survey Methods",
  "unit": "4",
  "description": "This course provides an overview of consumer behavior and best practices of measurement: introduction of foundational principles of judgement and decision-making in marketing, psychology, behavioral economics; and the application of this knowledge to design effective surveys and questionnaires for market research on attitudes, preferences, and behavior. Topics include prospect theory, decision heuristics, tactics for measuring willingness-to- pay, and applied business methods such as conjoint analysis.",
  "prerequisite": null
 },
 {
  "code": "GPIM 422",
  "title": "Investments",
  "unit": "4",
  "description": "An analysis of the risk/return characteristics of different assets as perceived by different investors and their implications for security price behavior, emphasizing real world capital market behavior. International aspects include the role of exchange rate risk and international diversification. Renumbered from IRGN 422. Students may not receive credit for GPIM 422 and IRGN 422.",
  "prerequisite": null
 },
 {
  "code": "GPIM 424",
  "title": "Corporate Finance",
  "unit": "4",
  "description": "The topics covered are dividend policy and capital structure, options, debt financing, and short- and long-term in financial planning. Course format will be mostly lectures with occasional cases. Some international aspects of corporate finance will also be discussed. Renumbered from IRGN 424. Students may not receive credit for GPIM 424 and IRGN 424.",
  "prerequisite": null
 },
 {
  "code": "GPIM 426",
  "title": "Business Strategy in the Pacific Rim",
  "unit": "4",
  "description": "This course provides a case-based approach to developing and implementing strategy. It uses business cases from Asia (China, Japan, Taiwan, and South Korea) and Latin America (Mexico, Brazil, Chile, and Argentina) to help students develop a well-defined methodology for approaching strategic decision making that would be applicable to any situation. Renumbered from IRGN 426. Students may not receive credit for GPIM 426 and IRGN 426.",
  "prerequisite": null
 },
 {
  "code": "GPIM 427",
  "title": "The Competing Business Systems of Developing Asia",
  "unit": "4",
  "description": "This course explores the major types of business systems prevalent in developing Asia. These include, for example, the state-owned enterprises of China, Chinese private sector firms, family-owned businesses of HK/Taiwan/SE Asia, Taiwanese tech firms, the Korean Chaebol, Indian promoter-led companies, and companies of developed markets that operate in the region. Course explores the nature of incentives, constraints, and decision making within these different types of firms. May not receive credit for GPIM 427 and IRGN 490. Competing Business Systems of Developing Asia.",
  "prerequisite": null
 },
 {
  "code": "GPIM 428",
  "title": "Management and Entrepreneurship in China",
  "unit": "4",
  "description": "This course examines the challenges of corporate leadership and entrepreneurship in China, with discussion of business in Taiwan as well. The issues are explored from the perspective of various types of companies in China, including start-ups, larger private sector companies, state-owned enterprises, and multinational companies. We explore various major industries in China, and explore various managerial challenges including strategy, HR, partnership development, and government relations. May not receive credit for GPIM 428 and IRGN 490. Management and Entrepreneurship in China.",
  "prerequisite": null
 },
 {
  "code": "GPIM 429",
  "title": "Understanding China's Dynamic Industries",
  "unit": "4",
  "description": "This course focuses on developing an in-depth understanding of four of China's most dynamic industries. These are health care, consumer goods and retail, high technology, and eCommerce. Students will select one of these four industries for deep study and will gain an overview of the other three. The course includes extensive analysis of investment bank analyst reports and Harvard case studies. The course also includes simulated job interviews in the targeted industries. May not receive credit for both GPIM 429 and IRGN 490, Understanding China's Dynamic Industries.",
  "prerequisite": null
 },
 {
  "code": "GPIM 430",
  "title": "Corporate Nonmarket Strategies",
  "unit": "4",
  "description": "The course examines the evolution of nonmarket strategies in the private sector, and the impact of trends such as globalization, technological advancement, and media on private sector tactics. How do companies respond to customers, suppliers, and competitors? How does a company determine its value proposition for stakeholders? How do political activities, such as giving, build relationships in US and international markets? How do stakeholders resolve conflicts between global and local policies? Students may not receive credit for GPIM 430 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPIM 431",
  "title": "Competition Policy as Industrial Policy",
  "unit": "4",
  "description": "Course examines the use of competition/antitrust policies to achieve industrial policy goals, focusing on the U.S., EU, China, Korea, and emerging markets such as India and Indonesia. We begin with a historical overview of competition and industrial policy to frame the current debate. We then examine policy regimes and how they have evolved in light of three trends: expansion of obligations under the WTO, changes in power relations within corporate sectors, and emergence of national champions. Students may not earn credit for GPIM 431 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPIM 432",
  "title": "Technology, Trade, and Globalization",
  "unit": "4",
  "description": "This course examines the tensions between technology and globalization on the one hand and national identity on the other. We discuss the creation of liberal post-war trade, monetary, and policy regimes and how technological change influenced these developments. We then examine the evolution of policy toward the internet, mobile telephony, and associated ICT products and services. We will also study current challenges in trade, investment, censorship, privacy and content regulation. Students may not earn credit for GPIM 432 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPIM 436",
  "title": "Doing Business in Latin America",
  "unit": "4",
  "description": "This course examines the current business environment in Latin America, taking into account political, economic, and cultural factors. The course will be based on case studies, supplemented with guest lectures from business executives and discussions of selected readings. Students will be required to develop a business plan as a major part of the grade for the course. Renumbered from IRGN 436. Students may not receive credit for both GPIM 436 and IRGN 436.",
  "prerequisite": null
 },
 {
  "code": "GPIM 438",
  "title": "Operations and Technology Management",
  "unit": "4",
  "description": "Introduction to operations and technology, including services, manufacturing, and R&D. How organizations produce useful outputs that meet customer needs. Capital cost, variable cost, speed, lead time, robustness, including process analysis, supply chains, total quality, and process improvement. Case studies, simulations, and lectures. Renumbered from IRGN 438. Students may not receive credit for GPIM 438 and IRGN 438.",
  "prerequisite": "GPCO 453.  "
 },
 {
  "code": "GPIM 440",
  "title": "Managerial Accounting and Control",
  "unit": "4",
  "description": "Focus on planning, managing, controlling, and evaluating costs for competitive advantage in global markets. Key topics will include cost structure, cost- based managerial decision making, strategic cost management, JIT/TQC cost management, and accounting control systems. Renumbered from IRGN 440. Students may not receive credit for GPIM 440 and IRGN 440.",
  "prerequisite": "GPCO 415 or consent of instructor."
 },
 {
  "code": "GPIM 444",
  "title": "Product Development",
  "unit": "4",
  "description": "This course examines how high-tech companies develop successful products. Emphasizes interplay between business and technology issues, including marketing, finance, manufacturing, prototyping, testing, and design. Student teams develop novel products, from concept to working prototype, including a business plan for launching the product. Discussion of concurrent engineering, rapid prototyping, industrial design, and other design methodologies. Renumbered from IRGN 444. Students may not receive credit for GPIM 444 and IRGN 444.",
  "prerequisite": null
 },
 {
  "code": "GPIM 447",
  "title": "Organizational Economics",
  "unit": "4",
  "description": "This course examines the economics of decisions and strategies made within nongovernmental organizations. Topics covered include how and why organizations emerge and the impact that owner and manager decisions have on workers, strategy, and success. Renumbered from IRGN 447. Students may not receive credit for GPIM 447 and IRGN 447.",
  "prerequisite": null
 },
 {
  "code": "GPIM 452",
  "title": "Big Data Analytics",
  "unit": "4",
  "description": "This course will use tools and case studies to illustrate the promise and challenges of analyzing big data sets. Emphasis will be on solving problems rather than testing hypothesis. Renumbered from IRGN 452. Students may not receive credit for GPIM 452 and IRGN 452.",
  "prerequisite": null
 },
 {
  "code": "GPIM 457",
  "title": "Cost-Benefit Analysis",
  "unit": "4",
  "description": "Examination of public policy analysis, such as cost-benefit analysis and project evaluation, for use in policy formation. Sustainable development will receive particular attention. Case studies emphasizing the environment, agriculture and food, and economic development will be included. Renumbered from IRGN 457. Students may not receive credit for GPIM 457 and IRGN 457.",
  "prerequisite": null
 },
 {
  "code": "GPIM 461",
  "title": "Doing Business in China",
  "unit": "4",
  "description": "This course describes the Chinese commercial, organizational, and cultural environment. Case studies of foreign businesses in China are examined, and the opportunities and pitfalls of operation in China are considered. Negotiation with Chinese counterparts is covered through a negotiation exercise. The focus is on mainland China, but some attention is given to business in Hong Kong and Taiwan as well. Students are required to prepare business plans for proposed Chinese ventures. Renumbered from IRGN 461. Students may not receive credit for GPIM 461 and IRGN 461.",
  "prerequisite": null
 },
 {
  "code": "GPIM 469",
  "title": "Automation: The Future of Work",
  "unit": "4",
  "description": "Fears about the impact of automation on work are old, but the advent of \"smart machines\" and artificial intelligence have created new concerns. Many categories of work previously done by humans are newly vulnerable to replacement. What are the forces driving these changes? What technological advances make new technology possible? What tasks cannot be done by machines? Topics of the class include artificial intelligence, machine learning, worker safety nets, competition, and others. Students may not earn credit for GPIM 469 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPIM 470",
  "title": "International Business",
  "unit": "4",
  "description": "This course introduces basic concepts of international business decision making. It covers entry modes, headquarter tasks and organization charts, strategic planning for foreign subsidiaries, international HR management and payroll, international taxation, and an introduction to transfer pricing. Renumbered from IRGN 470. Students may not receive credit for GPIM 470 and IRGN 470.",
  "prerequisite": null
 },
 {
  "code": "GPIM 471",
  "title": "Start-Ups: From Founding to Launch",
  "unit": "4",
  "description": "New businesses contribute significantly to economic growth, consumer well- being, and labor market development. Evidence demonstrates that entrepreneurs are more likely to succeed if they understand founding team formation, potential market evaluation, team and entrepreneur evaluation, new venture financing options, and detailed understanding of market strategies. The course focuses primarily on technology ventures. Students may not receive credit for GPIM 471 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPIM 472",
  "title": "Innovation in the New Economy",
  "unit": "4",
  "description": "This course examines the microeconomics of technological change and innovation. What drives innovation, and what determines the types of innovations that succeed? What are the interactions between technology and industry changes? We cover topics in industrial organization, industrial and technology evolution, and technology evaluation. This course provides models, tools, and skills to analyze interactions between industries and technological development. Students may not receive credit for GPIM 472 and GPGN 490 with the same title.",
  "prerequisite": "GPCO 454 or consent of instructor."
 },
 {
  "code": "GPIM 474",
  "title": "Applied Financial Accounting",
  "unit": "4",
  "description": "The objective of this course is to develop an understanding of accounting procedures and learn how to judge corporate financial statements. Through case studies, students will learn to interpret the numbers and make inferences about the financial health of a company. The course includes a comparison of best practices and an introduction to International Financial Reporting Standards. Renumbered from IRGN 474. Students may not receive credit for GPIM 474 and IRGN 474.",
  "prerequisite": null
 },
 {
  "code": "GPPA 400",
  "title": "American Politics and Policy",
  "unit": "4",
  "description": "This course studies the structure of American government and the political dimensions of policy problems. Who or what influences policy decisions? The course provides students with an analytical and applied understanding of American politics and policy through the use of theory, empirical tests, and case studies.",
  "prerequisite": null
 },
 {
  "code": "GPPA 401",
  "title": "California Politics and Public Policy",
  "unit": "4",
  "description": "Course explores how public policy is made by California's statewide institutions, including the legislature, governor, executive branch agencies and the courts, and the myriad of local governments: special districts, cities, and counties. We look at political history, and how direct democracy has affected different constituencies. The second half of the course looks at policymaking by the executive branch and state agencies, the courts, and local governments, specifically in terms of budgeting. Students may not earn credit for GPPA 401 and GPGN 490 of the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 404",
  "title": "Governance, Public Administration, and Development",
  "unit": "4",
  "description": "Good governance and public administration underpin the effective implementation of almost the entire development agenda. This course examines rigorous evidence on both the drivers and impact of (mis)governance in developing countries. Students may not receive credit for GPPA 404 and IRGN 490, Governance, Public Administration, and Development.",
  "prerequisite": null
 },
 {
  "code": "GPPA 405",
  "title": "Managing the Distributive Politics of Public Policy",
  "unit": "4",
  "description": "Why do public authorities inefficiently distribute scarce economic resources? What are the impacts of such inefficient distribution on welfare and economic development? And how do we design policies to limit inefficiencies in distribution? This course surveys the literature on distributive politics to address these questions. Students may not receive credit for GPPA 405 and the IRGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 407",
  "title": "Policy Implementation Process",
  "unit": "4",
  "description": "Course builds on policy-making processes class by focusing on nonelected officials' role in setting and implementing policy. Ideally, elected officials make policies that unbiased, technically proficient bureaucrats carry out. Course provides insight into why the real world departs from this. Renumbered from IRGN 407. Students may not receive credit for GPPA 407 and IRGN 407.",
  "prerequisite": null
 },
 {
  "code": "GPPA 408",
  "title": "Politics, Policy, and Markets in Modern Financial Crises",
  "unit": "4",
  "description": "The course examines the 2008-2009 financial crisis through the lens of public and private sector participants with an interest in exploring the real-world challenges of practical governance, the threat of \"too-big-to-fail,\" limits on authorities, and questions about who should be included in the circle of government protection in a crisis. Through speeches, writings, and testimony of key actors, we will develop a framework for evaluating other financial crises, such as those in the 1990s. Students may not earn credit for GPPA 408 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 410",
  "title": "Making Policy with Data",
  "unit": "4",
  "description": "This course is designed to teach empirical analysis of policy and programs in the field of economic development. We will look at large data sets that cover the major determinants of economic development: geography, institutions, human capital, and culture. We will study data and codes, replicate the findings, and work with developing patterns of cross-country characteristics. Students may not receive credit for GPPA 410 and GPGN 490 with the same title.",
  "prerequisite": "GPCO 454 or consent of instructor."
 },
 {
  "code": "GPPA 420",
  "title": "Innovation in Healthcare Operations",
  "unit": "4",
  "description": "The health care sector is one of the largest and continues to grow in most countries. However, it has major quality, safety, and efficiency problems. This course shows how to improve health care delivery. Topics include tools such as checklists, Six Sigma, lean processes, and design of experiments. Some discussion of pharmaceutical development and clinical trials. Students may not receive credit for GPPA 420 and IRGN 490, Innovation in Healthcare Operations.",
  "prerequisite": null
 },
 {
  "code": "GPPA 430",
  "title": "Education Policy Around the World",
  "unit": "4",
  "description": "What policies should countries adopt if they want to improve the quality of their education system? The course draws on development economics and its rigorous evaluations of the impact of education policies on student outcomes in developing countries. Questions to be asked: What are the challenges faced in developing countries? What are the policies that have been proposed and how have they been evaluated? What questions have not been asked and/or answered?",
  "prerequisite": "GPCO 453 and GPCO 454 or consent of instructor."
 },
 {
  "code": "GPPA 435",
  "title": "Comparative Social Welfare Policy",
  "unit": "4",
  "description": "Provides an overview of how governments develop and administer policy aimed at providing a basic floor for human welfare and insuring citizens against economic risk. We discuss the historical emergence of social welfare policies, such as pensions, unemployment, nutrition support, and direct transfers. We emphasize political explanations for variation in program funding mechanisms. We then explore the consequences for economic competitiveness and political stability.",
  "prerequisite": "GPCO 453 or consent of instructor."
 },
 {
  "code": "GPPA 450",
  "title": "Justice, Policy, and Development",
  "unit": "4",
  "description": "This course explores three topics: 1) democracy, which is primarily about procedural justice; 2) social policy, which is primarily about distributive justice; and, 3) corruption, which is a breach of formal justice. We will consider potential conflicts and reconciliation between justice and development, approaching various issues not just theoretically and conceptually, but also empirically and quantitatively. The course uses cross- national quantitative studies and case studies. Renumbered from IRGN 450. Students may not receive credit for GPPA 450 and IRGN 450.",
  "prerequisite": null
 },
 {
  "code": "GPPA 451",
  "title": "Violence in Latin America",
  "unit": "4",
  "description": "This class explores the security crisis in Latin America. Four interrelated topics will be covered: first, the magnitude of crime and violence in the region; second, root causes of the crisis; third, how crime and violence are affecting Latin America's development and democratic stability; and finally, the major reforms undertaken by Latin American countries to cope with violence and crime, focusing on the most promising of these policies and programs. Students may not receive credit for GPPA 451 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 460",
  "title": "Modeling Environmental Systems",
  "unit": "4",
  "description": "This is a core skills course meant to bring students into basic modeling of natural-human systems. The goals are for students to be able to build and use models with an emphasis on structure over specific applications; to develop a comfort with \"back of the envelope\" estimations; and most centrally, for students to be able to frame decisions in a way that lets them interface with disciplinary scientists and engineers.",
  "prerequisite": "GPCO 407 and GPEC 446."
 },
 {
  "code": "GPPA 463",
  "title": "Fundamentals of Energy Systems and Innovation",
  "unit": "4",
  "description": "This course is designed to introduce the fundamentals of the energy system and outline its possible futures, including the science, engineering, and political economy of new technologies. We look at how the system is structured, the imperatives and constraints under which it operates, and how it is likely to evolve given the competing demands it serves and the range of challenges facing its technologies. A key focus of the course is innovation in creating new opportunities. Students may not earn credit for GPPA 463 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 465",
  "title": "Environmental Law and Policy",
  "unit": "4",
  "description": "The course provides a survey of environmental law as both common law (judge- made) and statutory/regulatory law. We begin with traditional environmental common law tort claims—nuisance, negligence, trespass, then move to major environmental statutes—Clean Air Act, Clean Water Act, Endangered Species Act, Superfund, National Environmental Policy Act, and others. We also cover some concepts in Administrative and Constitutional Law. Students may not earn credit for GPPA 465 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPA 467",
  "title": "Chinese Environmental and Energy Policy",
  "unit": "4",
  "description": "This course will focus on three dimensions of Chinese environmental and energy policy. First, we will introduce the causes and consequences of environmental and energy problems. Second, we will examine Chinese environmental and energy governance: institutions, laws, and regulations for environmental protection, energy production and consumption. Third, we will explore the practices of the Chinese government to address the emerging environmental and energy options, focusing on climate change. Renumbered from IRGN 467. Students may not receive credit for GPPA 467 and IRGN 467.",
  "prerequisite": null
 },
 {
  "code": "GPPA 472",
  "title": "Latin American Environmental and Energy Policy",
  "unit": "4",
  "description": "This course examines the human dimension of environmental change, focusing on topics such as biodiversity conservation, climate change, land use systems, deforestation, and the institutions of regulation. The course uses Latin America as its central focus but, for comparative perspective, uses cases from Asia and Africa. Non-GPS students may enroll with consent of instructor. Renumbered from IRGN 472. Students may not receive credit for GPPA 472 and IRGN 472.",
  "prerequisite": null
 },
 {
  "code": "GPPA 477",
  "title": "Cyber Security",
  "unit": "4",
  "description": "Course on the challenges of improving cyber security in the United States and globally. Topics to include the technical challenges involving cyber security, an understanding of the range of threats, fundamental problems of designing prudent national policies that are politically feasible, and the possibilities and limitations regarding the designing of prudent cooperative strategies. Renumbered from IRGN 477. Students may not receive credit for GPPA 477 and IRGN 477.",
  "prerequisite": null
 },
 {
  "code": "GPPA 483",
  "title": "Food Security",
  "unit": "4",
  "description": "The course will introduce students to the world food economy and its drivers. The first part of the course will consider the forces governing food prices and supply. The second part uses quantitative assessment of policy changes. The third part frames future constraints to food security. Renumbered from IRGN 483. Students may not receive credit for GPPA 483 and IRGN 483. Recommended preparation: GPCO 454, knowledge of regression analysis, and STATA.  ",
  "prerequisite": null
 },
 {
  "code": "GPPS 400",
  "title": "International Relations of Asia-Pacific",
  "unit": "4",
  "description": "International relations and developing international political economies of nations bordering the Pacific. Topics include the \"Pacific Basin\" concept; the United States and \"hegemonic-stability\" theory; legacies of the Korean War and Sino-Soviet dispute; immigration patterns and their consequences; and Japan's foreign policy. Renumbered from IRGN 400. Students may not receive credit for GPPS 400 and IRGN 400.",
  "prerequisite": null
 },
 {
  "code": "GPPS 401",
  "title": "The New \"New\" Civil Wars",
  "unit": "4",
  "description": "Post-2003 civil wars are different from previous ones in striking ways. First, the majority are situated in Muslim-majority countries. Second, most of the rebel groups espouse radical Islamist ideas. Third, of these groups, most are pursuing transnational rather than national goals. Current theory explains a great deal, but not everything. For example, it does not account for information and communication technology. These innovations are critical to understanding the new civil wars. Renumbered from IRGN 401. Students may not receive credit for GPPS 401 and IRGN 401.",
  "prerequisite": null
 },
 {
  "code": "GPPS 402",
  "title": "International Political Economy: Money and Finance",
  "unit": "4",
  "description": "This course uses major banking, debt, and currency crises as lenses for focusing on the governance of international monetary and financial relations. It traces regional and global exchange regimes and cross-border financial flows beginning with the gold standard and Great Depression through the rise of regional currency blocs, the Euro, and the role of \"reserve currencies.\" The course concludes by investigating the politics and distributional consequences of banking and financial regulation. Renumbered from IRGN 402. Students may not receive credit for IRGN 402 and GPPS 402.",
  "prerequisite": null
 },
 {
  "code": "GPPS 403",
  "title": "Chinese Security, Technology, and Innovation",
  "unit": "4",
  "description": "This course examines China’s efforts to become a world-class technological and military power, focusing on the technological foundations of its security as it relates to long-term economic and strategic competitiveness and the sources of its growing technological innovation. Topics will include Imperial and Maoist legacies; political economy of security and technology; ideologies and organizing strategies that China employs in moving up the innovation ladder; and others. Renumbered from IRGN 403. Students may not receive credit for IRGN 403 and GPPS 403.",
  "prerequisite": null
 },
 {
  "code": "GPPS 404",
  "title": "Chinese Politics",
  "unit": "4",
  "description": "This course will analyze post-1949 Chinese politics, including political institutions, the policy making process, and citizen political behavior. Special attention will be given to the prospects for political reform in China. Renumbered from IRGN 404. Students may not receive credit for IRGN 404 and GPPS 404.",
  "prerequisite": null
 },
 {
  "code": "GPPS 405",
  "title": "US-China Relations",
  "unit": "4",
  "description": "Can the United States and China manage to develop a constructive relationship or are they headed toward a hostile relationship? This course addresses this question by examining the domestic and international influences on the foreign policies of both countries and key issues in the bilateral relationship. Students also do policy projects. Renumbered from IRGN 405. Students may not receive credit for IRGN 405 and GPPS 405.",
  "prerequisite": null
 },
 {
  "code": "GPPS 406",
  "title": "China in the Global Economic Order",
  "unit": "4",
  "description": "China's role in the global economy and its implications for regimes of global governance. Topics include trade, lending, investments, the globalization of state-owned enterprises, currency internationalization, participation in regional and international organizations, and China's economic diplomacy and foreign policy. We will ask whether China contributes to or threatens the liberal economic order; what governments and policy actors can do to engage China in a productive and peaceful fashion. Students may not receive credit for GPPS 406 and the IRGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 407",
  "title": "The International Relations and National Security of China",
  "unit": "4",
  "description": "This course examines the nature, evolution, dynamics, and key elements of China’s approach and engagement with the international system, especially in the twenty-first century, with a focus on national security and defense. Topics include understanding the structure and process of Chinese decision making; the nature of Chinese policies and strategies; the evolution of Chinese military power; the rise of the Chinese national security state; Chinese grand strategy, and US-China relations. May not receive credit for GPPS 407 and the IRGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 408",
  "title": "Korean Security",
  "unit": "4",
  "description": "This course will consider major security issues on the Korean peninsula, including the evolution of the US-South Korea alliance and the management of the current nuclear crisis. A distinctive feature of the course will be a consideration of the political economy of recent developments on the peninsula, particularly with respect to North Korea, and an extended discussion of the logic and strategy of engagement. Renumbered from IRGN 408. Students may not receive credit for IRGN 408 and GPPS 408.",
  "prerequisite": null
 },
 {
  "code": "GPPS 410",
  "title": "Corporate Governance",
  "unit": "4",
  "description": "Why do corporate governance systems—the way firms are run, the relationships among managers, stockholders, and workers—differ widely around the world? This course examines the various explanations for these striking differences and the consequences. Renumbered from IRGN 410. Students may not receive credit for IRGN 410 and GPPS 410.",
  "prerequisite": null
 },
 {
  "code": "GPPS 416",
  "title": "Postwar Politics in Japan",
  "unit": "4",
  "description": "Overview of postwar politics in Japan, including American Occupation reforms, political institutions, major political factors, mass and elite, and political behavior. Special attention will be paid to the issue of Japan's changing democracy. Renumbered from IRGN 416. Students may not receive credit for IRGN 416 and GPPS 416.",
  "prerequisite": null
 },
 {
  "code": "GPPS 417",
  "title": "International Political Economy: Trade and Investments",
  "unit": "4",
  "description": "Examination of the effects of national governments and international collaboration on global trade and investments, with a focus on the roles of national trade policies, international institutions such as the WTO, free trade areas, bilateral investment treaties, and multinational corporations. Implications of trade and investment are also considered for international development and emerging economic powers.",
  "prerequisite": null
 },
 {
  "code": "GPPS 418",
  "title": "The Political Economy of State Capacity",
  "unit": "4",
  "description": "How do states develop the ability to carry out public policies? This course examines forces that shape the origins of the state, its form, and ability to implement policies, such as taxation. We explore the implications of state capacity for economic development. The course highlights the importance of evidence in adjudicating between competing explanations about the causes and consequences of state capacity. Students may not receive credit for GPPS 418 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 420",
  "title": "Workers and Labor in Global Markets",
  "unit": "4",
  "description": "This course focuses on the relationships between workers, employers, and governments in global supply chains. How is work and labor regulated in various industries and parts of the world? How has this changed over time? When have workers become important political forces and how have governments and capital owners responded? How and why? What will the future of work look like? May not receive credit for GPPS 420 and the IRGN 490 course with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 421",
  "title": "The Politics of Economic Inequality",
  "unit": "4",
  "description": "The importance of inequality in income, wealth, and access to resources and opportunities can hardly be overstated. This course has several objectives: (1) to understand the measurement of inequality; (2) to understand the level of inequality in the United States versus other industrialized nations; (3) to see how political scientists and economists understand its causes and effects; (4) to understand why some think inequality is to their advantage; (5) to develop the tools and data for normative evaluations. May not receive credit for GPPS 421 and the IRGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 423",
  "title": "Corporate Social Responsibility",
  "unit": "4",
  "description": "Nongovernmental organizations monitor compliance with norms through shareholder activism, consumer pressures, political protest, creating \"brands,\" and legal action. Course examines these strategies to determine what works best, and how organizations and individuals can influence corporations to \"do the right thing.\" Renumbered from IRGN 423. Students may not receive credit for IRGN 423 and GPPS 423.",
  "prerequisite": null
 },
 {
  "code": "GPPS 427",
  "title": "International Law and Regulation",
  "unit": "4",
  "description": "This course will introduce students to the major techniques for managing international problems through legal and administrative regulation. The class will offer an overview of the main theories relevant to policy, such as the choice and design of treaties and other legal instruments. Cases will be drawn from economics, finance, development, security, human rights, and environment. Renumbered from IRGN 427. Students may not receive credit for IRGN 427 and GPPS 427.",
  "prerequisite": null
 },
 {
  "code": "GPPS 428",
  "title": "The Politics of Energy and Environmental Regulation",
  "unit": "4",
  "description": "The class introduces students to major theoretical perspectives that are used to show how societies design and implement policies related to energy and applies these theories to major issues in energy policy, including ethanol, climate change, and energy security. Renumbered from IRGN 428. Students may not receive credit for GPPS 428 and IRGN 428.",
  "prerequisite": null
 },
 {
  "code": "GPPS 429",
  "title": "Geopolitics, Insurgency, and Weak States",
  "unit": "4",
  "description": "This course acquaints students with the leading theories on the causes and consequences of civil war since 1945 and the challenges associated with rebuilding social structures after catastrophic collapse. It will also provide a number of hands-on examples of how \"new media\" work to speed the process of political mobilization, coalition formation, the persistence of clandestine networks, and issues of transparency and translation, with particular implications for urban warfare and insurgency. Renumbered from IRGN 429. Students may not receive credit for GPPS 42 and IRGN 429.",
  "prerequisite": null
 },
 {
  "code": "GPPS 430",
  "title": "Human Rights, Public Policy, and International Relations",
  "unit": "4",
  "description": "Prepares students to analyze the causes of repression and the effectiveness of political intervention. Attention will focus on the evaluation of the design, implementation, and effectiveness of human rights policy, including international organizations, democracy, trade, and social movement advocacy. Renumbered from IRGN 430. Students may not receive credit for GPPS 430 and IRGN 430.",
  "prerequisite": null
 },
 {
  "code": "GPPS 433",
  "title": "Debating US Security Policy",
  "unit": "4",
  "description": "Course engages central debates regarding US grand strategy and encourages analysis of regional crisis-spots using replicable open-source data. Emphasis is on deploying theoretical arguments in the service of a policy agenda and tensions between rival schools of theory in the context of contemporary politics. Topics include nuclear nonproliferation, humanitarian military interventions, democracy promotion, \"War on Terror,\" and policy toward \"rogue\" and unrecognized states. Renumbered from IRGN 433. Students may not receive credit for GPPS 433 and IRGN 433.",
  "prerequisite": null
 },
 {
  "code": "GPPS 434",
  "title": "Humanitarian Interventions",
  "unit": "4",
  "description": "This course encourages sustained debate about US interventions into conflict and post-conflict settings abroad since the end of the Cold War. We will consider the broad trends in international politics, with particular focus on the nature of \"unipolarity,\" \"responsibility to protect,\" and the politics of border regions. We will look at both governmental and nongovernmental actors. Renumbered from IRGN 434. Students may not receive credit for GPPS 434 and IRGN 434.",
  "prerequisite": null
 },
 {
  "code": "GPPS 435",
  "title": "State-Building and Modeling State Capacity",
  "unit": "4",
  "description": "The search for the \"root cause\" of legitimate state capacity is a central question in political science. The entry-point for course analysis will be the causes and consequences of civil war since 1945, and the challenges associated with rebuilding social structures after catastrophic violent collapse. We will read historical literature and theories that purport to account for variation and isomorphism in stable state structures across time. Abilities in advanced STATA or R, and GIS are recommended. Students may not earn credit for GPPS 435 and GPGN 490 with the same title.",
  "prerequisite": "GPCO 453 and GPCO 454 or consent of instructor."
 },
 {
  "code": "GPPS 436",
  "title": "Counterinsurgency and Counterterrorism",
  "unit": "4",
  "description": "This course will acquaint students with prominent theories of counterinsurgency and counterterrorism and the gap between theory and practice; content of twentieth-century ideologies that explicitly authorize terrorist violence; and readings that probe the efficacy of leadership decapitation strategies, inherent trade-offs between prevention policies and civil liberties, the problems of multiple principals, nonaccountable agents, and strategies for managing grievances. Students may not earn credit for GPPS 436 and the GPGN 490 course with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 438",
  "title": "Central Issues in International Peace and Security",
  "unit": "4",
  "description": "This class has two goals. The first is to give students the analytic tools needed to explain why individuals, organizations, and states behave the way they do and why they choose certain actions over others. The second is to apply these tools to major policy challenges in the world today. These challenges likely include interstate and civil war, nuclear proliferation, terrorism, climate change, and the rise of artificial intelligence in conflict.",
  "prerequisite": null
 },
 {
  "code": "GPPS 441",
  "title": "Government and Regulation",
  "unit": "4",
  "description": "This course goes beyond the debates of the role of the market and the state in the process of economic growth and political development, seeking to provide an understanding of the complex interaction between political incentives, regulatory decisions, and their implementation. Non-GPS graduate students may enroll with consent of instructor. Students may not receive credit for both renumbered from IRGN 441. Students may not receive credit for GPPS 441 and IRGN 441.",
  "prerequisite": null
 },
 {
  "code": "GPPS 442",
  "title": "Foundations of Strategic Studies",
  "unit": "4",
  "description": "This course surveys the major contours of intellectual debates and conceptual frameworks that structure the field of international security studies. It introduces students to important strategic thinkers in order to analyze issues in the use of force. Topics include the development of strategic thought, theories on the course of war, the organizational and political nature of militaries, assessment of military effectiveness, and the peculiar problems of nuclear and unconventional warfare. Renumbered from IRGN 442. Students may not receive credit for GPPS 442 and IRGN 442.",
  "prerequisite": null
 },
 {
  "code": "GPPS 443",
  "title": "U.S. National Security and Decision Making",
  "unit": "4",
  "description": "The course provides a practitioner’s perspective on the methodologies of and influences on decision making in the US national security apparatus. It provides the skills for analyzing the interactions among the executive, legislative, interagency stakeholders, the media, intelligence community, and the military and its supporting industrial complex. We will look at decisional influences and biases that led to key national security decisions, beginning with the 1947 National Security Act. Students may not earn credit for both GPPS 443 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 444",
  "title": "A History of Warfare",
  "unit": "4",
  "description": "Why does the conduct of war often outstrip the policy maker's ability to optimize outcomes? This course is an examination of combatants, their doctrine, tactics, technology, and factors such as geography, and how these influence results on the battlefield. We will take the historical long view and ask this question in terms of the evolution of warfare as well. This course provides a contextual basis with respect to armed conflict for the policy student. Students may not earn credit for GPPS 444 and the GPGN 490 course with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 445",
  "title": "Cuba: Revolution and Reform",
  "unit": "4",
  "description": "This course focuses on contemporary Cuba, its politics, economics, and foreign policy, and assesses the social gains of the revolution and the challenges of reforming socialism. The course also takes a brief look at the origins of the revolution and the role of Castro, explores Cuba-related social media, and examines current US-Cuba relations. Recommended preparation: Spanish proficiency is recommended. Renumbered from IRGN 445. Students may not receive credit for GPPS 445 and IRGN 445.",
  "prerequisite": null
 },
 {
  "code": "GPPS 446",
  "title": "Democratization in Latin America",
  "unit": "4",
  "description": "This course examines the interplay between structural factors, institutions, and key actors in politics and society in order to understand the democratization of and contemporary democratic politics in Latin America. May not receive credit for GPPS 446 and the IRGN 490 course with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 448",
  "title": "Civil Society and Development",
  "unit": "4",
  "description": "To explore the roles that civil society/NGOs/the third sector can play in advancing political, social, and economic progress in developing countries. To consider the strengths and weaknesses, capacities, and limitations of NGOs in developing countries. To provide students with experience in evaluating NGOs and in making professional recommendations to enhance their ability to make a difference. To prepare students to take leadership roles—whether in government, the private sector, or NGOs—in promoting civil-society participation in development. Renumbered from IRGN 448. Students may not receive credit for GPPS 448 and IRGN 448.",
  "prerequisite": null
 },
 {
  "code": "GPPS 449",
  "title": "The Making of US Foreign Policy",
  "unit": "4",
  "description": "Analysis of the interests, structure, and procedures of the main executive branch agencies involved in the formulation of foreign policy, and of the roles of Congress, the media, public opinion, and nongovernmental actors. Case studies and \"daily briefings\" to prepare students to perform professionally in the foreign policy arena. Renumbered from IRGN 449. Students may not receive credit for GPPS 449 and IRGN 449.",
  "prerequisite": null
 },
 {
  "code": "GPPS 450",
  "title": "The Political Economy of Foreign Aid",
  "unit": "4",
  "description": "The course is designed to develop the analytical tools to assess how foreign aid is allocated and whether it is effective. We will ask the following key questions: (1) Why do states give foreign aid?; (2) Is foreign aid effective?; (3) How do donors allocate foreign aid?; (4) What are the differences between bilateral and multilateral aid?; and, (5) Are there unintended consequences of foreign aid? The readings will consist of both seminal and recent works in political science and economics. May not receive credit for GPPS 450 and the IRGN 490 with the same course title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 451",
  "title": "Public Opinion and Foreign Policy",
  "unit": "4",
  "description": "This course investigates how the public forms opinions about foreign policy and the various means, both direct and indirect, through which public opinion can influence the policy-making process. We consider such issues as: How does the public learn about foreign policy? Do they care about it? If so, under what circumstances will political leaders be responsive to the public’s preferences? Do politics really stop at the water’s edge? Should public opinion have a role in foreign policy? May not receive credit for GPPS 451 and the IRGN 490 with the same course title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 453",
  "title": "Contemporary US-Mexico Relations",
  "unit": "4",
  "description": "Course explores the complex, dynamic, and asymmetrical bilateral relations between the U.S. and Mexico. Topics include immigration, trade, security, the border, and energy. We will go beyond theory to favor a policy-making approach and consider the decision-making processes on both sides of the border and the alternatives officials often seek. Students may not receive credit for GPPS 453 and GPGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 454",
  "title": "Current Issues in US-Latin American Relations",
  "unit": "4",
  "description": "Issues to be actively debated include the collective defense of democracy, coping with revolutionary change, counter-narcotics, anti-corruption, international finance, trade, and US-Mexican and US-Brazilian relations. In each case, students analyze the strengths and weaknesses of current US policy and advocate alternative options. Renumbered from IRGN 454. Students may not receive credit for GPPS 454 and IRGN 454.",
  "prerequisite": null
 },
 {
  "code": "GPPS 455",
  "title": "Financing the Chinese Miracle",
  "unit": "4",
  "description": "This course investigates both the risks and the institutional and political underpinnings of financial deepening and financial repression in China. Students will keep track of the latest financial developments in China and learn to predict which will have consequences for the future evolution of the Chinese financial system. Renumbered from IRGN 455. Students may not receive credit for GPPS 455 and IRGN 455.",
  "prerequisite": null
 },
 {
  "code": "GPPS 456",
  "title": "Evaluating Social Programs",
  "unit": "4",
  "description": "Introduction to elements of program and policy design and evaluation. Examines principles and guidelines used in creating a program/policy and evaluating its success or failure. International case studies are explored. Students have the opportunity to develop their own program and evaluate projects. Students will not be allowed credit for both GPPS 456 Program Design and Evaluation and GPPS 456 Evaluating Social Programs.",
  "prerequisite": "GPCO 454 or consent of instructor."
 },
 {
  "code": "GPPS 460",
  "title": "The Politics of US-Japan Economic Relations",
  "unit": "4",
  "description": "This course will analyze how the domestic politics of each country, their international negotiations, and their interaction concerning economic issues have affected the US-Japan relationship. Both the politics of cooperation and integration, and trade friction and conflict will be addressed in part through study of specific cases. Renumbered from IRGN 460. Students may not receive credit for GPPS 460 and IRGN 460.",
  "prerequisite": null
 },
 {
  "code": "GPPS 463",
  "title": "Politics of Southeast Asia",
  "unit": "4",
  "description": "This course provides an introduction to five Southeast Asian countries: Indonesia, Thailand, Malaysia, the Philippines, and Vietnam. The focus will be on the national level of political and economic issues in these countries. In addition, a number of region-wide issues will also be examined such as: Chinese business groups and networks; clientelism and corruption; regional trade and investment linkages; democratization; and the implications of political change for future economic development. Renumbered from IRGN 463. Students may not receive credit for GPPS 463 and IRGN 463.",
  "prerequisite": null
 },
 {
  "code": "GPPS 465",
  "title": "Management of Nonprofit Organizations",
  "unit": "4",
  "description": "Analyzes the particular environment in which nonprofit organizations define and achieve their objectives. Management tools are applied to existing nonprofits and to student projects. Renumbered from IRGN 465. Students may not receive credit for GPPS 465 and IRGN 465.",
  "prerequisite": null
 },
 {
  "code": "GPPS 466",
  "title": "Managing Mission-Driven Organizations",
  "unit": "4",
  "description": "Course explores the various organizational structures, funding sources, and outcome accountability requirements for civil society organizations, and examines legal and data-driven evaluation approaches to maximize social and environmental impact. Case studies to be drawn from international development, human rights, environmental sustainability, and American politics; nonprofit service delivery organizations, social enterprises, social impact bonds, issue advocacy groups, and others. Students may not earn credit for GPPS 466 and IRGN 490 with the same title.",
  "prerequisite": null
 },
 {
  "code": "GPPS 469",
  "title": "Comparative Grand Strategy and Defense Policy",
  "unit": "4",
  "description": "This course surveys theoretical explanations for why states choose the strategies they do and how they implement their diplomatic and military policies in order to carry out those strategies. Different explanatory factors are found in the international system, domestic politics, and the political- economy of military power, and they can interact in surprising ways. These general theories are examined through comparative analysis of the great World War II powers and the contemporary strategic debate. Renumbered from IRGN 469. Students may not receive credit for GPPS 469 and IRGN 469.",
  "prerequisite": null
 },
 {
  "code": "GPPS 473",
  "title": "Political Economy of Energy in Asia",
  "unit": "4",
  "description": "This course examines the political economy of energy in Asia across a number of key themes, including the interaction between the economics and politics of energy markets, the search for energy security through cooperation and competition, the challenges of managing difficult energy policy choices and trade-offs, and the challenges of sustainable energy development. Emphasis will be placed on the oil industry and its pivotal role in global energy use, pricing, and geopolitics. Renumbered from IRGN 473. Students may not receive credit for GPPS 473 and IRGN 473.",
  "prerequisite": null
 },
 {
  "code": "GPPS 476",
  "title": "Chinese Sources and Methods",
  "unit": "4",
  "description": "This course involves intense engagement with original Chinese sources as a way to explore the evolution of the Chinese Communist Party and the contemporary Chinese economy. Students will be exposed to government, media, and statistical sources. Recommended preparation: At least second-year, college- level proficiency in Mandarin Chinese is expected. Renumbered from IRGN 476. Students may not receive credit for GPPS 476 and IRGN 476.",
  "prerequisite": null
 },
 {
  "code": "GPPS 478",
  "title": "Japanese Foreign Policy",
  "unit": "4",
  "description": "Examines the domestic and strategic sources of Japan's foreign policy in the postwar era. Unlike IRGN 460, this course emphasizes Japan's foreign economic policy in regional and global multilateral organizations, and the major security issues it confronts with its Asian neighbors. Renumbered from IRGN 478. Students may not receive credit for GPPS 478 and IRGN 478.",
  "prerequisite": null
 },
 {
  "code": "GPPS 479",
  "title": "Politics and Institutions in Latin America",
  "unit": "4",
  "description": "Overview of Latin American politics and the \"rules of the game,\" both formal and informal. Key topics include military rule, presidentialism, and clientelism in the region as a whole, with special emphasis on Argentina, Brazil, Chile, and Mexico. Renumbered from IRGN 479. Students may not receive credit for GPPS 479 and IRGN 479.",
  "prerequisite": null
 },
 {
  "code": "GPPS 481",
  "title": "The Political Economy of Authoritarian Regimes",
  "unit": "4",
  "description": "Are authoritarian regimes fundamentally different from democratic ones? If so, how are they different and what are the political and economic implications of such differences? This course will explore the different logics of authoritarian politics, followed by an investigation of the growth and inequality implications of those politics. Renumbered from IRGN 481. Students may not receive credit for GPPS 481 and IRGN 481.",
  "prerequisite": null
 },
 {
  "code": "GPPS 484",
  "title": "Korean Politics",
  "unit": "4",
  "description": "This course will examine characteristics and distinctive aspects of contemporary Korean society and politics. Emphasis will be placed on continuity and change in social values, political culture and leadership, economic growth and its impact, and democratization and its future prospects. Renumbered from IRGN 484. Students may not receive credit for GPPS 484 and IRGN 484.",
  "prerequisite": null
 },
 {
  "code": "GPGN 490",
  "title": "Special Topics in Pacific International Affairs",
  "unit": "4",
  "description": "A seminar course at an advanced level on a special topic in Pacific international affairs. May be repeated for credit.",
  "prerequisite": null
 },
 {
  "code": "GPGN 491",
  "title": "Cross-Disciplinary Special Topics",
  "unit": "4",
  "description": "A seminar course at an advanced level on a special topic. These seminars are intended to cross disciplines and to be co-taught by GPS faculty and faculty from other departments or programs.",
  "prerequisite": null
 },
 {
  "code": "GPGN 493",
  "title": "Excel Skills for Professional Proficiency",
  "unit": "2",
  "description": "An Excel skills course tailored specifically to GPS classes and applicable to accounting, QM, finance, and second-year courses such as corporate finance, investments, applied financial management, and strategy and negotiation, among others. The course is also designed to help prepare students for the professional world by training in critical job skills competencies in Excel. (S/U grades only.) Department approval required. Non-GPS students may enroll with consent of instructor. Renumbered from IRGN 493. Students may not get credit for GPGN 493 and IRGN 493.",
  "prerequisite": null
 },
 {
  "code": "GPGN 494",
  "title": "Special Topics in Remote Sensing and Data Analytics",
  "unit": "4",
  "description": "The course allows students to explore different areas of research that require the use of Geographic Information System (GIS), Remote Sensing, and the hard skills of data analytics. Topics will vary from year to year, but may include urban development, environmental and climate change, changes in land usage, and others. May be taken for credit up to two times. Students may receive a combined total of eight units for GPGN 494 and/or a GPGN with the same topic area.",
  "prerequisite": "GPEC 444 or consent of instructor."
 },
 {
  "code": "GPGN 496",
  "title": "Washington Quarter Internship",
  "unit": "4",
  "description": "Independent research that draws on a substantive internship with an organization relevant to a student's career interests. The nature of the final project will be determined prior to assuming the internship and in consultation with the supervising professor. (S/U grades only.)",
  "prerequisite": null
 },
 {
  "code": "GPGN 497",
  "title": "Internship",
  "unit": "2",
  "description": "Independent research that draws on an internship with an organization relevant to career track and/or regional specialization. Nature of the required product to be determined by professor supervising the course. May be repeated for credit.",
  "prerequisite": null
 },
 {
  "code": "GPGN 498",
  "title": "Directed Group Study",
  "unit": "2",
  "description": "Directed reading in a selected area. The content of each course is to be decided by the professor directing the course with the approval of the student's faculty adviser. May be repeated for credit.",
  "prerequisite": null
 },
 {
  "code": "GPGN 499",
  "title": "Independent Research",
  "unit": "2-12",
  "description": "Independent research under the guidance of a faculty member of GPS. May be repeated for credit.",
  "prerequisite": null
 },
 {
  "code": "GPLA 460A-B-C",
  "title": "Basic Bahasa Indonesia for Professional Proficiency",
  "unit": "4-4-4",
  "description": "This course is designed to enable students with basic knowledge and skills of Bahasa Indonesia to further develop communicative skills through a combination of classes, exercises, and other language experiences. Renumbered from IRLA 460A-B-C. Students may not get credit for any IRLA 460 course and the GPLA course of the same number and quarter designation.",
  "prerequisite": null
 },
 {
  "code": "GPEC 243",
  "title": "GIS and Spatial Data Analysis",
  "unit": "4",
  "description": "This course provides an introduction to GIS and spatial data analysis for applied social science research. Students will work in ArcGIS to manipulate different types of georeferenced data, visualize data, import/export data from Excel and STATA, and conduct spatial analysis. Course looks to motivate geography as an important lens through which to study society. Recommended preparation: Basic knowledge of statistics and regression (ordinary least squares) is assumed, as is familiarity with STATA. Students may not receive credit for GPEC 243 and IRGN 443. May be coscheduled with GPEC 443.",
  "prerequisite": null
 },
 {
  "code": "GPEC 244",
  "title": "Advanced GIS and Remote Sensing",
  "unit": "4",
  "description": "Students will learn to design and maintain geospatial databases, validate the topology of a dataset, and produce clear and informative maps and reports. Part two will be dedicated to principles of remote sensing and to analysis of satellite imagery: geospatial database design and maintenance, topology validation and topological rules, the network analyst extension, the surface tool set, basic concepts of remote sensing, and introduction to Google Earth Engine UI and Google Earth Engine API. Previously taught as an IRGN 290, Special Topics course. Students may not receive credit for GPEC 244 and IRGN 290 or IRGN 490 with the same title. May be coscheduled with GPEC 444.",
  "prerequisite": null
 },
 {
  "code": "GPEC 246",
  "title": "Applied Data Analysis and Statistical Decision Making",
  "unit": "4",
  "description": "The goal of the course is to teach how to evaluate quantitative information in business and economics contexts, and to make sound managerial decisions in complex situations. Most of the problems and the course work will involve statistical software and spreadsheet analysis of data. The course covers various applied multivariate statistical methods beyond the basics. Renumbered from IRGN 240. Students may not receive credit for GPEC 246 and IRGN 240. May be coscheduled with GPEC 446.",
  "prerequisite": null
 },
 {
  "code": "GPEC 286",
  "title": "Economic and Social Development of China",
  "unit": "4",
  "description": "This course examines China's development experience from a generally economic standpoint. Contents include patterns of traditional Chinese society and economy; geography and resource constraints, impact of the West and Japan; development since 1949, and contemporary problems and options. Renumbered from IRGN 260. Students may not receive credit for GPEC 286 and IRGN 260. May be coscheduled with GPEC 486.",
  "prerequisite": null
 },
 {
  "code": "GPPS 204",
  "title": "Chinese Politics",
  "unit": "4",
  "description": "This course will analyze post-1949 Chinese politics, including political institutions, the policy-making process, and citizen political behavior. Special attention will be given to the prospects for political reform in China. Renumbered from IRGN 261. Students may not receive credit for GPPS 204 and IRGN 261. May be coscheduled with GPPS 404.",
  "prerequisite": null
 },
 {
  "code": "GPPS 256",
  "title": "Program Design and Evaluation",
  "unit": "4",
  "description": "Introduction to elements of program design and evaluation. Examines principles and guidelines used in creating a program and evaluating its success or failure. International case studies are explored. Students have the opportunity to develop their own program and evaluate projects. Renumbered from IRGN 256. Students may not receive credit for GPPS 256 and IRGN 256. May be coscheduled with GPPS 456.",
  "prerequisite": null
 }
]