[
 {
  "code": "HDS 1",
  "title": "Introduction to Human Developmental Sciences",
  "unit": "4",
  "discription": "This course introduces students to the central issues in the basic areas in human development. The course will explain relationships between biological, cognitive, social, and cultural aspects of development across the life span. Renumbered from HDP 1. Students may not receive credit for HDP 1 and HDS 1.",
  "prerequsite": null
 },
 {
  "code": "HDS 60",
  "title": "Introduction to Statistical Analysis",
  "unit": "4",
  "discription": "This course provides an introduction to both descriptive and inferential statistics, core tools in the process of scientific discovery, and the interpretation of research. Emphasis on a conceptual understanding of statistics, numerical results of real data, and techniques of data analysis.",
  "prerequsite": null
 },
 {
  "code": "HDS 95",
  "title": "Career Development Seminar",
  "unit": "1–2",
  "discription": "This course is centered on conceptual understanding of career development as a lifespan process, with an emphasis on application to student's individual academic development and career readiness competencies. Includes practical training with professional skills, networking, and career research. The course concludes with a career action plan to help students advance academic and career goals. Cannot be used toward HDS major credit.",
  "prerequsite": null
 },
 {
  "code": "HDS 98",
  "title": "Directed Group Study",
  "unit": "1–2",
  "discription": "Directed group study, on a topic or in a field not included in the department curriculum, by arrangement with a faculty member. Pass/No Pass grades only. Cannot be used toward HDS major credit. Renumbered from HDP 98. HDS 98 and/or HDP 98 may be taken for credit for a combined total of three times.",
  "prerequsite": "completion of thirty units and a minimum UC San Diego GPA of 3.0. Students may enroll for no more than a total of two units in one quarter. Department authorization required."
 },
 {
  "code": "HDS 99",
  "title": "Independent Study in Human Developmental Sciences",
  "unit": "2–4",
  "discription": "Independent study and research under the direction of an affiliated human developmental sciences faculty member. Pass/No Pass only. Cannot be used toward HDS major credit. Renumbered from HDP 99. HDS 99 and/or HDP 99 may be taken for credit for a combined total of three times.",
  "prerequsite": "completion of thirty units and a minimum UC San Diego GPA of 3.0. Department authorization required."
 },
 {
  "code": "HDS 110",
  "title": "Brain and Behavioral Development",
  "unit": "4",
  "discription": "The purpose of this course is to familiarize students with basic mechanisms of brain and behavioral development from embryology through aging. Multiple levels of analysis will be discussed, including the effects of hormones on behavior, developmental events at the level of cells, structures, and neural systems, and the neural basis of cognition, social, perceptual, and language development. Renumbered from HDP 110. Students may not receive credit for HDP 110 and HDS 110.",
  "prerequsite": "HDP 1 or HDS 1 or PSYC 101."
 },
 {
  "code": "HDS 111",
  "title": "Evolutionary Principles in Human Development",
  "unit": "4",
  "discription": "The course will examine the human evolutionary past to inform our understanding of the biological, cognitive, and socio-cultural aspects of growth and change across the life span. Lectures and readings will draw from diverse fields to situate our understanding of human development within its broader evolutionary context. Areas of focus will include but are not limited to human longevity, biology of growth, theory of mind, and social and biological development in cross-species comparison. Renumbered from HDP 111. Students may not receive credit for HDP 111 and HDS 111.",
  "prerequsite": "HDP 1 or HDS 1 or ANTH 2 or BILD 3."
 },
 {
  "code": "HDS 120",
  "title": "Language Development",
  "unit": "4",
  "discription": "Examination of children's acquisition of language from babbling to the formation of sentences. Topics covered include prelinguistic gestures, relationships between babbling and sound systems, speech perception, linking words with objects, rule overgeneralization, bilingualism, nature vs. nurture, individual differences, and cultural differences. Renumbered from HDP 120. Students may not receive credit for HDP 120 and HDS 120.",
  "prerequsite": "HDP 1 or HDS 1 or LIGN 4."
 },
 {
  "code": "HDS 121",
  "title": "The Developing Mind",
  "unit": "4",
  "discription": "(Same as COGS 110.) This course examines changes in thinking and perceiving the physical and social world from birth through childhood. Evidence of significant changes in encoding information, forming mental representations, and solving problems is culled from psychological research, cross-cultural studies, and cognitive science. Cross-listed course HDS 121 has been renumbered from HDP 121. Students may receive credit for one of the following: COGS 110, HDS 121, or HDS 121.",
  "prerequsite": "HDP 1 or HDS 1 or COGS 1."
 },
 {
  "code": "HDS 122",
  "title": "Development of Social Cognition",
  "unit": "4",
  "discription": "This course covers topics in development of social cognition across the life span. Grounded in current research and theoretical models, content addresses general principles such as the mutual influences of caregivers and children upon each other and the interplay of person and context. Discussion areas include attachment, aggression, identity development, social cognition, social components of achievement motivation, and development of conscience. Renumbered from HDP 122. Students may not receive credit for HDP 122 and HDS 122.",
  "prerequsite": "HDP 1 or HDS 1."
 },
 {
  "code": "HDS 133",
  "title": "Cross-Cultural Perspectives on Developmental Science",
  "unit": "4",
  "discription": "This course examines how human development varies cross-culturally across the life span. It explores human developmental science as a bio-social-cultural process, in which development is not simply a product of biology and genetics, but shaped by the particular cultural traditions and patterns of social interactions into which an individual is born. Renumbered from HDP 133. Students may not receive credit for HDP 133 and HDS 133.",
  "prerequsite": "HDP 1 or HDS 1 or PSYC 1."
 },
 {
  "code": "HDS 150",
  "title": "Senior Seminar",
  "unit": "4",
  "discription": "Seminar for graduating HDS seniors. Readings and discussion of special topics in human developmental sciences. Provides advanced-level study on subfields of human development. Topics vary quarterly. Renumbered from HDP 150. HDS 150 and/or HDP 150 may be repeated for a combined total of two times when topics vary.",
  "prerequsite": "senior standing, HDP 181 or HDS 181. Department approval required. (F,W,S)"
 },
 {
  "code": "HDS 160",
  "title": "Special Topics Seminar in Human Developmental Sciences",
  "unit": "4",
  "discription": "Special topics in human developmental sciences are discussed. Renumbered from HDP 160. HDS 160 and/or HDP 160 may be taken for credit for a combined total of three times when topics vary.",
  "prerequsite": "upper-division standing, department approval required."
 },
 {
  "code": "HDS 171",
  "title": "Diversity in Human Development: A Cultural Competency Approach",
  "unit": "4",
  "discription": "This course provides an introduction to the scholarship and practice of cultural competency, with a goal of enhancing the ability of students to be effective researchers and community service partners. Through relevant readings, associated assignments, and community guest speakers, students will acquire the necessary skills for doing substantive and responsive research in diverse cultural contexts. Renumbered from HDP 171. Students may not receive credit for HDP 171 and HDS 171.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "HDS 175",
  "title": "Power, Wealth, and Inequality in Human Development",
  "unit": "4",
  "discription": "Inequality affects social mobility and opportunities for diverse communities in the United States, having long-term implications for life span development. A multidisciplinary approach examines the differential effects on development fostered by disparities in socio-economic, educational, and cultural factors. Renumbered from HDP 175. Students may not receive credit for HDP 175 and HDS 175.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "HDS 181",
  "title": "Experimental Projects in Human Development Research",
  "unit": "6",
  "discription": "This laboratory course in human developmental sciences is designed around a variety of intensive experimental projects. With lectures providing background information on research methods and life span development, each assignment will include data collection and/or analysis, and a written laboratory report. Renumbered from HDP 181. Students may not receive credit for HDP 181 and HDS 181.",
  "prerequsite": "HDS 1 and BIEB 100 or COGS 14B or ECON 120A or MATH 11 or POLI 30 or POLI 30D or PSYC 60. Department approval required. A minimum of three upper-division HDS major courses, at least one in each domain, is needed for enrollment approval. Must be a declared HDS major. (F,W,S)"
 },
 {
  "code": "HDS 191",
  "title": "Field Research in Human Development",
  "unit": "6",
  "discription": "This course is designed around students' applied qualitative Field Research experience. With weekly lectures introducing the basic methodology of human development research, HDS majors are provided the necessary tools to create their own empirical Field Research project, conducted (four hours/week) at a pre-approved study site. Students must submit the pre-enrollment questionnaire one academic year prior to enrollment. See the [HDS website](http://hdp.ucsd.edu/) for details. Renumbered from HDP 191. Students may not receive credit for HDP 191 and HDS 191.",
  "prerequsite": "HDS 1 and HDS 181. Department approval required. (F,W,S)"
 },
 {
  "code": "HDS 193",
  "title": "Advanced Research in Human Developmental Sciences",
  "unit": "4",
  "discription": "Specialized research project under the direction of a human developmental sciences affiliated faculty member. Renumbered from HDP 193. Students may not receive more than a combined total of eight units of credit for HDP 193 and HDS 193.",
  "prerequsite": "upper-division standing; department approval required. Overall GPA of 2.8, one lab course, and three HDS core courses completed."
 },
 {
  "code": "HDS 194A-B-C",
  "title": "Honors Thesis in Human Developmental Sciences",
  "unit": "4-4-4",
  "discription": "Students carry out a three-quarter research project, under the guidance of a faculty member, that will form the basis for their senior honors thesis in the human developmental sciences major. Renumbered from HDP 194A-B-C. Students may not receive credit for HDP 194A-B-C and HDS 194A-B-C.",
  "prerequsite": "overall GPA of 3.2, and a 3.5 GPA for courses taken in the HDS major; an advanced course in statistics or experimental design, department approval, and consent of instructor required."
 },
 {
  "code": "HDS 195",
  "title": "Instructional Apprentice in Human Developmental Sciences",
  "unit": "4",
  "discription": "Introduction to teaching within human developmental sciences. Under the direction of the instructor, students attend lectures, lead discussion sections, review course readings, and meet regularly to prepare course materials and to evaluate examinations and papers. Course not counted toward HDS major or minor. Pass/No Pass only. Renumbered from HDP 195. Students may not receive more than a combined total of eight units of credit for HDP 195 and HDS 195.",
  "prerequsite": "overall GPA of 3.0, 90 units completed, department approval, and consent of instructor required."
 },
 {
  "code": "HDS 199",
  "title": "Independent Study in Human Developmental Sciences",
  "unit": "4",
  "discription": "Independent study and research under the direction of an affiliated human developmental sciences faculty member. Pass/No Pass only. Renumbered from HDP 199. HDP 199 and/or HDS 199 may be taken for credit for a combined total of three times. Cannot be used toward HDS major credit.",
  "prerequsite": "department approval and consent of the instructor required; completion of at least ninety undergraduate units with a minimum of 2.5 GPA, and a completed and approved Special Studies form."
 }
]