[
 {
  "code": "HILD 2A-B-C",
  "title": "United States",
  "unit": "4-4-4",
  "description": "A yearlong lower-division course that will provide students with a background in United States history from colonial times to the present, concentrating on social, economic, and political developments. (Satisfies Muir College humanities requirement and American History and Institutions requirement.)",
  "prerequisite": null
 },
 {
  "code": "HILD 7A-B-C",
  "title": "Race and Ethnicity in the United States",
  "unit": "4-4-4",
  "description": "Lectures and discussions surveying the topics of race, slavery, demographic patterns, ethnic variety, rural and urban life in the United States, with special focus on European, Asian, and Mexican immigration.",
  "prerequisite": null
 },
 {
  "code": "HILD 7A",
  "title": "Race and Ethnicity in the United States",
  "unit": "4",
  "description": "A lecture-discussion course on the comparative ethnic history of the United States. Of central concern will be the African American, slavery, race, oppression, mass migrations, ethnicity, city life in industrial America, and power and protest in modern America.",
  "prerequisite": null
 },
 {
  "code": "HILD 7B",
  "title": "Race and Ethnicity in the United States",
  "unit": "4",
  "description": "A lecture-discussion course on the comparative ethnic history of the United States. Of central concern will be the Asian American and white ethnic groups, race, oppression, mass migrations, ethnicity, city life in industrial America, and power and protest in modern America.",
  "prerequisite": null
 },
 {
  "code": "HILD 7C",
  "title": "Race and Ethnicity in the United States",
  "unit": "4",
  "description": "A lecture-discussion course on the comparative ethnic history of the United States. Of central concern will be the Mexican American, race, oppression, mass migrations, ethnicity, city life in industrial America, and power and protest in modern America.",
  "prerequisite": null
 },
 {
  "code": "HILD 7GS",
  "title": "Race and Ethnicity in the Global World",
  "unit": "4",
  "description": "Lectures and discussions surveying the topics of race, slavery, demographic patterns, ethnic variety, and rural and urban life in the United States, with special focus on European, Asian, and Mexican immigration. Program or materials fees may apply. May be taken for credit up to three times. Students must apply and be accepted into the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HILD 8GS",
  "title": "Race and Ethnicity in the United States",
  "unit": "4",
  "description": "A lecture-discussion course on the comparative ethnic history of the United States. Of central concern will be the Mexican American, race, oppression, mass migrations, ethnicity, city life in industrial America, and power and protest in modern America. Students may not receive credit for HILD 8GS and HILD 7C. Program or materials fees may apply. Students must apply and be accepted into the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HILD 10",
  "title": "East Asia: The Great Tradition",
  "unit": "4",
  "description": "The East Asia survey compares and contrasts the development of China, Korea, and Japan from ancient times to the present. This course explores the evolution of civilization from the first writing through classical Hei'an Japan, aristocratic Koryo, and late imperial Song China. Primary and secondary readings on basic ideas, institutions, and practices of the Confucian, Daoist, and Buddhist paths and of the state and family.",
  "prerequisite": null
 },
 {
  "code": "HILD 11",
  "title": "East Asia and the West, 1279-1911",
  "unit": "4",
  "description": "The East Asia survey compares and contrasts the development of China, Korea, and Japan from ancient times to the present. From the Mongol conquests through China's and Korea's last dynasties, and the rise of Meiji Japan, this course examines political, institutional, and cultural ruptures and continuities as East Asia responded to the challenges of Western imperialism with defense, reform, conservative reaction, and creative imitation.",
  "prerequisite": null
 },
 {
  "code": "HILD 12",
  "title": "Twentieth-Century East Asia",
  "unit": "4",
  "description": "The East Asia survey compares and contrasts the development of China, Korea, and Japan from ancient times to the present. This course examines the emergence of a regionally dominant Japan before and after World War II; the process of revolution and state-building in China during the nationalist and communist eras; and Korea's encounter with colonialism, nationalism, war, revolution, and industrialization.",
  "prerequisite": null
 },
 {
  "code": "HILD 14",
  "title": "Film and History in Latin America",
  "unit": "4",
  "description": "Students watch films on Latin America and compare them to historical research on similar episodes or issues. Films will vary each year but will focus on the social and psychological consequences of colonialism, forced labor, religious beliefs, and “Modernization.”",
  "prerequisite": null
 },
 {
  "code": "HILD 20",
  "title": "World History I: Ancient to Medieval",
  "unit": "4",
  "description": "This course provides an introduction to the culture, environmental context, and sociopolitical outlook of ancient civilizations, and traces historical change, from the emergence of classical empires to their collapse and transformation into medieval forms. The course also explores the development and spread of major world religions. Students may not receive credit for both HILD 20 and HILD 20R.",
  "prerequisite": null
 },
 {
  "code": "HILD 20R",
  "title": "World History I: Ancient to Medieval",
  "unit": "4",
  "description": "This online course provides an introduction to the culture, environmental context, and sociopolitical outlook of ancient civilizations, and traces historical change, from the emergence of classical empires to their collapse and transformation into medieval forms. The online course also explores the development and spread of major world religions. Students may not receive credit for both HILD 20 and HILD 20R.",
  "prerequisite": null
 },
 {
  "code": "HILD 30",
  "title": "History of Public Health",
  "unit": "4",
  "description": "Explores the history of public health, from the plague hospitals of Renaissance Italy to the current and future prospects for global health initiatives, emphasizing the complex biological, cultural, and social dimensions of health, sickness, and medicine across time and space.",
  "prerequisite": null
 },
 {
  "code": "HILD 40",
  "title": "Anthropocene 1: The Neolithic",
  "unit": "4",
  "description": "Examines controversial hypothesis that humans have had a significant impact on the Earth's climate and ecosystems over the past 8,000 years by focusing on the origins of settled agriculture and its environmental implications, including effects on greenhouse gas emissions. +",
  "prerequisite": null
 },
 {
  "code": "HILD 41",
  "title": "Anthropocene 2: The Columbian Exchange, 1400-1750",
  "unit": "4",
  "description": "Examines the reintegration of the eastern and western hemispheres following 1492, tracking the movements of peoples, foodstuffs, livestock, and diseases, and assessing the vast and irreversible environmental and social impact of these transformations. +",
  "prerequisite": null
 },
 {
  "code": "HILD 42",
  "title": "Anthropocene 3: The Industrial Revolutions",
  "unit": "4",
  "description": "This course explores the fossil fuel age, from the steam engine to aerial warfare, analyzing the economics of coal and oil, the environmental impacts of industrial agriculture, deep-pit mining and extractive imperialism, and the building of the electrical grid.",
  "prerequisite": null
 },
 {
  "code": "HILD 43",
  "title": "Anthropocene 4: The Great Acceleration, 1945-Present",
  "unit": "4",
  "description": "Explores the intensification of industrialization and urbanization and their environmental impact, including skyrocketing greenhouse gas emissions, air and water pollution, soil depletion, and deforestation. Also, analyzes different environmentalisms and imagines futures distinct from climate catastrophe.",
  "prerequisite": null
 },
 {
  "code": "HILD 50",
  "title": "Introduction to Law and Society",
  "unit": "4",
  "description": "A survey of contemporary issues concerning law and society, with emphasis on historical analysis and context. Satisfies the lower-division requirement for the law and society minor.",
  "prerequisite": null
 },
 {
  "code": "HIAF 111",
  "title": "Modern Africa since 1880",
  "unit": "4",
  "description": "A survey of African history dealing with the European scramble for territory, primary resistance movements, the rise of nationalism and the response of metropolitan powers, the transfer of power, self-rule and military coups, and the quest for identity and unity.",
  "prerequisite": null
 },
 {
  "code": "HIAF 112",
  "title": "West Africa since 1880",
  "unit": "4",
  "description": "West Africa from the nineteenth century onwards and examines the broad outlines of historical developments in the subregion through the twentieth century, including such themes as religious, political, and social changes.",
  "prerequisite": null
 },
 {
  "code": "HIAF 113",
  "title": "Small Wars and the Global Order: Africa and Asia",
  "unit": "4",
  "description": "Examines the traumas, interrelation, and global repercussions of national conflicts (“small wars”) in the postcolonial world. Focus on Africa and Asia from the Cold War to the present with particular attention to the intersection of foreign interests, insurgency, and geopolitics.",
  "prerequisite": null
 },
 {
  "code": "HIAF 120",
  "title": "History of South Africa",
  "unit": "4",
  "description": "The origins and the interaction between the peoples of South Africa. Special attention will be devoted to industrial development, urbanization, African and Afrikaner nationalism, and the origin and development of apartheid and its consequences.",
  "prerequisite": null
 },
 {
  "code": "HIAF 123",
  "title": "West Africa from Earliest Times to 1800",
  "unit": "4",
  "description": "Plant and animal domestication, ironworking and the distribution of ethnic/language groups, urbanization, regional and long-distance commerce, and the rise of medieval kingdoms.",
  "prerequisite": null
 },
 {
  "code": "HIAF 161",
  "title": "Special Topics in African History",
  "unit": "4",
  "description": "This colloquium is intended for students with sufficient background in African history. Topics, which vary from year to year, will include traditional political, economic, and religious systems, and theory and practice of indirect rule, decolonization, African socialism, and pan-Africanism. May be taken for credit up to five times. Department approval required; may be coscheduled with HIAF 261.",
  "prerequisite": null
 },
 {
  "code": "HIAF 199",
  "title": "Independent Study in African History",
  "unit": "4",
  "description": "Directed readings for undergraduates.",
  "prerequisite": "consent of instructor and academic adviser required."
 },
 {
  "code": "HIAF 261",
  "title": "Special Topics in African History",
  "unit": "4",
  "description": "This colloquium is intended for students with sufficient background in African history. Topics, which vary from year to year, will include traditional political, economic, and religious systems, and theory and practice of indirect rule, decolonization, African socialism, and pan-Africanism. May be taken for credit up to five times. Department approval required; may be coscheduled with HIAF 161.",
  "prerequisite": null
 },
 {
  "code": "HIEA 111",
  "title": "Japan: Twelfth to Mid-Nineteenth Centuries",
  "unit": "4",
  "description": "Covers important political issues—such as the medieval decentralization of state power, unification in the sixteenth and seventeenth centuries, the Tokugawa system of rule, and conflicts between rulers and ruled—while examining long-term changes in economy, society, and culture. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEA 112",
  "title": "Japan: From the Mid-Nineteenth Century through the US Occupation",
  "unit": "4",
  "description": "Topics include the Meiji Restoration, nationalism, industrialization, imperialism, Taisho Democracy, and the Occupation. Special attention will be given to the costs as well as benefits of “modernization” and the relations between dominant and subordinated cultures and groups within Japan.",
  "prerequisite": null
 },
 {
  "code": "HIEA 113",
  "title": "The Fifteen-Year War in Asia and the Pacific",
  "unit": "4",
  "description": "Lecture-discussion course approaching the 1931-1945 war through various “local,” rather than simply national, experiences. Perspectives examined include those of marginalized groups within Japan, Japanese Americans, Pacific Islanders, and other elites and nonelites in Asian and Pacific settings.",
  "prerequisite": null
 },
 {
  "code": "HIEA 114",
  "title": "Postwar Japan",
  "unit": "4",
  "description": "Examines social, cultural, political, and economic transformations and continuities in Japan since World War II. Emphases will differ by instructor.",
  "prerequisite": null
 },
 {
  "code": "HIEA 115",
  "title": "Social and Cultural History of Twentieth-Century Japan",
  "unit": "4",
  "description": "Japanese culture and society changed dramatically during the twentieth century. This course will focus on the transformation of cultural codes into what we know as “Japanese,” the politics of culture, and the interaction between individuals and society.",
  "prerequisite": null
 },
 {
  "code": "HIEA 116",
  "title": "Japan-U.S. Relations",
  "unit": "4",
  "description": "Survey of relations between Japan and the United States in the nineteenth and twentieth centuries. Although the focus will be on these nation-states, the course will be framed within the global transformation of societies. Topics include cultural frameworks, political and economic changes, colonialism and imperialism, and migration.",
  "prerequisite": null
 },
 {
  "code": "HIEA 117",
  "title": "Ghosts in Japan",
  "unit": "4",
  "description": "By examining the roles of ghosts in Japanese belief systems in a nonscientific age, this course addresses topics including folk beliefs and ghost stories, religiosity, early science, tools of amelioration and authoritative knowledge, and the relationship between myth and history.",
  "prerequisite": null
 },
 {
  "code": "HIEA 122",
  "title": "Late Imperial Chinese Culture and Society",
  "unit": "4",
  "description": "We read primary and secondary sources to study aspects of culture, society, religions, economy, government, family, gender, class, and individual lives from the tenth through the eighteenth centuries, Song through Qing. Recommended preparation: previous course work on China helpful but not required. May be taken for credit four times with department approval.",
  "prerequisite": "upper-division; department approval. \\+"
 },
 {
  "code": "HIEA 123",
  "title": "China under the Ming Dynasty (1368-1644)",
  "unit": "4",
  "description": "Ming history from its beginnings under Mongol rule until its fall to rebels and the Manchus. We study government and society under each of the sixteen emperors, and major events like the Zheng He voyages and the first Sino- Japanese War. Recommended preparation: HILD 11. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEA 124",
  "title": "Life in Ming China (1369-1644)",
  "unit": "4",
  "description": "We read primary and secondary sources to explore the experiences, worldview, and relationships of Ming men and women, variously including emperors and empresses, scholar-officials, upper-class wives, merchants, weavers, painters, eunuchs, Daoists, fighting monks, farmers, actors, gardeners, courtesans, soldiers, and pirates. +",
  "prerequisite": null
 },
 {
  "code": "HIEA 125",
  "title": "Women and Gender in East Asia",
  "unit": "4",
  "description": "The impact of modern transformations on female roles and gender relations in China, Japan, and Korea, focusing on the late imperial/early modern periods through the twentieth century.",
  "prerequisite": null
 },
 {
  "code": "HIEA 126",
  "title": "The Silk Road in Chinese and Japanese History",
  "unit": "4",
  "description": "This course studies the peoples, cultures, religions, economics, arts, and technologies of the trade routes known collectively as the Silk Road from c. 200 BCE to 1000 CE. We will use an interdisciplinary approach. Primary sources will include written texts and visual materials. We will examine these trade routes as an early example of globalization. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEA 129",
  "title": "Faces of the Chinese Past",
  "unit": "4",
  "description": "Through primary and secondary readings on the lives of individual prominent and ordinary men and women from China’s past, we explore the relation of the individual to social structures and accepted norms; personal relationships; and the creation of historical sources. +",
  "prerequisite": null
 },
 {
  "code": "HIEA 130",
  "title": "End of the Chinese Empire, 1800-1911",
  "unit": "4",
  "description": "From the Opium War to the 1911 Revolution. Key topics include ethnic identity under Manchu rule, the impact of Western imperialism, the Taiping and other rebellions, overseas Chinese, social change and currents of reform, and the rise of Chinese nationalism.",
  "prerequisite": null
 },
 {
  "code": "HIEA 131",
  "title": "China in War and Revolution, 1911-1949",
  "unit": "4",
  "description": "An exploration of the formative period of the twentieth-century Chinese Revolution: the New Culture Movement, modern urban culture, the nature of Nationalist (Guomindang) rule, war with Japan, revolutionary nationalism, and the Chinese Communist rise to power.",
  "prerequisite": null
 },
 {
  "code": "HIEA 132",
  "title": "Mao's China, 1949-1976",
  "unit": "4",
  "description": "This course analyzes the history of the PRC from 1949 to the present. Special emphasis is placed on the problem of postrevolutionary institutionalization, the role of ideology, the tension between city and countryside, Maoism, the Great Leap Forward, the Cultural Revolution.",
  "prerequisite": null
 },
 {
  "code": "HIEA 133",
  "title": "Twentieth-Century China: Cultural History",
  "unit": "4",
  "description": "This course looks at how the historical problems of twentieth-century China are treated in the popular and elite cultures of the Nationalist and Communist eras. Special emphasis is placed on film and fiction.",
  "prerequisite": null
 },
 {
  "code": "HIEA 134",
  "title": "History of Thought and Religion in China: Confucianism",
  "unit": "4",
  "description": "Course will take up one of the main traditions of Chinese thought or religion, Confucianism, and trace it from its origins to the present. The course will explain the system of thought and trace it as it changes through history and within human lives and institutions. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEA 137",
  "title": "Women and the Family in Chinese History",
  "unit": "4",
  "description": "The course explores the institutions of family and marriage, and women's roles and experiences within the family and beyond, from classical times to the early twentieth century. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEA 138",
  "title": "Women and the Chinese Revolution",
  "unit": "4",
  "description": "Examines women's roles and experiences in the twentieth-century Chinese revolution, the ways in which women participated in the process of historical change, the question of to what extent the revolution “liberated” women from “Confucian tradition.”",
  "prerequisite": null
 },
 {
  "code": "HIEA 139GS",
  "title": "An Introduction to Southeast Asia (circa 800-1900)",
  "unit": "4",
  "description": "This course provides an overview of Southeast Asian culture and history from 800 to the age of imperialism. It addresses regional geography, diversity, religion, political and social structures, mercantile and cultural ties abroad, the arrival of Islam, and the region's changing relationship with European and Asian power. Students must apply and be accepted into the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HIEA 140",
  "title": "China since 1978",
  "unit": "4",
  "description": "Examines China's attempts to manage the movements of people, ideas, and trade across its borders since 1900. How much control do individual countries such as China have over global processes? Special emphasis will be placed on global contexts and the impacts of China’s decision to reintegrate its society and economy with capitalist countries since 1978. Recommended preparation: previous course work on China helpful but not required.",
  "prerequisite": null
 },
 {
  "code": "HIEA 144",
  "title": "Topics in East Asian History",
  "unit": "4",
  "description": "Selected topics in East Asian History. Course may be taken for credit up to three times as topics vary.",
  "prerequisite": null
 },
 {
  "code": "HIEA 150",
  "title": "Modern Korea, 1800-1945",
  "unit": "4",
  "description": "This course examines Korea’s entrance into the modern world. It utilizes both textual and audio-visual materials to explore local engagements with global phenomenon, such as imperialism, nationalism, capitalism, and socialism. HILD 10, 11, and/or 12 recommended.",
  "prerequisite": null
 },
 {
  "code": "HIEA 151",
  "title": "The Two Koreas, 1945-Present",
  "unit": "4",
  "description": "This course traces the peninsula’s division into two rival regimes. It utilizes both textual and audio-visual materials to reveal the varied experiences of North and South Koreans with authoritarianism, industrialization, and globalization. HILD 10, 11, and/or 12 recommended.",
  "prerequisite": null
 },
 {
  "code": "HIEA 152",
  "title": "History and Cultures of the Korean Diaspora",
  "unit": "4",
  "description": "This course places the Korean diaspora in national, regional, and global frames from the imperial age to our globalized present. It traces migrant experiences and community formations on the peninsula and in Japan, the United States, China, and the former USSR.",
  "prerequisite": null
 },
 {
  "code": "HIEA 153",
  "title": "Social and Cultural History of Twentieth-Century Korea",
  "unit": "4",
  "description": "This course explores the cultural and social structures that dominated twentieth-century Korea: imperialism, ethnonationalism, heteropatriarchy, capitalism, socialism, and militarism. It also uses individual and collective engagements with these hegemonic structures to demonstrate contentious interactions between individuals and society.",
  "prerequisite": null
 },
 {
  "code": "HIEA 154",
  "title": "Korean History Through Film",
  "unit": "4",
  "description": "Recognizing that the past is a multi-media process of knowledge production, this course uses a variety of films (i.e., features, shorts, and documentaries) to study how directors have visualized modern Korean history. Students will juxtapose the narratives of Korean films with academic accounts of Korean history to understand how representations of the past are produced, disseminated, contested, and interpreted. Writing exercise will develop students' critical and analytical skills.",
  "prerequisite": null
 },
 {
  "code": "HIEA 155",
  "title": "China and the Environment",
  "unit": "4",
  "description": "This course covers key themes in the history of interactions between humans and the environment in China over the past 3,000 years, generating a fuller understanding of China's present-day environmental problems by situating them in a broader historical context. +",
  "prerequisite": null
 },
 {
  "code": "HIEA 163",
  "title": "Cinema and Society in Twentieth-Century China",
  "unit": "4",
  "description": "This colloquium will explore the relationship between cinema and society in twentieth-century China. The emphasis will be on the social, political, and cultural impact of filmmaking. The specific period under examination (1930s, 1940s, post-1949) may vary each quarter. Graduate students will be expected to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEA 263",
  "title": "Cinema and Society in Twentieth-Century China",
  "unit": "4",
  "description": "This colloquium will explore the relationship between cinema and society in twentieth-century China. The emphasis will be on the social, political, and cultural impact of filmmaking. The specific period under examination (1930s, 1940s, post-1949) may vary each quarter. Graduate students will be expected to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEA 164",
  "title": "Seminar in Late Imperial Chinese History",
  "unit": "4",
  "description": "We read primary and accessible historical scholarship (including fiction) on state, society, religion, culture, and individual lives in Song through Qing times. May be taken for credit three times. May be coscheduled with HIEA 264.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HIEA 264",
  "title": "Seminar in Late Imperial Chinese History",
  "unit": "4",
  "description": "We read primary and accessible historical scholarship (including fiction) on state, society, religion, culture, and individual lives in Song through Qing times. May be taken for credit three times. May be coscheduled with HIEA 264.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HIEA 166",
  "title": "Creating Ming Histories",
  "unit": "4",
  "description": "Ming was considered absolutist, closed, and stagnant. Nowadays its vibrant economy and culture are celebrated. We pair scholarship with primary sources to explore Ming’s complexities and learn how historians work. May be coscheduled with HIEA 266.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HIEA 266",
  "title": "Creating Ming Histories",
  "unit": "4",
  "description": "Ming was considered absolutist, closed, and stagnant. Nowadays its vibrant economy and culture are celebrated. We pair scholarship with primary sources to explore Ming’s complexities and learn how historians work. May be coscheduled with HIEA 266.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HIEA 168",
  "title": "Topics in Classical and Medieval Chinese History",
  "unit": "4",
  "description": "Chinese society, thought, religion, culture, economy and politics from the Shang through the Song dynasties, through primary and secondary sources. Topics vary; may be repeated for credit. Requirements differ for undergraduate, MA and PhD students. Graduate students will be required to submit a more substantial piece of work or an additional paper.",
  "prerequisite": "upper-division standing or consent of instructor and department stamp. +"
 },
 {
  "code": "HIEA 268",
  "title": "Topics in Classical and Medieval Chinese History",
  "unit": "4",
  "description": "Chinese society, thought, religion, culture, economy and politics from the Shang through the Song dynasties, through primary and secondary sources. Topics vary; may be repeated for credit. Requirements differ for undergraduate, MA and PhD students. Graduate students will be required to submit a more substantial piece of work or an additional paper.",
  "prerequisite": "upper-division standing or consent of instructor and department stamp. +"
 },
 {
  "code": "HIEA 170",
  "title": "Love and Marriage in Chinese History",
  "unit": "4",
  "description": "Examines ideas and practices of love and marriage in Chinese history, including changes and continuities in China's twentieth-century revolution and reform. Course readings range from literary and philosophical sources to personal records from the classical age to the modern era. Department approval required. May be coscheduled with HIEA 270. +",
  "prerequisite": null
 },
 {
  "code": "HIEA 171",
  "title": "Society and Culture in Premodern China",
  "unit": "4",
  "description": "Explores premodern Chinese society and culture through the reading and discussion of classics and masterpieces in history. Examines how values and ideas were represented in the texts and how they differed, developed, or shifted over time. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing, department stamp. \\+"
 },
 {
  "code": "HIEA 271",
  "title": "Society and Culture in Premodern China",
  "unit": "4",
  "description": "Explores premodern Chinese society and culture through the reading and discussion of classics and masterpieces in history. Examines how values and ideas were represented in the texts and how they differed, developed, or shifted over time. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing, department stamp. \\+"
 },
 {
  "code": "HIEA 180",
  "title": "Topics in Modern Korean History",
  "unit": "4",
  "description": "This colloquium will examine selected topics in modern Korean history through both primary sources (in translation) and secondary sources. Topics will vary year to year.",
  "prerequisite": "upper-division standing and department stamp."
 },
 {
  "code": "HIEA 190M",
  "title": "Special Topics in East Asian Modern History",
  "unit": "4",
  "description": "This course looks at topics in East Asian history in the modern era (post 1800). May be coscheduled with HIEA 290M. May be taken for credit up to five times. Topics will vary from year to year. Department approval required.",
  "prerequisite": null
 },
 {
  "code": "HIEA 290M",
  "title": "Special Topics in East Asian Modern History",
  "unit": "4",
  "description": "This course looks at topics in East Asian history in the modern era (post 1800). May be coscheduled with HIEA 290M. May be taken for credit up to five times. Topics will vary from year to year. Department approval required.",
  "prerequisite": null
 },
 {
  "code": "HIEA 198",
  "title": "Directed Group Study",
  "unit": "4",
  "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. May be taken for credit up to three times. Department approval required.",
  "prerequisite": null
 },
 {
  "code": "HIEA 199",
  "title": "Independent Study in East Asian History",
  "unit": "4",
  "description": "Directed reading for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor required."
 },
 {
  "code": "HIEA 270",
  "title": "Love and Marriage in Chinese History",
  "unit": "4",
  "description": "Examines ideas and practices of love and marriage in Chinese history, including changes and continuities in China's twentieth-century revolution and reform. Course readings range from literary and philosophical sources to personal records from the classical age to the modern era. Department approval required. May be coscheduled with HIEA 170.",
  "prerequisite": null
 },
 {
  "code": "HIEA 280",
  "title": "Topics in Modern Korean History",
  "unit": "4",
  "description": "This course will examine selected topics in modern Korean history through both primary sources (in translation) and secondary sources. Topics will vary year to year.",
  "prerequisite": null
 },
 {
  "code": "HIEA 292",
  "title": "Chinese Classics Reading Group",
  "unit": "4",
  "description": "The Chinese classics reading group translates into English (as a way of understanding and discussing) the Chinese classics and philosophy. Some classical Chinese is required. We consider every aspect of each text from individual words to the historical context.",
  "prerequisite": null
 },
 {
  "code": "HIEU 100",
  "title": "Byzantine History",
  "unit": "4",
  "description": "This course examines the political, religious, and social history of the Byzantine Empire between 300 and 1453 AD. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 102",
  "title": "Roman History",
  "unit": "4",
  "description": "The course treats the history of Rome from the foundation of the city in the eighth century BC until the end of the Flavian dynasty in 96 AD. It focuses particularly on the political, social, and cultural elements that fueled Roman development and expansion. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 102A",
  "title": "Ancient Roman Civilization",
  "unit": "4",
  "description": "The political, economic, and intellectual history of the Roman world from the foundation of Rome to the disintegration of the Western empire. This course will emphasize the importance of the political and cultural contributions of Rome to modern society. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 103",
  "title": "Decline and Fall of the Roman Empire",
  "unit": "4",
  "description": "This course discusses the history of imperial Rome and its successor states between the second and seventh centuries AD. It considers whether the Roman Empire fell or if one should instead speak of Roman continuity amidst political and religious change. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 104",
  "title": "Byzantine Empire",
  "unit": "4",
  "description": "A survey course of the history of the Byzantine state from the reign of Constantine to the fall of Constantinople. This course will emphasize the importance of the Byzantine state within a larger European focus, its relationship to the emerging Arab states, its political and cultural contributions to Russia and the late medieval west. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 105",
  "title": "The Early Christian Church",
  "unit": "4",
  "description": "A study of the origin and development of early Christian thought, literature, and institution from the New Testament period to the Council of Chalcedon. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 106",
  "title": "Egypt, Greece, and Rome",
  "unit": "4",
  "description": "This course is a survey of the political, social, and cultural history of the ancient Mediterranean. It focuses on the ancient empires in the Near East (Sumer, Babylon, Assyria, Persia), Egypt, Greece, and Rome. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 106GS",
  "title": "Constantinople: Imperial Capital",
  "unit": "4",
  "description": "This course examines Constantinople in its imperial period (Byzantine and Ottoman) when it served as the political, cultural, economic, and religious center of empire. We examine continuity and change in areas such as urban space, demography, institutions, and art and architecture. Students must apply and be accepted into the Global Seminar Program. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 107",
  "title": "Pagan Europe and its Christian Aftermath",
  "unit": "4",
  "description": "Cross-listed with RELI 147. This course explores the history of how Western Europe was converted from its indigenous pagan religions to the imported religion we know as Christianity. We will discuss conversion by choice and by force, partial or blended conversions, and the relationships between belief and culture. Students may not receive credit for both HIEU 107 and RELI 147. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 108",
  "title": "Sex and Politics in the Ancient World",
  "unit": "4",
  "description": "A history of approaches to sexual practices, sexual identity, and sexual morality in the Roman Empire between the first and fifth centuries of the Common Era. We will examine how political, religious, and medical transformations during this period changed the ways in which people thought of issues like sexual freedom, same-sex relations, marriage and celibacy, sexual violence, and more. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 109",
  "title": "Blood, Soil, Boundaries: Nationalism in Europe",
  "unit": "4",
  "description": "This course will explore the history of nationalism as idea and political movement in European history, from the French Revolution to the present. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 111",
  "title": "Europe in the Middle Ages",
  "unit": "4",
  "description": "The development of European society and culture from 1050 to 1400. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 112S",
  "title": "Ancient Explorers",
  "unit": "4",
  "description": "Ancient travel into unexplored regions of the world and the discovery of new civilizations. Look at actual voyages, focusing on the remarkable figures who braved the unknown, the objects of their journeys, and their crude equipment and knowledge. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 113",
  "title": "The History of the Russian Empire, 1775-1917",
  "unit": "4",
  "description": "A survey course which takes as its starting point the final gathering of the Russian Empire under Catherine the Great and carries it through the peasant emancipation of 1861, through the rise of capitalism, and culminates in the abdication of the Romanov dynasty in February 1917. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 114",
  "title": "The History of the Soviet Union and Russia, 1917 to the Present",
  "unit": "4",
  "description": "The Bolshevik revolution was supposed to change humanity. Led by Vladimir Lenin and perverted by Joseph Stalin, the USSR defeated Nazism in World War II and challenged the U.S. throughout the Cold War. It then collapsed, transitioning from a chaotic version of democracy and market economy to authoritarianism and controlled capitalism.",
  "prerequisite": null
 },
 {
  "code": "HIEU 114GS",
  "title": "Athens: A City in History",
  "unit": "4",
  "description": "This course examines how Athenians during different epochs have dealt and still deal with the realities of everyday life and death. The topics covered by the course include work, war, religion, politics, and death. Students must apply and be accepted into the Global Seminar Program. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 115",
  "title": "The Pursuit of the Millennium",
  "unit": "4",
  "description": "The year 2000 provokes questions about the transformation of time, culture, and society. Taking the year 1000 as a touchstone, this class examines the history of apocalyptic expectations in the Middle Ages through a close scrutiny of both texts and art. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 116A",
  "title": "Greece and the Balkans in the Age of Ottoman Expansion",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1350-1683). Topics covered: the rise of the Ottoman Empire, conquest of the Balkans, the Ottoman system of rule, religious life, rural and urban society, law and order, and material culture. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 116B",
  "title": "Greece and the Balkans in the Age of Nationalism",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1683-1914). Topics covered: social and economic development in the eighteenth century, nationalism, independence wars, state-nation formation, interstate relations, the Eastern Question, rural society, urbanization, emigration, and the Balkan Wars. Students may not get credit for both HIEU 116B and HIEU 117A.",
  "prerequisite": null
 },
 {
  "code": "HIEU 116C",
  "title": "Greece and the Balkans during the Twentieth Century",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1914-2001). Topics covered: World War I, population exchanges, authoritarianism, modernization, World War II, civil wars, Cold War, Greek-Turkish relations, Cyprus, collapse of communism, 1990s conflicts, and EU expansion. Students may not get credit for both HIEU 116C and HIEU 116CD.",
  "prerequisite": null
 },
 {
  "code": "HIEU 116CD",
  "title": "Greece and the Balkans during the Twentieth Century",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1914-2001). Topics covered: World War I, population exchanges, authoritarianism, modernization, World War II, civil wars, Cold War, Greek-Turkish relations, Cyprus, collapse of communism, 1990s conflicts, and EU expansion. Students may not get credit for both HIEU 116C and HIEU 116CD, or HIEU 116CD and HIEU 117B.",
  "prerequisite": null
 },
 {
  "code": "HIEU 117A",
  "title": "Greece and the Balkans in the Age of Nationalism",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1683-1914). Topics covered: social and economic development in the eighteenth century, nationalism, independence wars, state-nation formation, interstate relations, the Eastern Question, rural society, urbanization, emigration, and the Balkan Wars.",
  "prerequisite": null
 },
 {
  "code": "HIEU 117B",
  "title": "Greece and the Balkans during the Twentieth Century",
  "unit": "4",
  "description": "This course examines the history of Greece and the Balkans (1914-2001). Topics covered: World War I, population exchanges, authoritarianism, modernization, World War II, resistance, civil wars, Cold War, Greek-Turkish relations, Cyprus, collapse of Communism, 1990s conflicts, and EU expansion.",
  "prerequisite": null
 },
 {
  "code": "HIEU 118",
  "title": "Americanization in Europe",
  "unit": "4",
  "description": "Examines problems surrounding the transfer of American culture, values, and styles to Europe in the twentieth and twenty-first centuries. Topics may include consumer society, popular culture, commercial and business practices, “McDonaldization,” political and military influence, democratization, and resistance to Americanization. Students may not receive credit for both HIEU 117S and HIEU 118.",
  "prerequisite": null
 },
 {
  "code": "HIEU 119",
  "title": "Death and Afterlife in the Middle Ages",
  "unit": "4",
  "description": "This class investigates the ways in which medieval people understood death as well as the various ways in which they imagined the afterlife. We will discuss the cult of martyrs and saints; encounters with ghosts and revenants; the formation of the doctrine of purgatory; visionary journeys to the other world; and early medical discourses defining the death of the body. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 120",
  "title": "The Renaissance in Italy",
  "unit": "4",
  "description": "The social, political, and cultural transformation of late-medieval Italy from the heyday of mercantile expansion before the plague to the dissolution of the Italian state system with the French invasions of 1494. Special focus upon family, associational life and factionalism in the city, the development of the techniques of capitalist accumulation, and the spread of humanism. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 121GS",
  "title": "Scotland and the English Civil War, 1601-1689",
  "unit": "4",
  "description": "A lecture-discussion course that examines the role of Scotland in the English Civil War during the first half of the seventeenth century, 1601-1689. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 122",
  "title": "Ancient Greece from the Bronze Age to the Peloponnesian War",
  "unit": "4",
  "description": "This course treats the history of the Greek world from the Mycenaeans to the aftermath of the Peloponnesian War. It focuses on the rise of the polis, the development of the Athenian democracy and imperialism, and the Peloponnesian War. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 123",
  "title": "Ancient Greece from Classical Athens to Cleopatra",
  "unit": "4",
  "description": "This course explores the dramatic political, social, and cultural changes in the Greek world and the Eastern Mediterranean from the fourth century BCE and the rise of Alexander the Great to the death of Cleopatra. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 124GS",
  "title": "The City Italy",
  "unit": "4",
  "description": "Language and cultural study in Italy. Course considers the social, political, economic, and religious aspects of civic life that gave rise to the unique civic art, the architecture of public buildings, and the design of the urban environment of such cities as Florence, Venice, or Rome. Course materials fees may be required. Students may not receive credit for both HIEU 124 and HIEU 124GS. Students must apply and be accepted into the Global Seminar Program.",
  "prerequisite": null
 },
 {
  "code": "HIEU 125",
  "title": "Reformation Europe",
  "unit": "4",
  "description": "The intellectual and social history of the Reformation and Counter-Reformation from the French invasions to the Edict of Nantes. Emphasis is upon reform from below and above, the transformation of grassroots spirituality into institutional control. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 127",
  "title": "Sport in the Modern World",
  "unit": "4",
  "description": "This course looks at the phenomenon of sport in all of its social, cultural, political, and economic aspects. The starting point will be the emergence of modern sport in nineteenth-century Britain, but the focus will be global. Since the approach will be topical rather than chronological, students should already have a good knowledge of world history in the nineteenth and twentieth centuries.",
  "prerequisite": null
 },
 {
  "code": "HIEU 127D",
  "title": "Sport in the Modern World",
  "unit": "4",
  "description": "This course looks at sport in all of its social, cultural, political, and economic aspects. The starting point will be the emergence of modern sport in nineteenth-century Britain, but the focus will be global. Since the approach will be topical rather than chronological, students should already have a good knowledge of world history in the nineteenth and twentieth centuries. Students may not get credit for both HIEU 127 and HIEU 127D.",
  "prerequisite": null
 },
 {
  "code": "HIEU 128",
  "title": "Europe since 1945",
  "unit": "4",
  "description": "An analysis of European history since the end of the Second World War. Focus is on political, social, economic, and cultural developments within European societies as well as on Europe's relationship with the wider world (the Cold War, decolonization).",
  "prerequisite": null
 },
 {
  "code": "HIEU 129",
  "title": "Paris, Past and Present",
  "unit": "4",
  "description": "This course surveys the historical and cultural significance of Paris from about 1500 to the present. The focus is on interactions between political, architectural, and urban evolutions, and the changing populations of Paris in times of war, revolutions, and peace. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 130",
  "title": "Europe in the Eighteenth Century",
  "unit": "4",
  "description": "A lecture-discussion course focusing on Europe from 1688 to 1789. Emphasis is on the social, cultural, and intellectual history of France, Germany, and England. Topics considered will include family life, urban and rural production and unrest, the poor, absolutism, and the Enlightenment from Voltaire to Rousseau. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 131",
  "title": "The French Revolution: 1789-1814",
  "unit": "4",
  "description": "This course examines the Revolution in France and its impact in Europe and the Caribbean. Special emphasis will be given to the origins of the Revolution, the development of political and popular radicalism and symbolism from 1789 to 1794, the role of political participants (e.g., women, sans-culottes, Robespierre), and the legacy of revolutionary wars and the Napoleonic system on Europe. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 134",
  "title": "The Formation of the Russian Empire, 800-1855",
  "unit": "4",
  "description": "State-building and imperial expansion among the peoples of the East Slavic lands of Europe and Asia from the origins of the Russian state in ninth- century Kiev, through Peter the Great's empire up to the middle of the nineteenth century. \\+",
  "prerequisite": null
 },
 {
  "code": "HIEU 136B",
  "title": "European Society and Social Thought, 1870-1989",
  "unit": "4",
  "description": "A lecture and discussion course on European political and cultural development and theory from 1870-1989. Important writings will be considered both as responses to and as provocations for political and cultural change.",
  "prerequisite": null
 },
 {
  "code": "HIEU 137",
  "title": "History of Colonialism: From New Imperialism to Decolonization",
  "unit": "4",
  "description": "This course surveys the age of colonialism in the nineteenth and twentieth century. The course will focus on the debates on colonialism in the metropolis as well as on the conflicts inside the colonies. Considerable emphasis will be placed on colonialism in Africa.",
  "prerequisite": null
 },
 {
  "code": "HIEU 139",
  "title": "Sex and Gender from the Renaissance to the French Revolution",
  "unit": "4",
  "description": "This course places gender and sexuality at the center of European history from the Renaissance to the French Revolution. We examine the distinct roles that men and women played in the period’s major events. We track how practices and understandings of gender and sexuality shifted during the four centuries between 1500 and 1800. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 140GS",
  "title": "Art and Society in Nineteenth-Century London",
  "unit": "4",
  "description": "This course examines English responses to the French Revolution, industrialization, and engagement with other cultures during the eighteenth and nineteenth centuries. Readings from high, popular, and folk literature, both serious and satirical, illuminate life in the London metropolis. Program or materials fees may apply. Students must apply and be accepted to the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HIEU 141",
  "title": "European Diplomatic History, 1870-1945",
  "unit": "4",
  "description": "European imperialism, alliances, and the outbreak of the First World War. The postwar settlement and its breakdown. The advent of Hitler and the disarray of the western democracies. The Second World War and the emergence of the superpowers.",
  "prerequisite": null
 },
 {
  "code": "HIEU 142",
  "title": "European Intellectual History, 1780-1870",
  "unit": "4",
  "description": "European thought from the late Enlightenment and the French Revolution to Marx and Baudelaire, emphasizing the origins of romanticism, idealism, and positivism in England, Germany, and France.",
  "prerequisite": null
 },
 {
  "code": "HIEU 143",
  "title": "European Intellectual History, 1870-1945",
  "unit": "4",
  "description": "A lecture-discussion course on the crisis of bourgeois culture, the redefinition of Marxist ideology, and the transformation of modern social theory. Readings will include Nietzsche, Sorel, Weber, Freud, and Musil. (This course satisfies the minor in the Humanities Program.)",
  "prerequisite": null
 },
 {
  "code": "HIEU 144",
  "title": "Topics in European History",
  "unit": "4",
  "description": "Selected topics in European history. Course may be taken for credit up to three times as topics vary.",
  "prerequisite": null
 },
 {
  "code": "HIEU 145",
  "title": "The Holocaust as Public History",
  "unit": "4",
  "description": "We will study historical accounts, memoirs, diaries, and oral histories to master the Holocaust epoch. We will contrast scholarly narratives to personal experience as different ways to learn about the past. Students will design projects for public education.",
  "prerequisite": null
 },
 {
  "code": "HIEU 147",
  "title": "Europe and the World I, 1808-1918",
  "unit": "4",
  "description": "A survey of Europe's relationship to the world from the end of the Atlantic slave trade to the end of the first world war. Topics include Europe and slavery, colonialism, the global origins of the industrial revolution, explorers and knowledge transfer, nation-building and the American civil war, transnational social movements (abolitionism, feminism, socialism), global modernism, international trade, imperialism abroad and at home, colonial wars and genocides, World War I as a global conflict.",
  "prerequisite": null
 },
 {
  "code": "HIEU 148",
  "title": "Europe and the World II, 1918-Present",
  "unit": "4",
  "description": "A survey of Europe's relationship to the world from the end of World War I to the present. Topics include deglobalization, imperialism, and anti- imperialism; world economic crisis; global fascism; World War II as a global conflict; decolonization and neo-colonialism; the Cold War; racism and immigration; transnational social movements; popular culture and sports; human rights and global memory; the rise and the fall of communism; capitalism and environmentalism; the crisis of liberal democracy.",
  "prerequisite": null
 },
 {
  "code": "HIEU 150",
  "title": "Modern British History",
  "unit": "4",
  "description": "Emphasis on changes in social structure and corresponding shifts in political power. The expansion and the end of empire. Two World Wars and the erosion of economic leadership.",
  "prerequisite": null
 },
 {
  "code": "HIEU 151",
  "title": "Spain since 1808",
  "unit": "4",
  "description": "Social, political, cultural history of Spain since Napoleon. Features second Spanish Republic, the Civil War, Franco era, and transition to democracy.",
  "prerequisite": null
 },
 {
  "code": "HIEU 151GS",
  "title": "History of Modern Spain, 1808-Present",
  "unit": "4",
  "description": "Social, political, cultural history of Spain since Napoleon. Features second Spanish Republic, the Civil War, Franco era, and transition to democracy. It will also include excursions to various sites of historical significance in and around Madrid. Program or materials fees may apply. Students may not receive credit for HIEU 151 and HIEU 151GS. Students must apply and be accepted to the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HIEU 153",
  "title": "Topics in Modern European History",
  "unit": "4",
  "description": "Selected topics in modern European history. Course may be taken for credit up to three times as topic vary.",
  "prerequisite": null
 },
 {
  "code": "HIEU 154",
  "title": "Modern German History: From Bismarck to Hitler",
  "unit": "4",
  "description": "An analysis of the volatile course of German history from unification to the collapse of the Nazi dictatorship. Focus is on domestic developments inside Germany as well as on their impact on European and global politics in the twentieth century.",
  "prerequisite": null
 },
 {
  "code": "HIEU 154GS",
  "title": "Modern Germany: From Bismarck to Hitler",
  "unit": "4",
  "description": "An analysis of the volatile course of German history from unification to the collapse of the Nazi dictatorship. Focus is on domestic developments inside Germany as well as on their impact on European and global politics in the twentieth century. Students may not receive credit for both HIEU 154 and HIEU 154GS. Program or materials fees may apply. Students must apply and be accepted to the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HIEU 154XL",
  "title": "HIEU 154 Foreign Language Section",
  "unit": "4",
  "description": "Students will exercise advanced German language skills to read and discuss materials in HIEU 154. Must be enrolled in HIEU 154.",
  "prerequisite": null
 },
 {
  "code": "HIEU 158",
  "title": "Why Hitler? How Auschwitz?",
  "unit": "4",
  "description": "Why did Germany in 1919 produce an Adolf Hitler; how did the Nazis take power in 1933; and why did the Third Reich last until 1945? Why did the war against the Jews become industrial and absolute?",
  "prerequisite": null
 },
 {
  "code": "HIEU 159",
  "title": "Three Centuries of Zionism, 1648-1948",
  "unit": "4",
  "description": "For centuries, the land of Israel was present in Jewish minds and hearts. Why and how did the return to Zion become a reality? Which were the vicissitudes of Jewish life in Palestine?",
  "prerequisite": null
 },
 {
  "code": "HIEU 159S",
  "title": "Three Centuries of Zionism 1648-1948",
  "unit": "4",
  "description": "For centuries, the land of Israel was present in Jewish minds and hearts. Why and how did the return to Zion become a reality? Which were the vicissitudes of Jewish life in Palestine?",
  "prerequisite": null
 },
 {
  "code": "HIEU 160",
  "title": "Topics in Ancient Greek History",
  "unit": "4",
  "description": "Selected topics in ancient Greek history. May be taken for credit three times.",
  "prerequisite": "upper-division standing and department approval required. +"
 },
 {
  "code": "HIEU 161",
  "title": "Topics in Roman History",
  "unit": "4",
  "description": "Selected topics in Roman history. May be taken for credit three times as topics will vary.",
  "prerequisite": "upper-division and department stamp. +"
 },
 {
  "code": "HIEU 261",
  "title": "Topics in Roman History",
  "unit": "4",
  "description": "Selected topics in Roman history. May be taken for credit three times as topics will vary.",
  "prerequisite": "upper-division and department stamp. +"
 },
 {
  "code": "HIEU 162",
  "title": "Topics in Byzantine History",
  "unit": "4",
  "description": "Selected topics in Byzantine history. May be taken for credit three times as topics vary.",
  "prerequisite": "upper-division and department stamp."
 },
 {
  "code": "HIEU 262",
  "title": "Topics in Byzantine History",
  "unit": "4",
  "description": "Selected topics in Byzantine history. May be taken for credit three times as topics vary.",
  "prerequisite": "upper-division and department stamp."
 },
 {
  "code": "HIEU 163",
  "title": "Special Topics in Medieval History",
  "unit": "4",
  "description": "Intensive study of special problems or periods in the history of medieval Europe. Topics vary from year to year, and students may therefore repeat the course for credit.",
  "prerequisite": "background in European history and upper-division standing. \\+"
 },
 {
  "code": "HIEU 263",
  "title": "Special Topics in Medieval History",
  "unit": "4",
  "description": "Intensive study of special problems or periods in the history of medieval Europe. Topics vary from year to year, and students may therefore repeat the course for credit.",
  "prerequisite": "background in European history and upper-division standing. \\+"
 },
 {
  "code": "HIEU 164",
  "title": "Special Topics in Early Modern Europe",
  "unit": "4",
  "description": "This course looks at the European and non-European in the early modern era. Topics will vary year to year. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIEU 264",
  "title": "Special Topics in Early Modern Europe",
  "unit": "4",
  "description": "This course looks at the European and non-European in the early modern era. Topics will vary year to year. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIEU 166",
  "title": "Living on the Edge: Mediterranean Environmental History",
  "unit": "4",
  "description": "What defines a \"Mediterranean climate\"? Plentiful sunshine, hot, dry summers, and cool, wet winters? In fact, within the Mediterranean, there are countless microclimates. Some produce conditions of plenty, while others are precarious for human habitation. This colloquium examines the environmental history of the premodern Mediterranean focusing on the intersection between climate and human societies, particularly how humans respond to climate shifts in precariously arid zones. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 266",
  "title": "Living on the Edge: Mediterranean Environmental History",
  "unit": "4",
  "description": "What defines a \"Mediterranean climate\"? Plentiful sunshine, hot, dry summers, and cool, wet winters? In fact, within the Mediterranean, there are countless microclimates. Some produce conditions of plenty, while others are precarious for human habitation. This colloquium examines the environmental history of the premodern Mediterranean focusing on the intersection between climate and human societies, particularly how humans respond to climate shifts in precariously arid zones. +",
  "prerequisite": null
 },
 {
  "code": "HIEU 167",
  "title": "Special Topics in the Social History of Early Modern Europe",
  "unit": "4",
  "description": "Topics will vary and may include political, socioeconomic, and cultural developments in the era from 1650 to 1850. Some years the emphasis will be on the theory and practice of revolutions and their impact on Europe and the world. Graduate students will be required to submit an additional piece of work.",
  "prerequisite": null
 },
 {
  "code": "HIEU 267",
  "title": "Special Topics in the Social History of Early Modern Europe",
  "unit": "4",
  "description": "Topics will vary and may include political, socioeconomic, and cultural developments in the era from 1650 to 1850. Some years the emphasis will be on the theory and practice of revolutions and their impact on Europe and the world. Graduate students will be required to submit an additional piece of work.",
  "prerequisite": null
 },
 {
  "code": "HIEU 171",
  "title": "Special Topics in Twentieth-Century Europe",
  "unit": "4",
  "description": "This course alternates with HIEU 170. Topics will vary from year to year.",
  "prerequisite": "background in European history."
 },
 {
  "code": "HIEU 271",
  "title": "Special Topics in Twentieth-Century Europe",
  "unit": "4",
  "description": "This course alternates with HIEU 170. Topics will vary from year to year.",
  "prerequisite": "background in European history."
 },
 {
  "code": "HIEU 172",
  "title": "Comparative European Fascism",
  "unit": "4",
  "description": "This course will be a comparative and thematic examination of the fascist movement and regimes in Europe from the 1920s to the 1940s. In particular, it will focus on the emergence of the two major fascist movements in Italy and Germany. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper- division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 272",
  "title": "Comparative European Fascism",
  "unit": "4",
  "description": "This course will be a comparative and thematic examination of the fascist movement and regimes in Europe from the 1920s to the 1940s. In particular, it will focus on the emergence of the two major fascist movements in Italy and Germany. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper- division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 174",
  "title": "The Holocaust: A Psychological Approach",
  "unit": "4",
  "description": "An examination of how traditional moral concerns and human compassion came to be abandoned and how the mass murder of the Jews was organized and carried out. The focus of this course will be on the perpetrators. Requirements will vary for undergraduate MA and PhD students. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": "upper-division or consent of instructor. Department stamp required."
 },
 {
  "code": "HIEU 274",
  "title": "The Holocaust: A Psychological Approach",
  "unit": "4",
  "description": "An examination of how traditional moral concerns and human compassion came to be abandoned and how the mass murder of the Jews was organized and carried out. The focus of this course will be on the perpetrators. Requirements will vary for undergraduate MA and PhD students. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": "upper-division or consent of instructor. Department stamp required."
 },
 {
  "code": "HIEU 176",
  "title": "Politics in the Jewish Past",
  "unit": "4",
  "description": "This seminar addresses Jewish civic autonomy in the late medieval era, the terms of emancipation in the European states, the politics of Jewish socialists, the costs of assimilation, and the consequences of a successful Zionist state in 1948. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 276",
  "title": "Politics in the Jewish Past",
  "unit": "4",
  "description": "This seminar addresses Jewish civic autonomy in the late medieval era, the terms of emancipation in the European states, the politics of Jewish socialists, the costs of assimilation, and the consequences of a successful Zionist state in 1948. Graduate students will be required to submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 178",
  "title": "Soviet History",
  "unit": "4",
  "description": "Topics will vary from year to year. Graduate students are required to submit a more substantial paper.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIEU 278",
  "title": "Soviet History",
  "unit": "4",
  "description": "Topics will vary from year to year. Graduate students are required to submit a more substantial paper.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIEU 182",
  "title": "The Muslim Experience in Contemporary European Society",
  "unit": "4",
  "description": "Comparative study of Islam in Europe since 1945. Topics include indigenous populations; immigration; Islamic law/church-state questions; EU expansion/integration; gender issues; terrorism; Islamophobia; “Europeanizing” Islam; the historical tradition of European-Muslim encounter and its present political/cultural issues. Graduate students will be required to do an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 282",
  "title": "The Muslim Experience in Contemporary European Society",
  "unit": "4",
  "description": "Comparative study of Islam in Europe since 1945. Topics include indigenous populations; immigration; Islamic law/church-state questions; EU expansion/integration; gender issues; terrorism; Islamophobia; “Europeanizing” Islam; the historical tradition of European-Muslim encounter and its present political/cultural issues. Graduate students will be required to do an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 183",
  "title": "Social History and Anthropology of the Mediterranean",
  "unit": "4",
  "description": "This seminar examines the social history and anthropology of the Mediterranean. Topics covered are the Mediterranean debate, rural economy, peasant society, gender relations, honor and shame, rural violence, class formation, and emigration. The seminar introduces the methodology of historical anthropology. Graduate students will be expected to complete an additional paper or project.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 283",
  "title": "Social History and Anthropology of the Mediterranean",
  "unit": "4",
  "description": "This seminar examines the social history and anthropology of the Mediterranean. Topics covered are the Mediterranean debate, rural economy, peasant society, gender relations, honor and shame, rural violence, class formation, and emigration. The seminar introduces the methodology of historical anthropology. Graduate students will be expected to complete an additional paper or project.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 184",
  "title": "Yugoslavia: Before, During, and After",
  "unit": "4",
  "description": "Examines the multiethnic Yugoslav states that existed from 1918 until the 1990s. Topics include interethnic relations, foreign affairs, Tito's revisionist communism, the consumerist Yugoslav Dream, culture and society, the violent break-up of the 1990s, and the post-Yugoslav order. Graduate students will be required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 284",
  "title": "Yugoslavia: Before, During, and After",
  "unit": "4",
  "description": "Examines the multiethnic Yugoslav states that existed from 1918 until the 1990s. Topics include interethnic relations, foreign affairs, Tito's revisionist communism, the consumerist Yugoslav Dream, culture and society, the violent break-up of the 1990s, and the post-Yugoslav order. Graduate students will be required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIEU 198",
  "title": "Directed Group Study",
  "unit": "1, 2, 3, 4",
  "description": "Directed group study on European history under the supervision of a member of the faculty on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": "upper-division standing, completion of at least ninety units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 2.95, a completed and approved Special Studies form, and department stamp."
 },
 {
  "code": "HIEU 199",
  "title": "Independent Study in European History",
  "unit": "4",
  "description": "Directed readings for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIEU 260",
  "title": "Topics in Ancient Greek History",
  "unit": "4",
  "description": "Selected topics in ancient Greek history. May be coscheduled with HIEU 160. May be taken for credit up to three times. Department approval required.",
  "prerequisite": null
 },
 {
  "code": "HIGL 101",
  "title": "Jews, Christians, and Muslims",
  "unit": "4",
  "description": "The course will explore the cultural, religious, and social relationships between the three major religious groups in the medieval Mediterranean: Muslims, Christians, and Jews from the sixth through sixteenth centuries AD. Renumbered from HITO 101. Students may not receive credit for HIGL 101 and HITO 101.",
  "prerequisite": null
 },
 {
  "code": "HIGL 104",
  "title": "The Jews and Judaism in the Ancient and Medieval Worlds",
  "unit": "4",
  "description": "The political and cultural history of the Jews through the early modern period. Life under ancient empires, Christianity and Islam. The post-biblical development of the Jewish religion and its eventual crystallization into the classical, rabbinic model. Renumbered from HITO 104. Students may not receive credit for HIGL 104 and HITO 104. +",
  "prerequisite": null
 },
 {
  "code": "HILA 100",
  "title": "Conquest and Empire: The Americas",
  "unit": "4",
  "description": "Lecture-discussion survey of Latin America from the pre-Columbian era to 1825. It addresses such issues as the nature of indigenous cultures, the implanting of colonial institutions, native resistance and adaptations, late colonial growth and the onset of independence. Students may not receive credit for both HILA 100 and HILA 100D. \\+",
  "prerequisite": null
 },
 {
  "code": "HILA 100D",
  "title": "Latin America: Colonial Transformation",
  "unit": "4",
  "description": "Lecture-discussion survey of Latin America from the pre-Columbian era to 1825. It addresses such issues as the nature of indigenous cultures, the implanting of colonial institutions, native resistance and adaptation, late colonial growth, and the onset of independence.",
  "prerequisite": null
 },
 {
  "code": "HILA 101",
  "title": "Nation-State Formation, Ethnicity, and Violence in Latin America",
  "unit": "4",
  "description": "Survey of Latin America in the nineteenth century. It addresses such issues as the collapse of colonial practices in the society and economy as well as the creation of national governments, political instability, disparities among regions within particular countries, and of economies oriented toward the export of goods to Europe and the United States.",
  "prerequisite": null
 },
 {
  "code": "HILA 102",
  "title": "Latin America in the Twentieth Century",
  "unit": "4",
  "description": "This course surveys the history of the region by focusing on two interrelated phenomena—the absence of democracy in most nations and the region's economic dependence on more advanced countries, especially the United States. Among the topics discussed will be the Mexican Revolution, the military in politics, labor movements, the wars in Central America, liberation theology, and the current debt crisis.",
  "prerequisite": null
 },
 {
  "code": "HILA 102D",
  "title": "Latin America in the Twentieth Century",
  "unit": "4",
  "description": "This course surveys the history of the region by focusing on two interrelated phenomena—the absence of democracy in most nations and the region's economic dependence on more advanced countries, especially the United States. Among the topics discussed will be the Mexican Revolution, the military in politics, labor movements, the wars in Central America, liberation theology, and the current debt crisis.",
  "prerequisite": null
 },
 {
  "code": "HILA 103",
  "title": "Revolution in Modern Latin America",
  "unit": "4",
  "description": "A political, economic, and social examination of the causes and consequences of the Mexican, Cuban, and Nicaraguan revolutions. Also examine guerrilla movements that failed to gain power in their respective countries, namely the Shining Path in Peru, FARC in Colombia, and the Zapatistas in Mexico.",
  "prerequisite": null
 },
 {
  "code": "HILA 104",
  "title": "Drugs in Latin America",
  "unit": "4",
  "description": "This course examines drugs in Latin America from the 1900s to the present. Brazil, Central America, Columbia, Mexico, and Peru are studied along with some short articles in other nations. We’ll also explore aspects of US intervention regarding drugs during and after the Cold War.",
  "prerequisite": null
 },
 {
  "code": "HILA 113",
  "title": "Lord and Peasant in Latin America",
  "unit": "4",
  "description": "Examination of the historical roots of population problems, social conflict, and revolution in Latin America, with emphasis on man-land relationships. Special emphasis on modern reform efforts and on Mexico, Cuba, Brazil, and Argentina. Lecture, discussion, reading, and films.",
  "prerequisite": null
 },
 {
  "code": "HILA 113D",
  "title": "Lord and Peasant in Latin America",
  "unit": "4",
  "description": "Examination of the historical roots of population problems, social conflict, and revolution in Latin America, with emphasis on man-land relationships. Special emphasis on modern reform efforts and on Mexico, Cuba, Brazil, and Argentina. Lecture, discussion, reading, and films.",
  "prerequisite": null
 },
 {
  "code": "HILA 114",
  "title": "Dictatorships in Latin America",
  "unit": "4",
  "description": "How did dictatorships come about? Who were the authoritarian leaders? How did they organize their regimes and what were the consequences? Recent publications on dictators in Latin America allow for comparisons across countries and throughout time to answer these questions.",
  "prerequisite": null
 },
 {
  "code": "HILA 114D",
  "title": "Dictatorship in Latin America",
  "unit": "4",
  "description": "How did dictatorships come about? Who were the authoritarian leaders? How did they organize their regimes and what were the consequences? Recent publications on dictators in Latin America allow for comparisons across countries and throughout time to answer these questions.",
  "prerequisite": null
 },
 {
  "code": "HILA 117",
  "title": "Indians, Blacks, and Whites: Family Relations in Latin America",
  "unit": "4",
  "description": "The development of family structures and relations among different ethnic groups. State and economy define and are defined by family relations. Thus, this family approach also provides an understanding to broader socioeconomic processes and cultural issues.",
  "prerequisite": null
 },
 {
  "code": "HILA 121A",
  "title": "History of Brazil through 1889",
  "unit": "4",
  "description": "This course covers many of the most transformative and fascinating social, political, and racial phenomena in Brazilian society through 1889, including indigenous life, Portuguese colonization, slavery and abolition, royal exile, independence and Empire, the birth of the Republic, war, social unrest, and ideals of modernization. +",
  "prerequisite": null
 },
 {
  "code": "HILA 121B",
  "title": "History of Brazil, 1889 to Present",
  "unit": "4",
  "description": "This course examines factors that shed light on Brazil’s label as a rising nation. In part, we will cover Brazil’s two dictatorships, labor struggles, racial issues, immigration from Asia and Europe, environmental concerns, and emergence as economic and political powerhouse.",
  "prerequisite": null
 },
 {
  "code": "HILA 122",
  "title": "Cuba: From Colony to Socialist Republic",
  "unit": "4",
  "description": "A lecture-discussion course on the historical roots of revolutionary Cuba, with special emphasis on the impact of the United States on the island's development and society.",
  "prerequisite": null
 },
 {
  "code": "HILA 123",
  "title": "The Incas and Their Ancestors",
  "unit": "4",
  "description": "The Incas called their realm Tahuantinsuyu (Land of the Four Quarters). But the Incas were only one of the many ethnic groups in the Andean region. Many different other groups became a part of the Tahuantinsuyu in the wake of Inca expansion. Over the past decade, new and fascinating information on these processes have been published and allow for a rereading of Inca history between 900 and 1535. +",
  "prerequisite": null
 },
 {
  "code": "HILA 124",
  "title": "The History of Chile 1880-Present",
  "unit": "4",
  "description": "The course surveys Chile's basic developments beginning with the era of nitrate exports. Students will have the opportunity to address a specific issue of his or her own choosing and develop the topic for class presentation and a final paper. The course will cover politics, cultural changes, class struggles, Allende's revolutionary movement, and Pinochet's dictatorship to the present.",
  "prerequisite": null
 },
 {
  "code": "HILA 124A",
  "title": "History of Women and Gender in Latin America",
  "unit": "4",
  "description": "A broad historical overview of Latin American women's history focusing on issues of gender, sexuality, and the family as they relate to women, as well as the historiographical issues in Latin American and Chicana women's history.",
  "prerequisite": null
 },
 {
  "code": "HILA 126",
  "title": "From Columbus to Castro: Caribbean Culture and Society",
  "unit": "4",
  "description": "Exploration of the relationships between socioeconomic and cultural development in Caribbean history; slavery and empire; nationalism and migration; vodun and Rastafarianism, and the literary arts.",
  "prerequisite": null
 },
 {
  "code": "HILA 131",
  "title": "A History of Mexico",
  "unit": "4",
  "description": "A century of Mexican history, 1821-1924: the quest for political unity and economic solvency, the forging of a nationality, the Gilded Age and aftermath, the ambivalent Revolution of Zapata and his enemies.",
  "prerequisite": null
 },
 {
  "code": "HILA 132",
  "title": "Modern Mexico: From Revolution to Drug War Violence",
  "unit": "4",
  "description": "The social and political history of twentieth-century Mexico from the outbreak of revolution to the current “war on drugs.” Highlights include the Zapatista calls for land reform, the muralist movement, and the betrayal of revolutionary ideals by a conservative elite. We will also study the Mexican urban experience and environmental degradation. Students may not receive credit for both HILA 132 and HILA 132GS.",
  "prerequisite": null
 },
 {
  "code": "HILA 132D",
  "title": "Modern Mexico: From Revolution to Drug War Violence",
  "unit": "4",
  "description": "The social and political history of twentieth-century Mexico from the outbreak of revolution to the current \"war on drugs.\" Highlights include the Zapatista calls for land reform, the muralist movement, and the betrayal of revolutionary ideals by a conservative elite. We will also study the Mexican urban experience and environmental degradation.",
  "prerequisite": null
 },
 {
  "code": "HILA 132GS",
  "title": "Modern Mexico: From Revolution to Drug War Violence",
  "unit": "4",
  "description": "The social and political history of twentieth-century Mexico from the outbreak of revolution to the current \"war on drugs.\" Highlights include the Zapatista calls for land reform, the muralist movement, and the betrayal of revolutionary ideals by a conservative elite. We will also study the Mexican urban experience and environmental degradation. Students may not receive credit for both HILA 132 and HILA 132GS. Program or materials fees may apply. Students must apply and be accepted to the Global Seminars Program.",
  "prerequisite": null
 },
 {
  "code": "HILA 133S",
  "title": "Guerrillas and Revolution in Latin America",
  "unit": "4",
  "description": "This course surveys guerrilla movements in Latin America from the Cuban Revolution through the Zapatista movement in Mexico, comparing and contrasting the origins, trajectories, and legacies of armed insurgencies, and focusing on the politics of defining \"insurgents,\" \"revolutionaries,\" and \"terrorists.\"",
  "prerequisite": null
 },
 {
  "code": "HILA 134",
  "title": "Indians of Colonial Latin America",
  "unit": "4",
  "description": "This course surveys the history of the native peoples of Mexico and the Andes from Iberian contact to the late colonial period (1492-1800). It focuses on changes and continuities in postconquest society, exploring topics such as gender, sexuality, and resistance.",
  "prerequisite": null
 },
 {
  "code": "HILA 144",
  "title": "Topics in Latin American History",
  "unit": "4",
  "description": "Selected topics in Latin American history. Course may be taken for credit up to three times as topics vary (the course subtitle will be different for each distinct topic). Students who repeat the same topic in HILA 144 will have the duplicate credit removed from their academic record.",
  "prerequisite": null
 },
 {
  "code": "HILA 145",
  "title": "People and Nature in Amazonia: An Unwritten History",
  "unit": "4",
  "description": "Recordings of Amazonia's past before Iberian adventurers searched for El Dorado are scarce. Environmental significance and the continued existence of large fluvial societies, read through the lenses of chroniclers, scientists, missionaries, and colonizers, allows a reconstruction of humankind's relationship to nature.",
  "prerequisite": null
 },
 {
  "code": "HILA 161",
  "title": "History of Women in Latin America",
  "unit": "4",
  "description": "A broad historical overview of Latin American women's history of focusing on the issues of gender, sexuality, and the family as they relate to women, as well as the historiographical issues in Latin American and Chicana women's history.",
  "prerequisite": null
 },
 {
  "code": "HILA 261",
  "title": "History of Women in Latin America",
  "unit": "4",
  "description": "A broad historical overview of Latin American women's history of focusing on the issues of gender, sexuality, and the family as they relate to women, as well as the historiographical issues in Latin American and Chicana women's history.",
  "prerequisite": null
 },
 {
  "code": "HILA 162",
  "title": "Special Topics in Latin American History",
  "unit": "4",
  "description": "Topics will vary from year to year or quarter to quarter. May be repeated for an infinite number of times due to the nature of the content of the course always changing.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 262",
  "title": "Special Topics in Latin American History",
  "unit": "4",
  "description": "Topics will vary from year to year or quarter to quarter. May be repeated for an infinite number of times due to the nature of the content of the course always changing.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 163",
  "title": "The History of Chile 1880-Present",
  "unit": "4",
  "description": "The course surveys Chile's basic developments beginning with the era of nitrate exports. Students will have the opportunity to address a specific issue of his/her own choosing and develop the topic for class presentation and a final paper. Graduate students are expected to submit a more substantial piece of work.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 263",
  "title": "The History of Chile 1880-Present",
  "unit": "4",
  "description": "The course surveys Chile's basic developments beginning with the era of nitrate exports. Students will have the opportunity to address a specific issue of his/her own choosing and develop the topic for class presentation and a final paper. Graduate students are expected to submit a more substantial piece of work.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 164",
  "title": "Women's Work and Family Life in Latin America",
  "unit": "4",
  "description": "Inside or outside the household, women have always worked. Where do we find Latin American women? How has the labor market changed? How was and is women's work perceived? What were the consequences of changing work patterns on family life?",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 264",
  "title": "Women's Work and Family Life in Latin America",
  "unit": "4",
  "description": "Inside or outside the household, women have always worked. Where do we find Latin American women? How has the labor market changed? How was and is women's work perceived? What were the consequences of changing work patterns on family life?",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HILA 167",
  "title": "Scholarship on Latin American History in the Colonial Period",
  "unit": "4",
  "description": "Introduction to the historiography on Latin America for the colonial period from Spanish and Portuguese conquests to the Wars of Independence. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional research paper.",
  "prerequisite": "upper-division standing or consent of instructor; reading knowledge of Spanish; department stamp. \\+"
 },
 {
  "code": "HILA 267",
  "title": "Scholarship on Latin American History in the Colonial Period",
  "unit": "4",
  "description": "Introduction to the historiography on Latin America for the colonial period from Spanish and Portuguese conquests to the Wars of Independence. Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit an additional research paper.",
  "prerequisite": "upper-division standing or consent of instructor; reading knowledge of Spanish; department stamp. \\+"
 },
 {
  "code": "HILA 171",
  "title": "Topics in Latin American History Since 1910",
  "unit": "4",
  "description": "Topics may vary from year to year. May be repeated for credit. Requirements will vary for undergraduates, MA, and PhD students. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": null
 },
 {
  "code": "HILA 271",
  "title": "Topics in Latin American History Since 1910",
  "unit": "4",
  "description": "Topics may vary from year to year. May be repeated for credit. Requirements will vary for undergraduates, MA, and PhD students. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": null
 },
 {
  "code": "HILA 198",
  "title": "Directed Group Study",
  "unit": "4",
  "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": null
 },
 {
  "code": "HILA 199",
  "title": "Independent Study in Latin American History",
  "unit": "4",
  "description": "Directed readings for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor and department stamp."
 },
 {
  "code": "HINE 100",
  "title": "The Hebrew Bible and History",
  "unit": "4",
  "description": "The history and literature of ancient Israel c. 1300 to 300 BCE. Reading from the Bible, historical and archaeological surveys, and studies of authorship. +",
  "prerequisite": null
 },
 {
  "code": "HINE 101",
  "title": "The Religion of Ancient Israel",
  "unit": "4",
  "description": "Based on biblical and nonbiblical sources, a reconstruction of Israelite institutions, beliefs, and practices and their evolution over time. +",
  "prerequisite": null
 },
 {
  "code": "HINE 108",
  "title": "The Middle East before Islam",
  "unit": "4",
  "description": "The peoples, politics, and cultures of Southwest Asia and Egypt from the sixth century BCE to the seventh century CE. The Achaemenid Empire, the Ptolemaic and Seleucid kingdoms, the Roman Orient, the Parthian and Sasanian states. \\+",
  "prerequisite": null
 },
 {
  "code": "HINE 109",
  "title": "History of the Middle East (1200-1800): The Ottoman Empire",
  "unit": "4",
  "description": "A survey of the history of the Middle East, in particular, the Ottoman Empire, from 1200-1800. The course examines the emergence of a new political and religious order following the Mongol conquests and its long-lasting effect on the region. +",
  "prerequisite": null
 },
 {
  "code": "HINE 110",
  "title": "Jesus, the Gospels, and History",
  "unit": "4",
  "description": "Explore the ancient sources for the life of Jesus. Students will learn about various modern approaches to reconstructing the historical Jesus and will examine the difficulties inherent in such a task.",
  "prerequisite": null
 },
 {
  "code": "HINE 112A",
  "title": "Great Stories from the Hebrew Bible",
  "unit": "4",
  "description": "A close reading of select prose narratives from the Hebrew Bible/Old Testament. +",
  "prerequisite": null
 },
 {
  "code": "HINE 112AL",
  "title": "Great Stories from the Hebrew Bible/Foreign Language",
  "unit": "1",
  "description": "Students with advanced Hebrew can study the texts in HINE 112A in the original language.",
  "prerequisite": null
 },
 {
  "code": "HINE 112B",
  "title": "Great Poems from the Hebrew Bible",
  "unit": "4",
  "description": "A close reading of select poetic passages from the Hebrew Bible/Old Testament. +",
  "prerequisite": null
 },
 {
  "code": "HINE 112BL",
  "title": "Great Poems from the Hebrew Bible/Foreign Language",
  "unit": "1",
  "description": "Students with advanced Hebrew can study the texts in HINE 112B in the original language.",
  "prerequisite": null
 },
 {
  "code": "HINE 113",
  "title": "Ancient Near East Mythology",
  "unit": "4",
  "description": "Course will analyze and compare major myths from Egypt, Israel, Ugarit, and Mesopotamia, employing a variety of modern approaches. +",
  "prerequisite": null
 },
 {
  "code": "HINE 114",
  "title": "History of the Islamic Middle East",
  "unit": "4",
  "description": "A survey of the Middle East from the rise of Islam to the region's economic, political, and cultural integration into the West (mid-nineteenth century). Emphasis on socioeconomic and political change in the early Arab empires and the Ottoman state. \\+",
  "prerequisite": null
 },
 {
  "code": "HINE 115",
  "title": "Death and Dying in Antiquity",
  "unit": "4",
  "description": "Exploration of ideas, beliefs, and practices pertaining to death from a variety of ancient cultures: Near Eastern, Israelite, Greek, Roman, Jewish, and early Christian. Themes include immortality, afterlife, care for the dying, suicide, funerary rituals, martyrdom, and resurrection. +",
  "prerequisite": null
 },
 {
  "code": "HINE 116",
  "title": "The Ottoman Empire, Iran and Egypt (1798-1914)",
  "unit": "4",
  "description": "Examines the contacts of the late Ottoman Empire and Qajar Iran with Europe from the Napoleonic invasion of Egypt to World War I, the diverse facets of the relationship with the West, and the reshaping of the institutions of the Islamic states and societies.",
  "prerequisite": null
 },
 {
  "code": "HINE 118",
  "title": "The Middle East in the Twentieth Century",
  "unit": "4",
  "description": "An introduction to the history of the Middle East since 1914. Themes such as nationalism, imperialism, the oil revolution, and religious revivalism will be treated within a broad chronological and comparative framework drawing on the experience of selected countries.",
  "prerequisite": null
 },
 {
  "code": "HINE 119",
  "title": "US Mid-East Policy Post-WWII",
  "unit": "4",
  "description": "An examination of post-WWII Middle East conflicts, including the Israeli-Arab conflicts, the Lebanese Civil War, and the Gulf War of the 1980s. The roles of the superpowers and Middle Eastern states during the period.",
  "prerequisite": null
 },
 {
  "code": "HINE 120",
  "title": "The Middle East in the New Century",
  "unit": "4",
  "description": "An examination of the conflicts, changes, and continuities in the Middle East since 2000. The course includes inspection of the US role in Iraq and the region generally.",
  "prerequisite": null
 },
 {
  "code": "HINE 125",
  "title": "Jews in the Greek and Roman World",
  "unit": "4",
  "description": "A history of Jews and Judaism from 300 BCE to 500 CE, emphasizing cultural and religious exchanges and interactions of Jews with Greece and Rome. Among the topics covered in class: Hellenism and the emergence of Jewish identity; political resistance and cultural adaptation; the beginnings of Christianity and varieties of Jewish belief and practice in antiquity. +",
  "prerequisite": null
 },
 {
  "code": "HINE 126",
  "title": "Iranian Revolution in Historical Perspective",
  "unit": "4",
  "description": "Iran's social and political history in the twentieth century with emphasis on the Constitutional movement of the late Qajar period, formation and development of the Pahlavi state, anatomy of the 1978-79 Revolution, and a survey of the Islamic Republic.",
  "prerequisite": null
 },
 {
  "code": "HINE 127",
  "title": "History of Modern Turkey",
  "unit": "4",
  "description": "Eastern problems on the example of Turkey and with special attention to collective identities, state-society dynamics, foreign and regional policies, and varieties of modernity.",
  "prerequisite": null
 },
 {
  "code": "HINE 128",
  "title": "History of the Middle East: The Early Medieval Period, 500-1000",
  "unit": "4",
  "description": "This class covers the history of the Middle East and the larger Mediterranean world from 500 to 1000. It surveys the late antique world in the sixth century and the birth of Islam, the rise of the early Islamic empires stretching from Central Asia to Spain, and the creation of a larger Arabo-Islamic culture in the Abbasid Empire. +",
  "prerequisite": null
 },
 {
  "code": "HINE 129",
  "title": "History of the Middle East: The Late Medieval Period, 1000-1500",
  "unit": "4",
  "description": "This class covers the history of the Middle East and the larger Mediterranean world from 1000 to 1500. The class discusses not only dynasties and kingdoms like that of Umayyad Spain, Mamluk Egypt, and Seljuk Iran, but also the impact of the Crusades, the Mongol conquests, and the growing frontier at the edges of the Islamic world. +",
  "prerequisite": null
 },
 {
  "code": "HINE 135GS",
  "title": "Introduction to Contemporary Israeli Society and Culture",
  "unit": "4",
  "description": "This course introduces the students to contemporary Israeli society. Among the topics explored: Israeli-Arab conflict; relations between European, Arab, Russian, and Ethiopian Jews; between secular and religious Jews; between Jews and Arabs; and between Israel and World Jewry.",
  "prerequisite": null
 },
 {
  "code": "HINE 136GS",
  "title": "Zionism and Post Zionism",
  "unit": "4",
  "description": "This course explores the evolution of Zionism from its late nineteenth-century origins to the present. Among the topics explored: political, cultural, spiritual and social varieties of Zionism; and the contending narratives about its nature, meaning, and accomplishments.",
  "prerequisite": null
 },
 {
  "code": "HINE 144",
  "title": "Topics in Middle Eastern History",
  "unit": "4",
  "description": "Selected topics in the history of the Middle East. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HINE 160",
  "title": "Special Topics in the Bible and Ancient Near East",
  "unit": "4",
  "description": "The study of a single book, period, or issue on the Bible, in the context of the ancient Near Eastern world. Requirements will vary for undergraduate, master's, and doctoral students. Graduate students may be required to submit a more substantial piece of work.",
  "prerequisite": "department stamp required. +"
 },
 {
  "code": "HINE 260",
  "title": "Special Topics in the Bible and Ancient Near East",
  "unit": "4",
  "description": "The study of a single book, period, or issue on the Bible, in the context of the ancient Near Eastern world. Requirements will vary for undergraduate, master's, and doctoral students. Graduate students may be required to submit a more substantial piece of work.",
  "prerequisite": "department stamp required. +"
 },
 {
  "code": "HINE 162",
  "title": "Anthropology and the Hebrew Bible",
  "unit": "4",
  "description": "This course approaches the Hebrew Bible (Old Testament) from the perspective of cultural anthropology. Institutions studied will include the family, rites of passage, food taboos, warfare, animism, demons, sorcery, and animal sacrifice. Formerly HINE 111; students may not receive credit for HINE 111 and HINE 162/262. Graduate students will be required to complete an extra paper.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HINE 262",
  "title": "Anthropology and the Hebrew Bible",
  "unit": "4",
  "description": "This course approaches the Hebrew Bible (Old Testament) from the perspective of cultural anthropology. Institutions studied will include the family, rites of passage, food taboos, warfare, animism, demons, sorcery, and animal sacrifice. Formerly HINE 111; students may not receive credit for HINE 111 and HINE 162/262. Graduate students will be required to complete an extra paper.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HINE 165",
  "title": "The Colonial Mandates in the Middle East",
  "unit": "4",
  "description": "A colloquium focusing on the problems and patterns in the emergence of modern Middle Eastern states since 1920.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HINE 265",
  "title": "The Colonial Mandates in the Middle East",
  "unit": "4",
  "description": "A colloquium focusing on the problems and patterns in the emergence of modern Middle Eastern states since 1920.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HINE 166",
  "title": "Nationalism in the Middle East",
  "unit": "4",
  "description": "Growth of nationalism in relation to imperialism, religion, and revolution in the nineteenth- and twentieth-century Middle East. Emergence of cultural and political ethnic consciousness in the Ottoman state. Comparative study of Arab, Iranian, and Turkish nationalism as well as Zionism.",
  "prerequisite": "department stamp or consent of instructor."
 },
 {
  "code": "HINE 266",
  "title": "Nationalism in the Middle East",
  "unit": "4",
  "description": "Growth of nationalism in relation to imperialism, religion, and revolution in the nineteenth- and twentieth-century Middle East. Emergence of cultural and political ethnic consciousness in the Ottoman state. Comparative study of Arab, Iranian, and Turkish nationalism as well as Zionism.",
  "prerequisite": "department stamp or consent of instructor."
 },
 {
  "code": "HINE 170",
  "title": "Special Topics in Jewish History",
  "unit": "4",
  "description": "This course studies a period or theme in Jewish history. Topics will vary from year to year.",
  "prerequisite": "department stamp required."
 },
 {
  "code": "HINE 270",
  "title": "Special Topics in Jewish History",
  "unit": "4",
  "description": "This course studies a period or theme in Jewish history. Topics will vary from year to year.",
  "prerequisite": "department stamp required."
 },
 {
  "code": "HINE 171",
  "title": "Topics in Early Judaism and Christianity",
  "unit": "4",
  "description": "Selected topics in the history of Judaism and Christianity in the first through fourth centuries CE, with emphasis on the shared origins and mutual relations of the two religions. May be taken for credit up to two times. +",
  "prerequisite": null
 },
 {
  "code": "HINE 271",
  "title": "Topics in Early Judaism and Christianity",
  "unit": "4",
  "description": "Selected topics in the history of Judaism and Christianity in the first through fourth centuries CE, with emphasis on the shared origins and mutual relations of the two religions. May be taken for credit up to two times. +",
  "prerequisite": null
 },
 {
  "code": "HINE 186",
  "title": "Special Topics in Middle Eastern History",
  "unit": "4",
  "description": "Focused study of historical roots of contemporary problems in the Middle East: Islamic modernism and Islamist movements; contacts with the West; ethnic and religious minorities; role of the military; economic resources and development. Department stamp and permission of instructor.",
  "prerequisite": null
 },
 {
  "code": "HINE 286",
  "title": "Special Topics in Middle Eastern History",
  "unit": "4",
  "description": "Focused study of historical roots of contemporary problems in the Middle East: Islamic modernism and Islamist movements; contacts with the West; ethnic and religious minorities; role of the military; economic resources and development. Department stamp and permission of instructor.",
  "prerequisite": null
 },
 {
  "code": "HINE 198",
  "title": "Directed Group Study",
  "unit": "4",
  "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": null
 },
 {
  "code": "HINE 199",
  "title": "Independent Study in Near Eastern History",
  "unit": "4",
  "description": "Directed readings for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HISC 102",
  "title": "Technology in World History",
  "unit": "4",
  "description": "Technology as an agent of change. How have humans harnessed the power of nature? What factors have contributed to successes and failures? How has technology changed human life? How should we evaluate the quality of these changes?",
  "prerequisite": null
 },
 {
  "code": "HISC 103",
  "title": "Gender and Science in Historical Perspective",
  "unit": "4",
  "description": "History of women's struggles and strategies for access and equality in professional science. Questions related to gender bias in science—as a social institution and as an epistemological enterprise—will be addressed in light of the historical and biographical readings.",
  "prerequisite": null
 },
 {
  "code": "HISC 104",
  "title": "History of Popular Science",
  "unit": "4",
  "description": "Historical aspects of the popularization of science. The changing relation between expert science and popular understanding. The reciprocal impact of scientific discoveries and theories, and popular conceptions of the natural world.",
  "prerequisite": null
 },
 {
  "code": "HISC 105",
  "title": "History of Environmentalism",
  "unit": "4",
  "description": "History of human effects on the natural environment, with emphasis on understanding the roles of the physical and biological sciences in providing insights into environmental processes.",
  "prerequisite": null
 },
 {
  "code": "HISC 106",
  "title": "The Scientific Revolution",
  "unit": "4",
  "description": "A cultural history of the formation of early modern science in the sixteenth and seventeenth centuries: the social forms of scientific life; the construction and meaning of the new cosmologies from Copernicus to Newton; the science of politics and the politics of science; the origins of experimental practice; how Sir Isaac Newton restored law and order to the West. \\+",
  "prerequisite": null
 },
 {
  "code": "HISC 107",
  "title": "The Emergence of Modern Science",
  "unit": "4",
  "description": "The development of the modern conception of the sciences, and of the modern social and institutional structure of scientific activity, chiefly in Europe, during the eighteenth and nineteenth centuries.",
  "prerequisite": null
 },
 {
  "code": "HISC 108",
  "title": "Life Sciences in the Twentieth Century",
  "unit": "4",
  "description": "The history of twentieth-century life sciences, with an emphasis on the way in which model organisms such as fruit flies, guinea pigs, bacteriophage, and zebra fish shaped the quest to unlock the secrets of heredity, evolution, and development.",
  "prerequisite": null
 },
 {
  "code": "HISC 109",
  "title": "Invention of Tropical Disease",
  "unit": "4",
  "description": "Explores the origins of the idea of the “tropics” and “tropical disease” as a legacy of European conquest and colonization and introduces students to themes in the history of colonialism, tropical medicine, and global public health.",
  "prerequisite": null
 },
 {
  "code": "HISC 110",
  "title": "Historical Encounters of Science and Religion",
  "unit": "4",
  "description": "There was no such thing as a single, unchanging relationship between science and religion, and this is a course about it. Topics include the \"Conflict Thesis,\" natural theology, the Galileo Affair, Darwinism, the antievolution crusade, creationism, secularization, atheism, and psychoanalysis. +",
  "prerequisite": null
 },
 {
  "code": "HISC 111",
  "title": "The Atomic Bomb and the Atomic Age",
  "unit": "4",
  "description": "Development of nuclear science and weapons—1930s to present—including the discovery of radioactivity and fission, the Manhattan project, the bombings of Hiroshima and Nagasaki and end of WWII, the H-bomb, and legacies of nuclear proliferation, environmental damage, and radioactive waste.",
  "prerequisite": null
 },
 {
  "code": "HISC 115",
  "title": "History of Modern Medicine",
  "unit": "4",
  "description": "Explores the origin of clinical method, the hospital, internal surgery, and the medical laboratory, as well as the historical roots of debates over health-care reform, genetic determinism, and the medicalization of society.",
  "prerequisite": null
 },
 {
  "code": "HISC 116",
  "title": "History of Bioethics",
  "unit": "4",
  "description": "The story behind the postwar rise of bioethics—medical scandals breaking in the mass media, the development of novel technologies for saving and prolonging life, the emergence of new diseases, the unprecedented scope for manipulation opened up by biology.",
  "prerequisite": null
 },
 {
  "code": "HISC 117",
  "title": "History of the Neurosciences",
  "unit": "4",
  "description": "A survey of the history of the neurosciences from the seventeenth century to the present, exploring the political, philosophical, cultural, aesthetic and ethical aspects of research into the workings of the human brain.",
  "prerequisite": null
 },
 {
  "code": "HISC 118",
  "title": "History of Sexology",
  "unit": "4",
  "description": "Analyzes the history of sexology as a series of episodes in the science of human difference, from the European reception of the first translation of the Kama Sutra in 1883 to the search for the “gay gene” in the 1990s.",
  "prerequisite": null
 },
 {
  "code": "HISC 119",
  "title": "Biology and Society",
  "unit": "4",
  "description": "This course explores contemporary issues in biology, ethics, and society. We will start by examining early cases of biopolitics, like social Darwinism and eugenics, and proceed to more recent issues, such as genetic engineering, patenting life, and the pharmaceutical industry.",
  "prerequisite": null
 },
 {
  "code": "HISC 120A",
  "title": "Technology in America I",
  "unit": "4",
  "description": "The role of technology in American history through the Civil War. Indigenous and colonial development, transportation infrastructures, and industrialization are explored to understand the connections among technology, society, and culture. \\+",
  "prerequisite": null
 },
 {
  "code": "HISC 131",
  "title": "Science, Technology, and Law",
  "unit": "4",
  "description": "Science and law are two of the most powerful establishments of modern Western culture. Science organizes our knowledge of the world; law directs our action in it. Will explore the historical roots of the interplay between them.",
  "prerequisite": null
 },
 {
  "code": "HISC 132",
  "title": "Israel—Start-up Nation",
  "unit": "4",
  "description": "Through scientific and technological innovation Israel came to be known as the \"Start-up Nation.\" This course will explore the reasons why scientific and technological innovation became fundamental to Israeli society and their social, cultural, and economic implications. Students may not receive credit for HISC 132 and HISC 132GS.",
  "prerequisite": null
 },
 {
  "code": "HISC 132GS",
  "title": "Israel—Start-up Nation",
  "unit": "4",
  "description": "Through scientific and technological innovation Israel came to be known as the \"Start-up Nation.\" This course will explore the reasons why scientific and technological innovation became fundamental to Israeli society and their social, cultural, and economic implications. Students may not receive credit for HISC 132GS and HISC 132. Program or materials fees may apply. Students must apply and be accepted into the Global Seminar Program.",
  "prerequisite": null
 },
 {
  "code": "HISC 163",
  "title": "History, Science, and Politics of Climate Change",
  "unit": "4",
  "description": "The complex historical development of human understanding of global climate change, including key scientific work, and the cultural dimensions of proof and persuasion. Special emphasis on the differential political acceptance of the scientific evidence in the United States and the world. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing. Department stamp required."
 },
 {
  "code": "HISC 263",
  "title": "History, Science, and Politics of Climate Change",
  "unit": "4",
  "description": "The complex historical development of human understanding of global climate change, including key scientific work, and the cultural dimensions of proof and persuasion. Special emphasis on the differential political acceptance of the scientific evidence in the United States and the world. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing. Department stamp required."
 },
 {
  "code": "HISC 165",
  "title": "Topics in Twentieth-Century Science and Culture",
  "unit": "4",
  "description": "This seminar explores topics at the interface of science, technology, and culture, from the late nineteenth century to the present. Topics change yearly; may be repeated for credit with instructor's permission.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HISC 167",
  "title": "Gender and Science",
  "unit": "4",
  "description": "Why have women been traditionally excluded from science? How has this affected scientific knowledge? How have scientists constructed gendered representations not only of women, but also of science and nature? We will address these questions from perspectives including history, philosophy, and psychoanalytic theory.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HISC 267",
  "title": "Gender and Science",
  "unit": "4",
  "description": "Why have women been traditionally excluded from science? How has this affected scientific knowledge? How have scientists constructed gendered representations not only of women, but also of science and nature? We will address these questions from perspectives including history, philosophy, and psychoanalytic theory.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HISC 173",
  "title": "Seminar on Darwin and Darwinisms",
  "unit": "4",
  "description": "Examines evolutionary theory before Darwin, the development of the theory of natural selection, the ongoing challenge from Lamarckism, nineteenth-century social Darwinism, the emergence of the neo-Darwinist synthesis, and the recent controversies over evolutionary psychology and creationism. Graduate students are expected to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 273",
  "title": "Seminar on Darwin and Darwinisms",
  "unit": "4",
  "description": "Examines evolutionary theory before Darwin, the development of the theory of natural selection, the ongoing challenge from Lamarckism, nineteenth-century social Darwinism, the emergence of the neo-Darwinist synthesis, and the recent controversies over evolutionary psychology and creationism. Graduate students are expected to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 174",
  "title": "History of Localization of Brain Function",
  "unit": "4",
  "description": "From the beginnings of brain anatomy in the 1660s to the current rage for functional magnetic resonance imaging studies, this class investigates philosophical, ethical, and cultural dimensions of the quest to localize psychological phenomena in the physical brain. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 274",
  "title": "History of Localization of Brain Function",
  "unit": "4",
  "description": "From the beginnings of brain anatomy in the 1660s to the current rage for functional magnetic resonance imaging studies, this class investigates philosophical, ethical, and cultural dimensions of the quest to localize psychological phenomena in the physical brain. Graduate students are required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 175",
  "title": "The Historical Sciences in the Nineteenth Century",
  "unit": "4",
  "description": "A critical analysis of the host of “historical sciences” that developed over the course of the long nineteenth century, from archaeology and paleontology to psychoanalysis and craniotomy, including the science of history itself. Graduate students will be required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 275",
  "title": "The Historical Sciences in the Nineteenth Century",
  "unit": "4",
  "description": "A critical analysis of the host of “historical sciences” that developed over the course of the long nineteenth century, from archaeology and paleontology to psychoanalysis and craniotomy, including the science of history itself. Graduate students will be required to submit an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HISC 176",
  "title": "History of Medicine in East and Southeast Asia",
  "unit": "4",
  "description": "This course introduces students to new and classic works in the history of medicine in East and Southeast Asia. Topics will include epidemic disease and state vaccination campaigns; opium and drug control; mental illness and asylums; earthquakes and disaster technologies; colonialism and public health; venereal disease and prostitution. Special emphasis will be placed on the role of experts and institutions and forms of scientific exchange and collaboration across the region.",
  "prerequisite": null
 },
 {
  "code": "HISC 180",
  "title": "Science and Public Policy",
  "unit": "4",
  "description": "This course will explore the evolution of the institutions, ideologies, procedures, standards, and expertise that modern democratic societies have used in applying science to generate and legitimate public policy.",
  "prerequisite": null
 },
 {
  "code": "HISC 280",
  "title": "Science and Public Policy",
  "unit": "4",
  "description": "This course will explore the evolution of the institutions, ideologies, procedures, standards, and expertise that modern democratic societies have used in applying science to generate and legitimate public policy.",
  "prerequisite": null
 },
 {
  "code": "HISC 198",
  "title": "Directed Group Study",
  "unit": "4",
  "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": null
 },
 {
  "code": "HISC 199",
  "title": "Independent Study in the History of Science",
  "unit": "4",
  "description": "Directed readings for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HISC 276",
  "title": "History of Medicine in East and Southeast Asia",
  "unit": "4",
  "description": "This course introduces students to new and classic works in the history of medicine in East and Southeast Asia. Topics will include epidemic disease and state vaccination campaigns; opium and drug control; mental illness and asylums; earthquakes and disaster technologies; colonialism and public health; venereal disease and prostitution. Special emphasis will be placed on the role of experts and institutions and forms of scientific exchange and collaboration across the region.",
  "prerequisite": null
 },
 {
  "code": "HITO 87",
  "title": "Special First-year Student Seminar",
  "unit": "1",
  "description": "A seminar intended for exposing undergraduate students, especially first-year students, to exciting research programs conducted by department faculty. Enrollment is limited. Topic will vary quarter by quarter.",
  "prerequisite": null
 },
 {
  "code": "HITO 99",
  "title": "Independent Study on History Topics",
  "unit": "1, 2, 3, 4",
  "description": "Independent study for undergraduates with lower-division standing under the supervision of a member of the faculty on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": "lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Special Studies form."
 },
 {
  "code": "HITO 103S",
  "title": "Gnosis and Gnosticism",
  "unit": "4",
  "description": "This course will examine the development of Gnostic Christianity in the first four centuries CE. Students will also explore similar non-Christian religious movements that claimed to have special knowledge (gnosis) of the self, the material world, and the divine.",
  "prerequisite": null
 },
 {
  "code": "HITO 105",
  "title": "Jewish Modernity from 1648 to 1948",
  "unit": "4",
  "description": "Topics include the political emancipation of the Jews of Europe; the emergence of Reform, Conservative, and Modern Orthodox Judaism; Hasidism; modern anti- Semitism; Jewish socialism; Zionism; the Holocaust; the American Jewish community; the State of Israel.",
  "prerequisite": null
 },
 {
  "code": "HITO 106",
  "title": "Love and Family in the Jewish Past",
  "unit": "4",
  "description": "This course explores Jewish women's experiences from the seventeenth century to the present, covering Europe, the United States, and Israel. Examines work, marriage, motherhood, spirituality, education, community, and politics across three centuries and three continents. ",
  "prerequisite": "MMW 11, 12, 13, 14, 15, 21 or 22; or WCWP 10A or 10B; or CAT 1, 2, or 3; or DOC 1, 2 or 3; or HILD 2A, 2B, 2C, 7A, 7B, 7C, 10, 11, 12, or 14; or MCWP 40, 41, 50 or 125; or HUM 1, 2, 3, 4, or 5."
 },
 {
  "code": "HITO 107",
  "title": "Holocaust Video Production",
  "unit": "4",
  "description": "Students will produce creative video projects by conducting interviews and drawing from relevant texts, lectures, archival resources, and other materials to expand and deepen their understanding of the Holocaust and help contribute to the body of work documenting this period in history.",
  "prerequisite": null
 },
 {
  "code": "HITO 114",
  "title": "History of Modern Vietnam",
  "unit": "4",
  "description": "This course introduces students to the history of modern Vietnam, starting with the Tay Son rebellion in the late eighteenth century and ending with the economic reforms of the 1980s. Topics include the expansion and consolidation of the French colonial state, the rise of anticolonialism and nationalism, the development of Vietnamese communism, World War II, and the First and Second Indochina Wars. A special emphasis will be focused on the place of Vietnam within wider regional and global histories.",
  "prerequisite": null
 },
 {
  "code": "HITO 115",
  "title": "The Global Cold War",
  "unit": "4",
  "description": "The Cold War is often understood as a superpower rivalry between the U.S. and the Soviet Union. Yet, the second half of the twentieth century witnessed civil wars, revolutions, decolonization movements, and state violence throughout the world that do not fit in this bipolar framework. Focusing on these other events, this course reexamines the Cold War in global and comparative perspective, with a particular focus on political developments in Asia, Africa, and Latin America.",
  "prerequisite": null
 },
 {
  "code": "115GS",
  "title": "The Global Cold War",
  "unit": "4",
  "description": "The Cold War is often understood as a superpower rivalry between the U.S. and the Soviet Union. Yet, the second half of the twentieth century witnessed civil wars, revolutions, decolonization movements, and state violence throughout the world that do not fit in this bipolar framework. Focusing on these other events, this course reexamines the Cold War in global and comparative perspective, with a particular focus on political developments in Asia, Africa, and Latin America.",
  "prerequisite": null
 },
 {
  "code": "HITO 115S",
  "title": "Myth, History, and Archaeology",
  "unit": "4",
  "description": "Sources for reconstructing ancient history present special challenges. Introduce and examine critically some basic myths and chronicles of the eastern Mediterranean and ancient Near East and assess the challenges to today's historian in reconstructing these histories.",
  "prerequisite": null
 },
 {
  "code": "HITO 116",
  "title": "Car Wars: A Global History of the World since 1900 through Cars",
  "unit": "4",
  "description": "How did cars come to dominate the world? This course provides a survey of the world since 1900 to the near future through the history of cars and their impacts on politics, economics, society, and the environment.",
  "prerequisite": null
 },
 {
  "code": "HITO 117",
  "title": "World History 1200-1800",
  "unit": "4",
  "description": "This course examines the interaction between sections of the globe after 1200. It emphasizes factors operating on a transcontinental scale (disease, climate, migration) and historical/cultural phenomena that bridge distance (religion, trade, urban systems). This is not narrative history, but a study of developments that operated on a global scale and constituted the first phase of globalization. \\+",
  "prerequisite": null
 },
 {
  "code": "HITO 123",
  "title": "The Global History of Soccer",
  "unit": "4",
  "description": "The most popular sport in the world is soccer. The game's growth and expansion was thoroughly enmeshed with the spread of modernity. It was a product of the industrial and political revolutions of the nineteenth and twentieth centuries. It has been an engine of nationalism and gender formation. The link of this sport to politics will be a central theme.",
  "prerequisite": null
 },
 {
  "code": "HITO 124",
  "title": "Mystical Traditions",
  "unit": "4",
  "description": "The course examines multiform mystical traditions in world religions and cultures, including Greco-Roman philosophy, Judaism, Christianity, Islam, Hinduism, and Buddhism by studying classics of mystical literature and secondary sources; also addressed are mystical beliefs and practices in contemporary society.",
  "prerequisite": null
 },
 {
  "code": "HITO 126",
  "title": "A History of Childhood",
  "unit": "4",
  "description": "This course will examine the different ways that attitudes toward children have changed throughout history. By focusing on the way that the child was understood, we will examine the changing role of the family, the role of culture in human development, and the impact of industrialization and modern institutions on the child and childhood.",
  "prerequisite": null
 },
 {
  "code": "HITO 133",
  "title": "War and Society: The Second World War",
  "unit": "4",
  "description": "An examination of the Second World War in Europe, Asia, and the United States. Focus will be on the domestic impact of the war on the belligerent countries as well as on the experiences of ordinary soldiers and civilians.",
  "prerequisite": null
 },
 {
  "code": "HITO 133D",
  "title": "War and Society: The Second World War",
  "unit": "4",
  "description": "An examination of the Second World War in Europe, Asia, and the United States. Focus will be on the domestic impact of the war on the belligerent countries as well as on the experiences of ordinary soldiers and civilians.",
  "prerequisite": null
 },
 {
  "code": "HITO 134",
  "title": "International Law—War Crimes and Genocide",
  "unit": "4",
  "description": "Comparative study of genocide and war crimes, stressing European developments since 1900 with reference to cases elsewhere. Topics include historical precedents; evolving legal concepts; and enforcement mechanisms. Emphasis on the Holocaust, the USSR under Stalin, ex-Yugoslavia, and the Armenian genocide. Students may not receive credit for both HITO 134 and ERC 102.",
  "prerequisite": null
 },
 {
  "code": "HITO 136",
  "title": "Jews and African Americans: Slavery, Diaspora, Ghetto",
  "unit": "4",
  "description": "Explore contrasts and parallels between African Americans and Jews from the seventeenth century to the present. Investigate slavery, the Civil War, shared music, political movements, urban geography, and longings to return to a homeland in Africa or Palestine.",
  "prerequisite": null
 },
 {
  "code": "HITO 140",
  "title": "History of Emotions",
  "unit": "4",
  "description": "An examination of the history of emotions from the early modern period to the present with a focus on Europe and North America. Analysis of different approaches to emotions as well as of specific emotions (love, honor, shame, fear, guilt).",
  "prerequisite": null
 },
 {
  "code": "HITO 155",
  "title": "Race, Sport, and Inequality in the Twentieth Century",
  "unit": "4",
  "description": "This course tracks the worldwide interplay of sport and race. We begin with patterns of exclusion and participation on the part of African Americans, Latinos, and Native Americans. We then examine patterns of inequality across the globe.",
  "prerequisite": null
 },
 {
  "code": "HITO 160GS",
  "title": "Globalization and Diaspora",
  "unit": "4",
  "description": "A course on Hong Kong’s political, economic, and cultural transformation alongside its incorporation into the global capitalist economy, with a focus on transnational migrants laboring and living in diaspora. Topics include Opium Wars, world system, export-processing zones, and anti-globalization movements. Students must submit applications to the International Center, Programs Abroad Office, and be accepted into the Global Seminar Program. Program or materials fees may apply.",
  "prerequisite": null
 },
 {
  "code": "HITO 164",
  "title": "Jews and Other Ethnics in the American Past",
  "unit": "4",
  "description": "In this course we compare the Jewish experience to other religious minorities in American history. Topics include motives and rates of immigration, education and work patterns, religious experiences, women's roles, family life, and representations in popular and high culture.",
  "prerequisite": null
 },
 {
  "code": "HITO 264",
  "title": "Jews and Other Ethnics in the American Past",
  "unit": "4",
  "description": "In this course we compare the Jewish experience to other religious minorities in American history. Topics include motives and rates of immigration, education and work patterns, religious experiences, women's roles, family life, and representations in popular and high culture.",
  "prerequisite": null
 },
 {
  "code": "HITO 165",
  "title": "Topics—LGBT History",
  "unit": "4",
  "description": "Topics will examine lesbian, gay, bisexual, transgender, and queer identities, communities, culture, and politics. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequisite": "upper-division standing and department stamp."
 },
 {
  "code": "HITO 265",
  "title": "Topics—LGBT History",
  "unit": "4",
  "description": "Topics will examine lesbian, gay, bisexual, transgender, and queer identities, communities, culture, and politics. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequisite": "upper-division standing and department stamp."
 },
 {
  "code": "HITO 166",
  "title": "Death Penalty Global Perspectives since 1492",
  "unit": "4",
  "description": "From early modern witches, rebels, and heretics to hypermodern gangsters, terrorists, and serial killers, applying capital punishment to foreign nationals and ethnic minorities has sustained a global conversation about the sanctity of human life and the meaning of citizenship in the Americas and Europe. Graduate students must complete an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 266",
  "title": "Death Penalty Global Perspectives since 1492",
  "unit": "4",
  "description": "From early modern witches, rebels, and heretics to hypermodern gangsters, terrorists, and serial killers, applying capital punishment to foreign nationals and ethnic minorities has sustained a global conversation about the sanctity of human life and the meaning of citizenship in the Americas and Europe. Graduate students must complete an additional paper.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 167",
  "title": "Global History of Sports in the Cold War",
  "unit": "4",
  "description": "This course will examine what has been called the Cultural Cold Wars. Sports were the most visible form of popular culture during the era (1945-91). It will make use of reports and essays produced for an international, multiyear research project. It will combine written and visual sources. Matters of class, race, gender, and nationality will be discussed. May be coscheduled with HITO 267.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 267",
  "title": "Global History of Sports in the Cold War",
  "unit": "4",
  "description": "This course will examine what has been called the Cultural Cold Wars. Sports were the most visible form of popular culture during the era (1945-91). It will make use of reports and essays produced for an international, multiyear research project. It will combine written and visual sources. Matters of class, race, gender, and nationality will be discussed. May be coscheduled with HITO 267.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 172",
  "title": "War in the Twentieth Century: A Psychological Approach",
  "unit": "4",
  "description": "Reckoning by novelists, essayists, and biographers with the phenomenon of contemporary warfare as an unprecedented experience and an abiding threat. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 272",
  "title": "War in the Twentieth Century: A Psychological Approach",
  "unit": "4",
  "description": "Reckoning by novelists, essayists, and biographers with the phenomenon of contemporary warfare as an unprecedented experience and an abiding threat. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HITO 178",
  "title": "A History of Seafaring in the Age of Sail",
  "unit": "4",
  "description": "Taught in conjunction with the San Diego Maritime Museum, this course investigates life at sea from the age of discovery to the advent of the steamship. We will investigate discovery, technology, piracy, fisheries, commerce, naval conflict, sea-board life, and seaport activity.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HITO 278",
  "title": "A History of Seafaring in the Age of Sail",
  "unit": "4",
  "description": "Taught in conjunction with the San Diego Maritime Museum, this course investigates life at sea from the age of discovery to the advent of the steamship. We will investigate discovery, technology, piracy, fisheries, commerce, naval conflict, sea-board life, and seaport activity.",
  "prerequisite": "upper-division or graduate standing and department stamp. +"
 },
 {
  "code": "HITO 180",
  "title": "Housing in the Developing World",
  "unit": "4",
  "description": "The majority of the world's citizens now live in cities; this course examines the evolution of housing architecture and finance in the twentieth-century context of rapid urbanization, dissolving empire, industrialization, and globalization. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper- division or graduate standing and consent of instructor."
 },
 {
  "code": "HITO 280",
  "title": "Housing in the Developing World",
  "unit": "4",
  "description": "The majority of the world's citizens now live in cities; this course examines the evolution of housing architecture and finance in the twentieth-century context of rapid urbanization, dissolving empire, industrialization, and globalization. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper- division or graduate standing and consent of instructor."
 },
 {
  "code": "HITO 192",
  "title": "Senior Seminar in History",
  "unit": "1",
  "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in history (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequisite": "department stamp and/or consent of instructor."
 },
 {
  "code": "HITO 193",
  "title": "Research Seminar in Washington, DC",
  "unit": "6",
  "description": "Course attached to six-unit internship taken by student participating in the UCDC program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial historical research paper.",
  "prerequisite": "department stamp required; participating in UCDC program."
 },
 {
  "code": "COM GEN 194",
  "title": "Research Seminar in Washington, DC",
  "unit": "6",
  "description": "Course attached to six-unit internship taken by student participating in the UCDC program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial historical research paper.",
  "prerequisite": "department stamp required; participating in UCDC program."
 },
 {
  "code": "HITO 194",
  "title": "History Honors",
  "unit": "4",
  "description": "A program of independent study providing candidates for history honors an opportunity to develop, in consultation with an adviser, a preliminary proposal for the honors essay. An IP grade will be awarded at the end of this quarter. A final grade will be given for both quarters at the end of HITO 195.",
  "prerequisite": "consent of instructor. Department stamp required."
 },
 {
  "code": "HITO 195",
  "title": "The Honors Essay",
  "unit": "4",
  "description": "Independent study under the supervision of a faculty member leading to the preparation of an honors essay. A letter grade for both HITO 194 and 195 will be given at the completion of this quarter.",
  "prerequisite": "consent of instructor. Department stamp required."
 },
 {
  "code": "HITO 196",
  "title": "Honors Seminar",
  "unit": "4",
  "description": "The nature and uses of history are explored through the study of the historian's craft based on critical analysis of historical literature relating to selected topics of concern to all historians. Required of all candidates for history honors and open to other interested students with the instructor's consent. Department stamp required.",
  "prerequisite": null
 },
 {
  "code": "HITO 198",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. (P/NP grades only.)",
  "prerequisite": "upper-division standing, completion of at least ninety units of UC San Diego undergraduate study, a minimum G.P.A. of 2.5, and a completed and approved Special Studies form."
 },
 {
  "code": "HITO 199",
  "title": "Independent Study in Historical Topics",
  "unit": "4",
  "description": "Independent study on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members. (P/NP grades only.)",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HITO 274",
  "title": "The Foundations of Constitutional Law",
  "unit": "4",
  "description": "Medieval and early modern origins of constitutional ideas and institutions. The question of the course is: Where did the ideas and institutions embodied in the constitutions of the U.S. (1787) and of France (1791) come from? Requirements will vary for undergraduate, MA, and PhD students. Graduate students are required to submit a more substantial piece of work.",
  "prerequisite": null
 },
 {
  "code": "HIUS 103",
  "title": "The United States and the Pacific World",
  "unit": "4",
  "description": "History of the United States in the Pacific, with an emphasis on Hawai'i, Guam, the Mariana Islands, and the Marshall Islands, from the nineteenth century to the present. Topics include colonialism and imperialism, cultural representations, indigenous knowledge and sovereignty, militarism, tourism, and environmentalism. Students will not receive credit for both HIUS 103 and ETHN 103A.",
  "prerequisite": null
 },
 {
  "code": "HIUS 104",
  "title": "The Revolutionary Atlantic",
  "unit": "4",
  "description": "The upheavals that transformed the early modern Atlantic emphasizing the United States, Caribbean, and Great Britain. Topics: struggles to define democracy, the reorganization of the Atlantic state system, the Enlightenment, and international responses to the American and French Revolutions. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 106A",
  "title": "American Foreign Relations, to 1900",
  "unit": "4",
  "description": "Course examines range of public and private interactions between the United States and the world, from the founding of the republic to the Spanish- American War. Topics include origins of federal foreign policy making power, territorial and commercial and ideological expansionism.",
  "prerequisite": null
 },
 {
  "code": "HIUS 106B",
  "title": "American Foreign Relations, since 1900",
  "unit": "4",
  "description": "Examines foreign relations of the United States from acquisition of a formal overseas empire in the aftermath of the Spanish-American War to the end of the Cold War. Topics cover a range of public and private interactions with the world.",
  "prerequisite": null
 },
 {
  "code": "HIUS 106S",
  "title": "Apocalyptic Judaism",
  "unit": "4",
  "description": "Examine the development of apocalyptic Jewish movements in the Second Temple period and the influence these movements had on Rabbinic Judaism and early Christianity.",
  "prerequisite": null
 },
 {
  "code": "HIUS 108A",
  "title": "History of Native Americans in the United States I",
  "unit": "4",
  "description": "This course examines the history of the Native Americans in the United States with emphasis on the lifeways, mores, warfare, cultural adaptation, and relations with the European colonial powers and the emerging United States until 1870. +",
  "prerequisite": null
 },
 {
  "code": "HIUS 108B",
  "title": "History of Native Americans in the United States II",
  "unit": "4",
  "description": "This course examines the history of the Native Americans in the United States with emphasis on the lifeways, mores, warfare, cultural adaptation, and relations with the United States from 1870 to the present.",
  "prerequisite": null
 },
 {
  "code": "HIUS 110",
  "title": "America and the World: Revolution to World War I",
  "unit": "4",
  "description": "A lecture course that explores the evolution of the interaction between the United States and the world from the American Revolution to the First World War, with particular emphasis upon the role of diplomacy, war, and economic change.",
  "prerequisite": null
 },
 {
  "code": "HIUS 111",
  "title": "America and the World: World War I to the Present",
  "unit": "4",
  "description": "A lecture course that explores the evolution of the interaction between the United States and the world from 1914 to the present, with special attention to the era of the Great Depression, the Cold War, Vietnam, and the post 9/11 war on terror.",
  "prerequisite": null
 },
 {
  "code": "HIUS 112",
  "title": "The US Civil War",
  "unit": "4",
  "description": "The course addresses the causes, course, and consequences of the US Civil War. We will explore such themes as how Unionists and Confederates mobilized their populations and dealt with dissension, the war's effects on gender and race relations, and the transformation of the federal government.",
  "prerequisite": null
 },
 {
  "code": "HIUS 113",
  "title": "History of Mexican America",
  "unit": "4",
  "description": "This course explores the history of the largest minority population in the United States, focusing on the legacies of the Mexican War, the history of Mexican immigration and US-Mexican relations, and the struggle for citizenship and civil rights.",
  "prerequisite": null
 },
 {
  "code": "HIUS 114A",
  "title": "California History 1542-1850",
  "unit": "4",
  "description": "This course surveys the history of California from the period just before Spanish contact in 1542 through California’s admission to the Union in 1850. +",
  "prerequisite": null
 },
 {
  "code": "HIUS 114B",
  "title": "California History, 1850-Present",
  "unit": "4",
  "description": "This course surveys the history of California from 1850 to the present.",
  "prerequisite": null
 },
 {
  "code": "HIUS 115",
  "title": "History of Sexuality in the United States",
  "unit": "4",
  "description": "Constructions of sex and sexuality in the United States from the time of precontact Native America to the present, focusing on sexual behaviors, sexual ideologies, and the uses of sexuality for social control.",
  "prerequisite": null
 },
 {
  "code": "HIUS 117",
  "title": "History of Los Angeles",
  "unit": "4",
  "description": "This course examines the history of Los Angeles from the early nineteenth century to the present. Particular issues to be addressed include urbanization, ethnicity, politics, technological change, and cultural diversification.",
  "prerequisite": null
 },
 {
  "code": "HIUS 118",
  "title": "How Jews Became American",
  "unit": "4",
  "description": "This course explores the history of Jews in America from the colonial period to the present, focusing on both the development of Jewish communities primarily as a result of immigration and evolving relations between Jews and the larger American society.",
  "prerequisite": null
 },
 {
  "code": "HIUS 120",
  "title": "Peace Movements in America",
  "unit": "4",
  "description": "Topics will include Quaker origins of the American peace movements and examples of opposition to wars in the twentieth century from World Wars I and II, Vietnam, antinuclear movements, and intervention in Central America to Iraq.",
  "prerequisite": null
 },
 {
  "code": "HIUS 120D",
  "title": "Race and Oral History in San Diego",
  "unit": "4",
  "description": "(Cross-listed with ETHN 120D.) This course examines the history of racial and ethnic communities in San Diego. Drawing from historical research and interdisciplinary scholarship, we will explore how race impacted the history and development of San Diego and how “ordinary” folk made sense of their racial identity and experiences. Toward these ends, students will conduct oral history and community-based research, develop public and digital humanities skills, and preserve a collection of oral histories for future scholarship. Concurrent enrollment in an Academic Internship Program course strongly recommended. Students may not receive credit for HIUS 120D and ETHN 120D.",
  "prerequisite": null
 },
 {
  "code": "HIUS 123",
  "title": "History of New York City",
  "unit": "4",
  "description": "New York City breathes history. Whether it is in the music, the literature, or the architecture, the city informs our most basic conceptions of American identity. This course examines the evolution of Gotham from the colonial era to today.",
  "prerequisite": null
 },
 {
  "code": "HIUS 124",
  "title": "Asian American History",
  "unit": "4",
  "description": "Explore how Asian Americans were involved in the political, economic, and cultural formation of United States society. Topics include migration; labor systems; gender, sexuality and social organization; racial ideologies and anti-Asian movements; and nationalism and debates over citizenship.",
  "prerequisite": null
 },
 {
  "code": "HIUS 125",
  "title": "Asian American Social Movements",
  "unit": "4",
  "description": "History of Asian American activism from the late-nineteenth century to the present, with an emphasis on interethnic, interracial, and transnational solidarity practices. Topics include struggles for civil rights and labor rights; immigration reform; antiwar and anticolonial movements; hate crimes; and police brutality. Students may receive credit for one of the following: HIUS 125, HIUS 125GS, or ETHN 163J.",
  "prerequisite": null
 },
 {
  "code": "HIUS 125GS",
  "title": "Asian American Social Movements",
  "unit": "4",
  "description": "History of Asian American activism from the late-nineteenth century to the present, with an emphasis on interethnic, interracial, and transnational solidarity practices. Topics include struggles for civil rights and labor rights; immigration reform; antiwar and anticolonial movements; hate crimes; and police brutality. Students must apply and be accepted into the Global Seminars Program. Students may receive credit for one of the following: HIUS 125GS, HIUS 125, or ETHN 163J.",
  "prerequisite": null
 },
 {
  "code": "HIUS 126",
  "title": "The History of Race in the United States",
  "unit": "4",
  "description": "Examines key periods, events, and processes throughout the twentieth century that shaped the way Americans thought about race. Also examines the historical development of the category of race and racism, as well as how it is lived in everyday life.",
  "prerequisite": null
 },
 {
  "code": "HIUS 128",
  "title": "African American Legal History",
  "unit": "4",
  "description": "This course sketches the shifting experience persons of African descent have had with the law in the United States. Films, cases, articles, and book excerpts are used to convey the complex nature of this four-hundred-year journey.",
  "prerequisite": null
 },
 {
  "code": "HIUS 129",
  "title": "The History of Race and Ethnicity in American Cities",
  "unit": "4",
  "description": "This class examines the history of racial and ethnic groups in American cities. It looks at major forces of change such as immigration to cities, political empowerment, and social movements, as well as urban policies such as housing segregation.",
  "prerequisite": null
 },
 {
  "code": "HIUS 130",
  "title": "Cultural History from 1607 to 1865",
  "unit": "4",
  "description": "This course will explore connections between American culture and the transformations of class relations, gender ideology, and political thought. Topics will include the transformations of religious perspectives and practices, republican art and architecture, artisan and working-class culture, the changing place of art and artists in American society, antebellum reform movements, antislavery and proslavery thought. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 131",
  "title": "Cultural History from 1865 to 1917",
  "unit": "4",
  "description": "This course will focus on the transformation of work and leisure and the development of consumer culture. Students consider connections among culture, class, racial and gender ideologies, and politics. Topics include labor management and radicalism, organized sports, museums, commercial entertainment, world fairs, reactionary movements, and imperialism.",
  "prerequisite": null
 },
 {
  "code": "HIUS 131D",
  "title": "Cultural History from the Civil War to the Present",
  "unit": "4",
  "description": "This course will focus on the transformation of work and leisure and development of consumer culture. Students will consider connections between culture, class relations, gender ideology, and politics. Topics will include labor radicalism, Taylorism, the development of organized sports, the rise of department stores, and the transformation of middle-class sexual culture of the Cold War.",
  "prerequisite": null
 },
 {
  "code": "HIUS 132S",
  "title": "The Civil War and Reconstruction in Popular Culture",
  "unit": "4",
  "description": "This course considers how cultural processes have shaped histories of the Civil War and Reconstruction. Students will analyze the relationship between popular culture and major themes of the era through the use of literature, texts, film, television, and print images. Students who took HIUS 132 cannot repeat this course.",
  "prerequisite": null
 },
 {
  "code": "HIUS 133",
  "title": "The Golden Age of Piracy",
  "unit": "4",
  "description": "This interdisciplinary lecture course focuses on the history and literature of global piracy in the English-speaking world from Sir Francis Drake to Blackbeard and how this Golden Age was remembered in the popular fiction of the nineteenth and twentieth centuries. Students may not receive credit for HIUS 133 and HIUS 133GS. +",
  "prerequisite": null
 },
 {
  "code": "HIUS 133GS",
  "title": "The Golden Age of Piracy",
  "unit": "4",
  "description": "This interdisciplinary lecture course focuses on the history and literature of global piracy in the English-speaking world from Sir Francis Drake to Blackbeard and how this Golden Age was remembered in the popular fiction of the nineteenth and twentieth centuries. Program or materials fees may apply. Students must apply and be accepted into the Global Seminars Program. Students may not receive credit for HIUS 133 and HIUS 133GS.",
  "prerequisite": null
 },
 {
  "code": "HIUS 135",
  "title": "The Atlantic World, 1492-1803",
  "unit": "4",
  "description": "This course focuses on the role the Atlantic played in bringing together in both volatile and beneficial ways the remarkably different cultures of four continents from the Columbian Exchange to the Haitian Revolution. Students may not receive credit for HIUS 135 and 135A or 135B. +",
  "prerequisite": null
 },
 {
  "code": "HIUS 136",
  "title": "Citizenship and Civil Rights in the Twentieth Century",
  "unit": "4",
  "description": "This course traces the history of the institution of US citizenship in the last century, tracing changing notions of racial, cultural, and gender differences, the evolution of the civil rights struggle, and changes in laws governing citizenship and access to rights.",
  "prerequisite": null
 },
 {
  "code": "HIUS 137",
  "title": "Mining and American History",
  "unit": "4",
  "description": "This course examines the critical role mining played in the economic, political, and social history of the United States since the late 1800s. Topics discussed in the course will include labor movements, engineering, science and industry, foreign policy, and natural resource dependence.",
  "prerequisite": null
 },
 {
  "code": "HIUS 139",
  "title": "African American History in the Twentieth Century",
  "unit": "4",
  "description": "This course examines the transformation of African America across the expanse of the long twentieth century: imperialism, migration, urbanization, desegregation, and deindustrialization. Special emphasis will be placed on issues of culture, international relations, and urban politics.",
  "prerequisite": null
 },
 {
  "code": "HIUS 140",
  "title": "Economic History of the United States I",
  "unit": "4",
  "description": "The United States as a raw materials producer, as an agrarian society, and as an industrial nation. Emphasis on the logic of the growth process, the social and political tensions accompanying expansion, and nineteenth- and early twentieth-century transformations of American capitalism.",
  "prerequisite": null
 },
 {
  "code": "HIUS 141",
  "title": "Economic History of the United States II",
  "unit": "4",
  "description": "The United States as modern industrial nation. Emphasis on the logic of the growth process, the social and political tensions accompanying expansion, and twentieth-century transformations of American capitalism.",
  "prerequisite": null
 },
 {
  "code": "HIUS 142A",
  "title": "United States in the Twentieth Century, 1900-1945",
  "unit": "4",
  "description": "Examines the political, economic, and social history of the American people from the turn of the twentieth century to the end of World War II. Topics: progressive movement, impact of the Great Depression, and the consequences of two world wars.",
  "prerequisite": null
 },
 {
  "code": "HIUS 142B",
  "title": "United States in the Twentieth Century, 1945 to the Present",
  "unit": "4",
  "description": "Examines the political, economic and social history of the American people from the end of World War II to present. Topics: origins of the Cold War, struggle for racial justice and the rise of American conservatism since the 1980s.",
  "prerequisite": null
 },
 {
  "code": "HIUS 143",
  "title": "The Built Environment in the Twentieth Century",
  "unit": "4",
  "description": "An examination of urban and regional planning as well as piecemeal change in the built environment. Topics include urban and suburban housing, work environments, public spaces, transportation and utility infrastructures, utopianism.",
  "prerequisite": null
 },
 {
  "code": "HIUS 143GS",
  "title": "The Built Environment in the Twentieth Century",
  "unit": "4",
  "description": "An examination of urban and regional planning as well as piecemeal change in the built environment. Topics include urban and suburban housing, work environments, public spaces, transportation and utility infrastructures, and utopianism. Program or materials fees may apply. Students must apply and be accepted into the Global Seminars Program. Students may not receive credit for HIUS 143 and HIUS 143GS.",
  "prerequisite": null
 },
 {
  "code": "HIUS 144",
  "title": "Topics in US History",
  "unit": "4",
  "description": "Selected topics in US history. Course may be taken for credit up to three times as topics vary.",
  "prerequisite": null
 },
 {
  "code": "HIUS 145",
  "title": "From New Era to New Deal",
  "unit": "4",
  "description": "This course will examine the economic, social, and political changes underway in the United States from 1917 to 1945. Topics will include the 1920s, the Great Depression, the New Deal and the consequences of two World Wars.",
  "prerequisite": null
 },
 {
  "code": "HIUS 146",
  "title": "Race, Riots, and Violence in the U.S.",
  "unit": "4",
  "description": "Examining the history of urban riots in the United States since the late nineteenth century. Exploring how different groups of Americans have constructed competing notions of race, gender, labor, and national belonging by participating in street violence.",
  "prerequisite": null
 },
 {
  "code": "HIUS 148",
  "title": "The American City in the Twentieth Century",
  "unit": "4",
  "description": "This course focuses on the phenomenon of modern American urbanization. Case studies of individual cities will help illustrate the social, political, and environmental consequences of rapid urban expansion, as well as the ways in which urban problems have been dealt with historically.",
  "prerequisite": null
 },
 {
  "code": "USP 103",
  "title": "The American City in the Twentieth Century",
  "unit": "4",
  "description": "This course focuses on the phenomenon of modern American urbanization. Case studies of individual cities will help illustrate the social, political, and environmental consequences of rapid urban expansion, as well as the ways in which urban problems have been dealt with historically.",
  "prerequisite": null
 },
 {
  "code": "HIUS 149",
  "title": "The United States in the 1960s",
  "unit": "4",
  "description": "An overview of the social and political developments that polarized American society in the tumultuous decade of the 1960s. Themes include the social impact of the postwar baby boom, the domestic and foreign policy implications of the Cold War; the evolution of the civil rights and women’s movements; and the transformation of American popular culture.",
  "prerequisite": null
 },
 {
  "code": "HIUS 150",
  "title": "American Legal History to 1865",
  "unit": "4",
  "description": "The history of American law and legal institutions. This quarter focuses on crime and punishment in the colonial era, the emergence of theories of popular sovereignty, the forging of the Constitution and American federalism, the relationship between law and economic change, and the crisis of slavery and Union. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 151",
  "title": "American Legal History since 1865",
  "unit": "4",
  "description": "The history of American law and legal institutions. This course examines race relations and law, the rise of big business, the origins of the modern welfare state during the Great Depression, the crisis of civil liberties produced by two world wars and McCarthyism, and the Constitutional revolution wrought by the Warren Court. HIUS 150 is not a prerequisite for HIUS 151.",
  "prerequisite": null
 },
 {
  "code": "HIUS 152A",
  "title": "A Constitutional History of the United States to 1865",
  "unit": "4",
  "description": "The historical development of constitutional thought and practice in the United States from the era of the American Revolution through the Civil War, with special attention to the role of the Supreme Court under Chief Justices Marshall and Taney.",
  "prerequisite": null
 },
 {
  "code": "HIUS 152B",
  "title": "A Constitutional History of the United States since 1865",
  "unit": "4",
  "description": "The historical development of constitutional thought and practice in the United States since 1865, with special attention to the role of the Supreme Court from Chief Justices Chase to Rehnquist. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 153",
  "title": "American Political Trials",
  "unit": "4",
  "description": "Survey of politicized criminal trials and impeachments from Colonial times to the 1880s. Examines politically motivated prosecutions and trials that became subjects of political controversy, were exploited by defendants for political purposes, or had their outcomes determined by political considerations. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 155B",
  "title": "Religion and Law in American History: Civil War to the Present",
  "unit": "4",
  "description": "Selected problems in the history of the relationship between religious beliefs and practice and legal institutions in America from the Civil War to the present. Topics include the religion and government aid; sacred duties and the law; and religion and cultural politics.",
  "prerequisite": null
 },
 {
  "code": "HIUS 156",
  "title": "American Women, American Womanhood",
  "unit": "4",
  "description": "This course explores the emergence of a dominant ideology of womanhood in America in the early nineteenth century and contrasts the ideal with the historically diverse experience of women of different races and classes, from settlement to 1870. Topics include witchcraft, evangelicalism, cult of domesticity, sexuality, rise of industrial capitalism and the transformation of women’s work, the Civil War, and the first feminist movement. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 156D",
  "title": "American Women, American Womanhood",
  "unit": "4",
  "description": "This course explores the emergence of a dominant ideology of womanhood in America in the early nineteenth century and contrasts the ideal with the historically diverse experience of women of different races and classes, from settlement to 1870. Topics include witchcraft, evangelicalism, cult of domesticity, sexuality, rise of industrial capitalism and the transformation of women’s work, the Civil War, and the first feminist movement.",
  "prerequisite": null
 },
 {
  "code": "HIUS 157",
  "title": "American Women, American Womanhood 1870 to Present",
  "unit": "4",
  "description": "This course explores the making of the ideology of womanhood in modern America and the diversity of American women's experience from 1870 to the present. Topics include the suffrage movement, the struggle for reproductive rights and the ERA; immigrant and working-class women, women's work, and labor organization; education, the modern feminist movement and the contemporary politics of reproduction, including abortion and surrogate motherhood.",
  "prerequisite": null
 },
 {
  "code": "HIUS 158",
  "title": "Social and Economic History of the Southwest I",
  "unit": "4",
  "description": "This course examines the history of the Spanish and Mexican borderlands (what became the US Southwest) from roughly 1400 to the end of the U.S.-Mexico War in 1848, focusing specifically on the area's social, cultural, and political development. \\+",
  "prerequisite": null
 },
 {
  "code": "HIUS 159",
  "title": "Social and Economic History of the Southwest II",
  "unit": "4",
  "description": "Cross-listed as Ethnic Studies 131. This course examines the history of the American Southwest from the U.S.-Mexican War in 1846-48 to the present, focusing on immigration, racial and ethnic conflict, and the growth of Chicano national identity.",
  "prerequisite": null
 },
 {
  "code": "HIUS 160",
  "title": "Colloquium on the American Empire",
  "unit": "4",
  "description": "Course explores the concept of an American Empire by examination of the literature on the topic. Particular attention will be on the work since 9/11/01. Students are expected to produce original work concerning the definition and/or existence of an American Empire. Graduate students are expected to submit an additional piece of work.",
  "prerequisite": "upper- division standing or consent of instructor. Department stamp required."
 },
 {
  "code": "HIUS 260",
  "title": "Colloquium on the American Empire",
  "unit": "4",
  "description": "Course explores the concept of an American Empire by examination of the literature on the topic. Particular attention will be on the work since 9/11/01. Students are expected to produce original work concerning the definition and/or existence of an American Empire. Graduate students are expected to submit an additional piece of work.",
  "prerequisite": "upper- division standing or consent of instructor. Department stamp required."
 },
 {
  "code": "HIUS 162",
  "title": "The American West",
  "unit": "4",
  "description": "This seminar will trace major themes in the history of the American West. Topics will include ethnicity, the environment, urbanization, demographics, and shifting concepts surrounding the significance of the West. Graduate students will be required to submit additional work in order to receive graduate credit for the course.",
  "prerequisite": "department stamp required."
 },
 {
  "code": "HIUS 262",
  "title": "The American West",
  "unit": "4",
  "description": "This seminar will trace major themes in the history of the American West. Topics will include ethnicity, the environment, urbanization, demographics, and shifting concepts surrounding the significance of the West. Graduate students will be required to submit additional work in order to receive graduate credit for the course.",
  "prerequisite": "department stamp required."
 },
 {
  "code": "HIUS 167",
  "title": "Topics in Mexican American History",
  "unit": "4",
  "description": "This colloquium studies the racial representation of Mexican Americans in the United States from the nineteenth century to the present, examining critically the theories and methods of the humanities and social sciences.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "HIUS 267",
  "title": "Topics in Mexican American History",
  "unit": "4",
  "description": "This colloquium studies the racial representation of Mexican Americans in the United States from the nineteenth century to the present, examining critically the theories and methods of the humanities and social sciences.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "HIUS 168",
  "title": "Race, Resistance, and Cultural Politics",
  "unit": "4",
  "description": "The course investigates race, resistance, and culture in the United States since the late nineteenth century. It interrogates how working-class whites, African Americans, Latinos, Asian Americans, and others have simultaneously challenged, shaped, and assimilated into US society. May be coscheduled with HIUS 268.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 268",
  "title": "Race, Resistance, and Cultural Politics",
  "unit": "4",
  "description": "The course investigates race, resistance, and culture in the United States since the late nineteenth century. It interrogates how working-class whites, African Americans, Latinos, Asian Americans, and others have simultaneously challenged, shaped, and assimilated into US society. May be coscheduled with HIUS 268.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 169",
  "title": "Topics in American Legal and Constitutional History",
  "unit": "4",
  "description": "A reading and discussion course on topics that vary from year to year, including American federalism, the history of civil liberties, and the Supreme Court.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 269",
  "title": "Topics in American Legal and Constitutional History",
  "unit": "4",
  "description": "A reading and discussion course on topics that vary from year to year, including American federalism, the history of civil liberties, and the Supreme Court.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 174",
  "title": "Race Wars in American Culture",
  "unit": "4",
  "description": "This seminar examines race and war in US history, with an emphasis on their intersections and co-constitutions. Topics include frontier wars and \"manifest destiny;\" border enforcement, antiradicalism, the war on drugs, and mass incarceration; and the war on terror.",
  "prerequisite": "department approval required."
 },
 {
  "code": "HIUS 176",
  "title": "Race and Sexual Politics",
  "unit": "4",
  "description": "This seminar will explore the histories of sexual relations, politics, and cultures that both cross and define racial boundaries in the nineteenth and twentieth centuries. Reading will focus on the United States as well as take up studies sited in Canada and Latin America. Graduate students are expected to submit a more substantial piece of work.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 276",
  "title": "Race and Sexual Politics",
  "unit": "4",
  "description": "This seminar will explore the histories of sexual relations, politics, and cultures that both cross and define racial boundaries in the nineteenth and twentieth centuries. Reading will focus on the United States as well as take up studies sited in Canada and Latin America. Graduate students are expected to submit a more substantial piece of work.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 178",
  "title": "The Atlantic World, 1400-1800",
  "unit": "4",
  "description": "This course explains the origin of the Atlantic as a zone of interaction for Europeans, indigenous Americans, and Africans, and evaluates the consequences of the interaction over several centuries by exploring contests over political power and economic/demographic change. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 278 ",
  "title": "The Atlantic World, 1400-1800",
  "unit": "4",
  "description": "This course explains the origin of the Atlantic as a zone of interaction for Europeans, indigenous Americans, and Africans, and evaluates the consequences of the interaction over several centuries by exploring contests over political power and economic/demographic change. Graduate students will submit a more substantial piece of work with in-depth analysis and with an increased number of sources cited. A typical undergraduate paper would be ten pages, whereas a typical graduate paper would require engagement with primary sources, more extensive reading of secondary material, and be about twenty pages.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 181",
  "title": "Topics in Twentieth Century United States History",
  "unit": "4",
  "description": "A colloquium dealing with special topics in US history from 1900 to the present. Themes will vary from year to year.",
  "prerequisite": "department stamp or consent of instructor."
 },
 {
  "code": "HIUS 281",
  "title": "Topics in Twentieth Century United States History",
  "unit": "4",
  "description": "A colloquium dealing with special topics in US history from 1900 to the present. Themes will vary from year to year.",
  "prerequisite": "department stamp or consent of instructor."
 },
 {
  "code": "HIUS 182",
  "title": "Special Topics in Intellectual History",
  "unit": "4",
  "description": "Cultural and political construction of the American nation. Topics include how citizenship and national community were imagined and contested; importance of class, gender, and race in the nation's public sphere; debates over slavery, expansion, and democracy in defining national purpose. Requirements will vary for undergraduates, MA, and PhD students. Graduate students are required to submit a more substantial paper.",
  "prerequisite": null
 },
 {
  "code": "HIUS 183",
  "title": "Topics in African American History",
  "unit": "4",
  "description": "A colloquium dealing with special topics in the history of people of African descent in the United States. Course may be taken for credit up to three times, as topics will vary from quarter to quarter.",
  "prerequisite": "department stamp or consent of instructor."
 },
 {
  "code": "HIUS 185",
  "title": "In the Public Interest",
  "unit": "4",
  "description": "In this seminar, we will examine the shifting boundary between what constitutes a public and a private concern in twentieth-century US history. We will consider issues such as civil rights, immigration, health care, and the regulation of financial institutions.",
  "prerequisite": "department stamp required for HIUS 185. Instructor approval required for HIUS 285."
 },
 {
  "code": "HIUS 285",
  "title": "In the Public Interest",
  "unit": "4",
  "description": "In this seminar, we will examine the shifting boundary between what constitutes a public and a private concern in twentieth-century US history. We will consider issues such as civil rights, immigration, health care, and the regulation of financial institutions.",
  "prerequisite": "department stamp required for HIUS 185. Instructor approval required for HIUS 285."
 },
 {
  "code": "HIUS 186",
  "title": "Topics in US Economic History",
  "unit": "4",
  "description": "Selected topics in US economic history. Course may be taken for credit a total of three times, as topics vary.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 188",
  "title": "Topics in Culture and Politics",
  "unit": "4",
  "description": "Colloquium on select topics in culture and politics in the United States. Topics will vary from quarter to quarter. Graduate students will be required to submit an additional piece of work.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 288",
  "title": "Topics in Culture and Politics",
  "unit": "4",
  "description": "Colloquium on select topics in culture and politics in the United States. Topics will vary from quarter to quarter. Graduate students will be required to submit an additional piece of work.",
  "prerequisite": "upper-division or graduate standing and department stamp."
 },
 {
  "code": "HIUS 198",
  "title": "Directed Group Study",
  "unit": "4",
  "description": "Directed group study on United States history under the supervision of a member of the faculty on a topic not generally included in the regular curriculum. Students must make arrangements with individual faculty members.",
  "prerequisite": null
 },
 {
  "code": "HIUS 199",
  "title": "Independent Study in United States History",
  "unit": "4",
  "description": "Directed readings for undergraduates under the supervision of various faculty members.",
  "prerequisite": "consent of instructor and department stamp required."
 },
 {
  "code": "HIUS 265",
  "title": "The Problem with Freedom",
  "unit": "4",
  "description": "This course examines the legal and cultural constructions of \"freedom\" in American history, with a focus on its inherent limitations and exclusions. We will examine how marginalized groups have engaged in political struggles in pursuit of more expansive notions of freedom.",
  "prerequisite": null
 },
 {
  "code": "HIUS 274",
  "title": "Race Wars in American Culture",
  "unit": "4",
  "description": "This seminar examines race and war in US history, with an emphasis on their intersections and co-constitutions. Topics include frontier wars and \"manifest destiny\"; border enforcement; antiradicalism; the war on drugs and mass incarceration; and the war on terror. May be coscheduled with HIUS 174.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIUS 286",
  "title": "Topics in US Economic History",
  "unit": "4",
  "description": "Selected topics in US economic history. Course may be taken for credit a total of three times, as topics vary.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "HIGR 200",
  "title": "History and Theory",
  "unit": "4",
  "description": "An introductory graduate course for students in all fields. Themes include cross-field historiography and theory, interdisciplinary approaches to history and historical method. (May be taken twice for credit, if the reading list is significantly different.)",
  "prerequisite": null
 },
 {
  "code": "HIGR 203",
  "title": "Madness and Society",
  "unit": "4",
  "description": "An examination of the place of madness in Western and non-Western cultures. Combining sociological and historical perspectives, this course will mostly focus on the period from the eighteenth through the twenty-first centuries. Students may not receive credit for HIGR 203 and SOCG 247.",
  "prerequisite": null
 },
 {
  "code": "HIGR 204",
  "title": "History of Capitalism",
  "unit": "4",
  "description": "This seminar will consider a number of classic works and contemporary scholarship that address the resurgent field of the history of capitalism. The course will examine the history of the political economy of the U.S. and its particular version of capitalism, but it will also consider the history and significance of capitalism's development in other nations.",
  "prerequisite": null
 },
 {
  "code": "HIGR 205",
  "title": "Historical Scholarship on Women and Gender",
  "unit": "4",
  "description": "An introduction to historical scholarship on women and gender, this cross- field course is designed for graduate students from all fields in history as well as from other related disciplines. The course will introduce major themes, debates, and theoretical approaches to women’s and gender history. The content of the course will change from year to year, but will include theoretical texts, historical case studies from different times and places, and primary sources. May be taken for credit two times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 206",
  "title": "Histories of the Body",
  "unit": "4",
  "description": "Historical topics related to the human body, as a target of regulation, a site for the production of knowledge, the locus of an identity shaped by race, gender, and sexuality, and/or in terms of movement across geopolitical boundaries.",
  "prerequisite": null
 },
 {
  "code": "HIGR 207",
  "title": "Nationalism, Colonialism, and Race",
  "unit": "4",
  "description": "A transdisciplinary and comparative course on the interplay of nationalism, colonialism, and race (as well as class and gender/sexuality) in the nineteenth and twentieth centuries.",
  "prerequisite": null
 },
 {
  "code": "HIGR 208",
  "title": "Graduate Professional Development",
  "unit": "4",
  "description": "Provides instruction in academic professionalization, including qualifying exams; prospectus/grant writing; conference presentations; publishing articles/books; job market; and tenure review. Weekly readings, writing assignments, discussion, and peer review develop skills necessary for success as graduate students and future faculty.",
  "prerequisite": null
 },
 {
  "code": "HIGR 209",
  "title": "Historical Pedagogy",
  "unit": "4",
  "description": "An introductory graduate course for students in all field groups. The seminar introduces students to useful skills, methods, and techniques for teaching history. May be taken for credit two times.",
  "prerequisite": "department approval required."
 },
 {
  "code": "HIGR 210",
  "title": "Historical Scholarship on Modern Chinese History",
  "unit": "4",
  "description": "This course will introduce students to the monographic literature and the main historiographic controversies of modern Chinese history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 211",
  "title": "Historical Scholarship on Modern Japanese History",
  "unit": "4",
  "description": "This course will introduce students to the monographic literature and the main historiographic controversies of modern Japanese history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 212",
  "title": "Historical Scholarship on Modern East Asian History",
  "unit": "4",
  "description": "This course will introduce students to the monographic literature and the main historiographic controversies of modern East Asian history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 214",
  "title": "Historical Scholarship on Modern Korean History",
  "unit": "4",
  "description": "This course will introduce students to the monographic literature and the main historiographic controversies of modern Korean history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 215A-B",
  "title": "Research Seminar in Modern Chinese History",
  "unit": "4-4",
  "description": "A two-quarter research seminar in Chinese history. A paper, based on original research, will be due in the second quarter. Seminar topics will vary. Reading knowledge of Chinese is expected. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": "215A is a prerequisite for 215B."
 },
 {
  "code": "HIGR 216A-B",
  "title": "Research Seminar in Modern Japanese History",
  "unit": "4-4",
  "description": "A two-quarter research seminar in Japanese history. A paper, based on original research, will be due in the second quarter. Seminar topics will vary. Reading knowledge of Japanese is expected. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": "216A is a prerequisite for 216B."
 },
 {
  "code": "HIGR 217A",
  "title": "Historical Scholarship on Premodern Chinese History I",
  "unit": "4",
  "description": "Chinese history from ancient foundations through the Qing fall. Primary and secondary readings on key developments in state and society, the classics, and the three major religions, including new scholarship. Assignments are both analytical and teaching-oriented. Courses in the HIGR 217 A-B-C series may be taken out of sequence.",
  "prerequisite": null
 },
 {
  "code": "HIGR 217B",
  "title": "Historical Scholarship on Premodern Chinese History II",
  "unit": "4",
  "description": "Chinese history from ancient foundations through the Qing fall. Primary and secondary readings on key developments in state and society, the classics, and the three major religions, including new scholarship. Assignments are both analytical and teaching-oriented. Courses in the HIGR 217 A-B-C series may be taken out of sequence.",
  "prerequisite": null
 },
 {
  "code": "HIGR 217C",
  "title": "Historical Scholarship on Premodern Chinese History III",
  "unit": "4",
  "description": "Chinese history from ancient foundations through the Qing fall. Primary and secondary readings on key developments in state and society, the classics, and the three major religions, including new scholarship. Assignments are both analytical and teaching-oriented. Courses in the HIGR 217 A-B-C series may be taken out of sequence.",
  "prerequisite": null
 },
 {
  "code": "HIGR 218A",
  "title": "Graduate Seminar in Premodern Chinese History",
  "unit": "4",
  "description": "Course subject varies among periods before 1900. Course includes secondary scholarship studies for content, method, and structure; research methods and resources; and development of the research topic. May be taken for credit up to three times. Both HIGR 218A-B must be completed before a final grade can be assigned.",
  "prerequisite": null
 },
 {
  "code": "HIGR 218B",
  "title": "Graduate Seminar in Premodern Chinese History",
  "unit": "4",
  "description": "Course subject varies among periods before 1900. In this course, students will write an original research paper using primary sources. May be taken for credit up to three times. Both HIGR 218A-B must be completed before a final grade can be assigned.",
  "prerequisite": null
 },
 {
  "code": "HIGR 219A-B",
  "title": "Research Seminar in Modern Korean History",
  "unit": "4-4",
  "description": "A two-quarter research seminar in Korean history. A paper, based on original research, will be due in HIGR 219B. Seminar topics will vary.",
  "prerequisite": null
 },
 {
  "code": "HIGR 220",
  "title": "Historical Scholarship on European History, 1500-1715",
  "unit": "4",
  "description": "Introduction to the historiography on Renaissance, Reformation, and early modern Europe: an overview of methodologies with emphasis on sources and critical approaches. Required for all beginning European history graduate students.",
  "prerequisite": null
 },
 {
  "code": "HIGR 221",
  "title": "Historical Scholarship on European History, 1715-1850",
  "unit": "4",
  "description": "Selected topics in European history from the early modern to the modern era. Readings and discussions focus on issues of methodology and interpretation. Required for all beginning European history graduate students.",
  "prerequisite": null
 },
 {
  "code": "HIGR 222",
  "title": "Historical Scholarship on European History, since 1850",
  "unit": "4",
  "description": "Critical evaluation of selected topics in the period of modern Europe from the mid-nineteenth century to the present. Required for all beginning European history graduate students.",
  "prerequisite": null
 },
 {
  "code": "HIGR 223A-B",
  "title": "Research Seminar in Medieval History",
  "unit": "4-4",
  "description": "Research seminar in medieval history with selected topics in medieval history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 224",
  "title": "Readings in Twentieth-Century German History",
  "unit": "4",
  "description": "An introduction to the historiography and major debates in modern German history from the Wilhelmine period to the present. Readings and discussion focus on the critical evaluation of sources, methodologies, and shifting interpretations of Germany's volatile transition to modernity.",
  "prerequisite": null
 },
 {
  "code": "HIGR 225",
  "title": "Readings in Modern Russian History",
  "unit": "4",
  "description": "Students will read major works on revolutionary Russian and Soviet history. Attention will be paid to both classic and revisionist works.",
  "prerequisite": null
 },
 {
  "code": "HIGR 226",
  "title": "Readings in Modern Spanish History",
  "unit": "4",
  "description": "An introduction to the historiography and major debates in modern Spanish history, nineteenth and twentieth centuries. Readings and discussion of both English and Spanish language scholarship will explore different aspects of Spain's political, economic, social, and cultural transformation in the modern period.",
  "prerequisite": null
 },
 {
  "code": "HIGR 227A-B",
  "title": "Seminar in Spanish History",
  "unit": "4-4",
  "description": "Readings and critical analysis of selected topics and important works in the history of Spain. May be repeated as content changes. Proficiency in Spanish required to repeat course, but not for first time taken. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": null
 },
 {
  "code": "HIGR 228",
  "title": "Historical Scholarship on Greece and the Balkans, 1768-1923",
  "unit": "4",
  "description": "Critical evaluation of selected topics on Greece and the Balkans during the late Ottoman period (1768-1923). Attention will be paid to both classic and revisionist works. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 229",
  "title": "Historical Scholarship on Greece and the Balkans, 1923-2000",
  "unit": "4",
  "description": "Critical evaluation of selected topics on Greece and the Balkans during the twentieth century. Attention will be paid to both classic and revisionist works. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 230A-B",
  "title": "Research Seminar in European History",
  "unit": "4-4",
  "description": "A two-quarter research seminar in European history. A paper, based on original research, will be due in the second quarter. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter. May be taken for credit three times.",
  "prerequisite": "230A is a prerequisite for 230B."
 },
 {
  "code": "HIGR 234",
  "title": "Eastern Mediterranean Archaeology: New Perspectives",
  "unit": "4",
  "description": "This graduate seminar examines the archaeology of the eastern Mediterranean world from the Neolithic through Ottoman times. The seminar is thematically organized examining current methods and theories that apply to state-of-the- art research in one of the \"foundational\" culture-historical regions in the world. Topics may include archaeometry, archaeometallurgy, colonization, dating methods, settlement patterns and survey methodology, paleoclimate reconstruction, and geoarchaeology. Students may not receive credit for HIGR 234 and ANTH 207.",
  "prerequisite": null
 },
 {
  "code": "HIGR 236A-B",
  "title": "Research Seminar in History of Science",
  "unit": "4-4",
  "description": "A two-quarter research seminar comprising intensive study of a specific topic in the history of science. The first quarter will be devoted to readings and discussions; the second chiefly to the writing of individual research papers. Topics vary from year to year, and students may therefore repeat the course for credit. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": null
 },
 {
  "code": "HIGR 238",
  "title": "Introduction to Science Studies",
  "unit": "4",
  "description": "Cross-listed as Communication 225A, Philosophy 209A, and Sociology 255A. Study and discussion of classic work in history of science, sociology of science and philosophy of science, and of work that attempts to develop a unified science studies approach. Required for all students in the Science Studies Program.",
  "prerequisite": "enrollment in Science Studies Program."
 },
 {
  "code": "HIGR 239",
  "title": "Seminar in Science Studies",
  "unit": "4",
  "description": "Cross-listed as Communication 225B, Philosophy 209B, and Sociology 255B. Study and discussion of selected topics in the science studies field. Required for all students in the Science Studies Program. May be repeated as course content changes annually.",
  "prerequisite": "enrollment in Science Studies Program."
 },
 {
  "code": "HIGR 240",
  "title": "Colloquium in Science Studies",
  "unit": "4",
  "description": "Cross-listed as Communication 225C, Philosophy 209C, and Sociology 255C. A forum for the presentation and discussion of research in progress in science studies, by graduate students, faculty, and visitors. Required for all students in the Science Studies Program. May be repeated as course content changes annually.",
  "prerequisite": "enrollment in the Science Studies Program."
 },
 {
  "code": "HIGR 241",
  "title": "Advanced Approaches to Science Studies",
  "unit": "4",
  "description": "Cross-listed as COGR 225D, PHIL 209D, SOCG 255D. Focus on recent literature in the history, philosophy, and sociology of science, technology, and medicine. Required of all students in the Science Studies Program.",
  "prerequisite": "HIGR 238 is a prerequisite for HIGR 241; enrollment in Science Studies Program or instructor's permission."
 },
 {
  "code": "HIGR 244",
  "title": "Introduction to Sound Studies",
  "unit": "4",
  "description": "Study and discussion of classic and recent scholarship on sound production and cultures of listening. Emphasizes historical literature but also includes works in literary studies, art history, music, and other fields.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "HIGR 247A-B",
  "title": "Research Seminar in Colonial Latin America",
  "unit": "4-4",
  "description": "A two-quarter course involving readings and research on sixteenth- through eighteenth-century Latin America. Students are expected to compose a paper based on original research that is due in the second quarter. Reading knowledge of Spanish required. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": null
 },
 {
  "code": "HIGR 248A-B",
  "title": "Research Seminar in Latin America, National Period",
  "unit": "4-4",
  "description": "A two-quarter course involving readings and research; the first quarter is devoted to the nineteenth and the second quarter to the twentieth century. Students are expected to compose a paper based on original research that is due in the second quarter. An IP grade will be awarded at the end of the first quarter. Final grade will not be given until the end of the second quarter. Reading knowledge of Spanish and/or Portuguese is helpful but not required.",
  "prerequisite": null
 },
 {
  "code": "HIGR 249",
  "title": "Topics in Colonial Latin America",
  "unit": "4",
  "description": "One or two topics in colonial history will be analyzed in depth; reading knowledge of Spanish is expected.",
  "prerequisite": null
 },
 {
  "code": "HIGR 254",
  "title": "Historical Scholarship in Ancient History",
  "unit": "4",
  "description": "Introduction to the bibliography, methodology, and ancillary disciplines for the study of ancient history together with readings and discussion on selected topics within the field. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 255",
  "title": "Readings in Ancient Greek History",
  "unit": "4",
  "description": "An in-depth examination of selected topics in ancient Greek history. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 256",
  "title": "Readings in Ancient Roman History",
  "unit": "4",
  "description": "An in-depth examination of original readings written in the Roman period. Topics will vary. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 258",
  "title": "Historical Scholarship in Medieval History",
  "unit": "4",
  "description": "Introduction to the bibliography, methodology, and ancillary disciplines for the study of medieval history together with readings and discussion on selected topics within the field. May be taken for credit three times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 259",
  "title": "Special Topics in Ancient History",
  "unit": "4",
  "description": "Readings in modern scholarship concerning ancient Greek or Roman history. Topics will vary. May be taken for credit six times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 260A-B",
  "title": "Research Seminar in Ancient History",
  "unit": "4-4",
  "description": "Research seminar in ancient history. Selected topics in ancient Greek and Roman history. The second course in the IP sequence will be devoted to the presentation, discussion, and evaluation of the work in progress.",
  "prerequisite": null
 },
 {
  "code": "HIGR 264",
  "title": "Topics in Pre-Islamic Jewish History",
  "unit": "4",
  "description": "An in-depth examination of selected topics in the history of Jewish people and Jewish civilizations in pre-Islamic times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 265A-B-C",
  "title": "Historical Scholarship on American History",
  "unit": "4-4-4",
  "description": "A three-quarter sequence of readings and discussions on the bibliographical and monographic literature of American history from the colonial period to the present. Taught by different members of the staff each quarter, the course is required of all beginning graduate students in American history.",
  "prerequisite": null
 },
 {
  "code": "HIGR 267A-B",
  "title": "Research Seminar in United States History",
  "unit": "4-4",
  "description": "Readings and discussion in selected areas of American history for advanced graduate students. An IP (in progress) grade will be awarded the first quarter. The second quarter will be devoted to the presentation, discussion, and evaluation of work in progress. A final grade will be awarded at the end of the second quarter.",
  "prerequisite": "267A is a prerequisite for 267B."
 },
 {
  "code": "HIGR 274A",
  "title": "Historical Scholarship on the Early Modern Middle East",
  "unit": "4",
  "description": "Historiography of the late medieval and early modern Middle East, focusing specifically on the Ottoman Empire.",
  "prerequisite": "department approval required. Courses in the HIGR 274A-B-C series may be taken out of sequence."
 },
 {
  "code": "HIGR 275A-B",
  "title": "Research Seminar in Middle Eastern History",
  "unit": "4-4",
  "description": "A two-quarter research seminar in Middle Eastern history. Seminar topics will vary. Reading knowledge of Arabic or Turkish is expected. A paper, based on original research, will be due at the end of the second quarter. Final grade will not be given until the end of the second quarter.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "HIGR 280",
  "title": "Global History: Approaches to the Early Modern Era",
  "unit": "4",
  "description": "Introduction to methods, theories, and critiques of writing early modern global/world history. It seeks to familiarize students with the main historiographical debates and defining narratives about the first phase of intensifying global connectivity that commenced in the fifteenth century. May be taken for credit three times.",
  "prerequisite": "graduate standing and department stamp."
 },
 {
  "code": "HIGR 281",
  "title": "Global History: Approaches to the Modern Era",
  "unit": "4",
  "description": "Introduction to methods, theories, and critiques of writing global/world history in the modern era. Will survey how scholars of diverse disciplinary backgrounds have analyzed global change since the nineteenth century. It assesses the methodological and theoretical contributions of several analysts, the concepts through which they have explained and typified modes of interaction across global space, and the problems posed by studying connectivity. May be taken for credit three times.",
  "prerequisite": "graduate standing and department stamp."
 },
 {
  "code": "HIGR 282",
  "title": "Topics in Global History",
  "unit": "4",
  "description": "An in-depth survey of selected topics in global history. Topics will vary from year to year. May be taken for credit up to four times.",
  "prerequisite": null
 },
 {
  "code": "HIGR 295",
  "title": "Thesis Seminar",
  "unit": "4",
  "description": "For students advanced to candidacy to the doctorate. Discussion, criticism, and revision of drafts of chapters of theses and of work to be submitted for publication.",
  "prerequisite": null
 },
 {
  "code": "HIGR 298",
  "title": "Directed Reading",
  "unit": "1-12",
  "description": "Guided and supervised reading in the literature of the several fields of history. This course may be repeated for an indefinite number of times due to the independent nature of the content of the course. (S/U grades permitted.)",
  "prerequisite": null
 },
 {
  "code": "HIGR 299",
  "title": "PhD Thesis Direction",
  "unit": "1-12",
  "description": "Independent work by graduate students engaged in research and writing of doctoral theses. This course may be repeated for an indefinite number of times due to the independent nature of thesis writing and research. (S/U grades only.)",
  "prerequisite": null
 },
 {
  "code": "HIGR 500",
  "title": "Apprentice Teaching in History",
  "unit": "1-4",
  "description": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation and grading of examinations and other written exercises, and student relations. (S/U grades only.)",
  "prerequisite": null
 },
 {
  "code": "HIGR 502",
  "title": "Apprentice Teaching in Culture, Art, and Technology (CAT)",
  "unit": "4",
  "description": "Consideration and development of pedagogical methods appropriate to undergraduate teaching in the interdisciplinary Sixth College core sequence: Culture, Art, and Technology. Supervised by the core program faculty, director, and associate directors for the Writing and Thematic Programs.",
  "prerequisite": null
 },
 {
  "code": "HIGR 505",
  "title": "Apprentice Teaching in Jewish Studies",
  "unit": "4",
  "description": "Teaching assistant for lower-level Hebrew courses, JWSP 1, 2, 3. Must teach four or six sections and grade assignments.",
  "prerequisite": null
 }
]