[
 {
  "code": "HUM 1",
  "title": "The Foundations of Western Civilization: Israel and Greece",
  "unit": "6",
  "description": "Texts from the Hebrew Bible and from Greek epic, history, drama, and philosophy in their cultural context. Revelle students must take course for letter grade.",
  "prerequisite": "satisfaction of the UC Entry Level Writing requirement. (W)"
 },
 {
  "code": "HUM 2",
  "title": "Rome, Christianity, and the Middle Ages",
  "unit": "6",
  "description": "The Roman Empire, the Christian transformation of the classical world in late antiquity, and the rise of a European culture during the Middle Ages. Representative texts from Latin authors, early Christian literature, the Germanic tradition, and the high Middle Ages. Revelle students must take course for letter grade.",
  "prerequisite": "satisfaction of the UC Entry Level Writing requirement. (S)"
 },
 {
  "code": "HUM 3",
  "title": "Renaissance, Reformation, and Early Modern Europe",
  "unit": "4",
  "description": "The revival of classical culture and values and the reaction against medieval ideas concerning the place of human beings in the world. The Protestant Reformation and its intellectual and political consequences. The philosophical background to the scientific revolution. Revelle students must take the course for a letter grade. Students may not receive credit for HUM 3 and HUM 3GS.",
  "prerequisite": "completion of HUM 1 or HUM 2. (F)"
 },
 {
  "code": "HUM 4",
  "title": "Enlightenment, Romanticism, Revolution (1660-1848)",
  "unit": "4",
  "description": "The enlightenment's revisions of traditional thought; the rise of classical liberalism; the era of the first modern political revolutions; romantic ideas of nature and human life. Revelle students must take course for letter grade. Students may not receive credit for HUM 4 and HUM 4GS.",
  "prerequisite": "satisfaction of the UC Entry Level Writing requirement. (W)"
 },
 {
  "code": "HUM 5",
  "title": "Modern Culture (1848-present)",
  "unit": "4",
  "description": "Challenges to liberalism posed by such movements as socialism, imperialism, and nationalism; the growth of new forms of self-expression and new conceptions of individual psychology. Revelle students must take course for letter grade.",
  "prerequisite": "satisfaction of the UC Entry Level Writing requirement. (S)"
 },
 {
  "code": "HUM 119",
  "title": "Special Topics in Humanities",
  "unit": "4",
  "description": "An in-depth study of topics in the humanities. Subject matter varies, focusing on one author, intellectual topic, or specific historical tradition. May be repeated up to three times for credit when topics vary. (F)",
  "prerequisite": null
 },
 {
  "code": "HUM 195",
  "title": "Methods of Teaching Humanities",
  "unit": "4",
  "description": "An introduction to teaching humanities. Students are required to attend weekly discussions on methods of teaching humanities and will teach discussion sections of one of the humanities courses. Attendance at lecture of the course in which the student is participating is required. (P/NP grades only.)",
  "prerequisite": "consent of instructor. (W,S)"
 },
 {
  "code": "HUM 199",
  "title": "Special Studies",
  "unit": "2-4",
  "description": "Individually guided readings or projects in area of humanities not normally covered in standard curriculum.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "HUM 200",
  "title": "Seminar in the Humanities",
  "unit": "4",
  "description": "Selected topics in the history, literature, and thought of Mediterranean antiquity and its successor-cultures. Emphasis on identifying both common themes and cultural distinctiveness. Discussion of pedagogical approaches to this material. Required of all graduate instructional assistants in the humanities sequence.",
  "prerequisite": "graduate standing. (F)"
 }
]