[
 {
  "code": "LATI 50",
  "title": "Introduction to Latin America",
  "unit": "4",
  "description": "Interdisciplinary overview of society and culture in Latin America—including Mexico, the Caribbean, and South America: legacies of conquest, patterns of economic development, changing roles of women, expressions of popular culture, cycles of political change, and US-Latin American relations.",
  "prerequisite": null
 },
 {
  "code": "LATI 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "LATI 122A",
  "title": "Field Research Methods for Migration Studies: Seminar",
  "unit": "4",
  "description": "Introductory survey of methods used by social and health scientists to gather primary research data on international migrant and refugee populations, including sample surveys, unstructured interviewing, and ethnographic observation. Basic fieldwork practices, ethics, and problem-solving techniques will also be covered. Students may not receive credit for both SOCI 122A and LATI 122A. Recommended: advanced competency in conversational Spanish.",
  "prerequisite": "permission of instructor (department authorization required)."
 },
 {
  "code": "LATI 122B",
  "title": "Field Research Methods for Migration Studies: Practicum",
  "unit": "12",
  "description": "Students will collect survey and qualitative data among Mexican migrants to the United States and potential migrants, participate in team research, organize data collected for analysis, and submit a detailed outline of an article to be based on field data. Students may not receive credit for both SOCI 122B and LATI 122B. Recommended: advanced competency in conversational Spanish.",
  "prerequisite": "LATI 122A; permission of instructor (department authorization required)."
 },
 {
  "code": "LATI 122C",
  "title": "Field Research Methods for Migration Studies: Data Analysis",
  "unit": "4",
  "description": "Continuation of SOCI 122B. Students analyze primary data they have collected in field research sites and coauthor an article for publication. Methods for organizing and processing field data, techniques of quantitative data analysis, and report preparation conventions will be covered. Students may not receive credit for both SOCI 122C and LATI 122C.",
  "prerequisite": "LATI 122B; permission of instructor (department authorization required)."
 },
 {
  "code": "LATI 150",
  "title": "Digital Oral History in Latin America",
  "unit": "4",
  "description": "An introduction to the theory and practice of digital oral history in Latin America. Students will be exposed to the history of orality in the region as a hybrid genre between literature, history, and ethnography. This class will provide a strong theoretical background on oral history as a constant presence in the Latin American cultural scene from the colonial chronicles to the political testimony.",
  "prerequisite": "LATI 50; upper-division standing."
 },
 {
  "code": "LATI 180",
  "title": "Special Topics in Latin American Studies",
  "unit": "4",
  "description": "Readings and discussion of substantive issues and research in Latin American studies. Topics may include the study of a specific society or a particular issue in comparative cross-national perspective. Topics will vary from year to year.",
  "prerequisite": "LATI 50 or permission of instructor, upper-division standing."
 },
 {
  "code": "LATI 190",
  "title": "Senior Seminar",
  "unit": "4",
  "description": "Research seminar on selected topics in the study of Latin America; all students will be required to prepare and present independent research papers. (Honors students will present drafts of senior research theses, of no less than fifty pages in length; nonhonors students will present final versions of analytical papers of approximately twenty-five to forty pages in length.)",
  "prerequisite": "satisfactory completion of LATI 50 and a working knowledge of Spanish."
 },
 {
  "code": "LATI 191",
  "title": "Honors Seminar",
  "unit": "4",
  "description": "Independent reading and research under direction of a member of the faculty group in Latin American Studies; goal is to provide honors students with an opportunity to complete senior research thesis (to be defended before three- person interdisciplinary faculty committee).",
  "prerequisite": "successful completion of LATI 50, working knowledge of Spanish; minimum GPA of 3.5 in the major."
 },
 {
  "code": "LATI 199",
  "title": "Individual Study",
  "unit": "4",
  "description": "Guided and supervised reading of the literature on Latin America in the interdisciplinary areas of anthropology, communications, economics, history, literature, political science, and sociology. For students majoring in Latin American Studies, reading will focus around potential topics for senior papers; for honors students in Latin American Studies, reading will culminate in formulation of a prospectus for the research thesis.",
  "prerequisite": "LATI 50 and working knowledge of Spanish."
 },
 {
  "code": "LATI 222A",
  "title": "Field Research Methods for Migration Studies: Seminar",
  "unit": "4",
  "description": "Survey of methods used by social and health scientists to gather primary data on international migrant and refugee populations, including sample surveys, unstructured interviewing, and ethnographic observation. Students serve as team leaders, design questionnaires, and conduct literature reviews.",
  "prerequisite": "permission of instructor, advanced competence in conversational Spanish (department authorization required)."
 },
 {
  "code": "LATI 222B",
  "title": "Field Research Methods for Migration Studies: Practicum",
  "unit": "12",
  "description": "Students collect survey and qualitative data in Mexican migrants’ communities of origin and destination, serve as team leaders, organize field data collection within specific subpopulations, and prepare a detailed outline of a proposed journal article to be based on field data.",
  "prerequisite": "LATI 222A, permission of instructor, advanced competence in conversational Spanish (department authorization required)."
 },
 {
  "code": "LATI 222C",
  "title": "Field Research Methods for Migration Studies: Data Analysis",
  "unit": "4",
  "description": "Serving as team leaders, students design and execute analysis of data they have collected in Mexican and US field research sites, and coauthor a publishable article. Methods for organizing field data, advanced techniques of quantitative and qualitative data analysis, and report preparation conventions are covered.",
  "prerequisite": "LATI 222B, permission of instructor (department authorization required)."
 },
 {
  "code": "LATI 298",
  "title": "Directed Reading",
  "unit": "1-12",
  "description": "Guided and supervised reading of the literature of the several areas included in the interdisciplinary fields of anthropology, communications, economics, history, literature, political science, and sociology.",
  "prerequisite": "graduate standing in Latin American Studies."
 },
 {
  "code": "LATI 299",
  "title": "Independent Research",
  "unit": "1-12",
  "description": "Independent work by graduate students engaged in thesis research and writing under the direct supervision of a faculty adviser.",
  "prerequisite": null
 },
 {
  "code": "LATI 500",
  "title": "Teaching Apprenticeship",
  "unit": "1-4",
  "description": "The course is designed for teaching assistants to learn effective teaching methods through supervision and mentorship by the faculty. Student will learn handling of discussions; preparation and grading of examinations and other written exercises; and student relations.",
  "prerequisite": null
 }
]