[
 {
  "code": "LHCO 202",
  "title": "Strategic Management and Organizational Change",
  "unit": "4",
  "discription": "This course examines principles and applications of strategic management and the change management concepts necessary to effectively apply these principles in healthcare organizations. The course provides a structured, stepwise approach to the strategic management process and includes methods for assessing key features of organizational environments and competitive situations, approaches for developing strategic plans, and processes for insuring the successful implementation of strategy.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 203",
  "title": "Using and Managing Information and Information Technologies",
  "unit": "4",
  "discription": "Designed to familiarize health administrators and professionals with the principles of information systems design and management for health care. Provides an understanding of current trends in information technologies for health care and management issues unique to it. Includes hands-on computer lab.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 204",
  "title": "Conflict Resolution, Negotiation, and Team Building",
  "unit": "2",
  "discription": "This course studies key management concepts and roles of management and how they apply in successful, dynamic organizations. The course examines competencies of effective managers in developing customer focus, planning, selecting and developing individuals and teams, communicating, managing resources, using technology and being adaptable. Students will be exposed to the theory and process of effective negotiation as well as various teambuilding and conflict resolution strategies in a variety of contexts.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 206",
  "title": "Topics in Financial Management and Decision Making",
  "unit": "2",
  "discription": "This course presents real-life applications in healthcare provider organizations of financial management and decision making. Topics include budgeting, uses of financial reports, development of long-range financial forecasts, benchmarking, business plan development, and actuarial analysis in projecting healthcare delivery costs.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 209",
  "title": "Outcomes and Quality Improvement",
  "unit": "4",
  "discription": "A critical overview of the tools used to measure outcomes and quality of care, development and use of practical guidelines, advantages and disadvantages of various methods, and the use of such analysis in administrative decision making.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 212",
  "title": "Statistics and Applied Decision Making",
  "unit": "2",
  "discription": "Students will learn statistical methods and their most common applications in healthcare management. Topics covered include data presentation, sampling, the development and use of confidence intervals, hypothesis testing, analysis of variance and simple regression. We will also explore elementary probability theory and decision making under uncertainty. Students who have taken LHCO 208 may not receive credit for LHCO 212.",
  "prerequsite": "admission to MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 213",
  "title": "Financial Accounting and Analysis",
  "unit": "2",
  "discription": "Students will learn the use of financial information within a healthcare organization. Topics covered will include capital structure, working capital and cash management, the time value of money, and capital budgeting.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 215",
  "title": "Modern Health Care",
  "unit": "2",
  "discription": "Describes and analyzes the healthcare delivery system in the U.S. Participants gain understanding of the health policy process and how health care is financed. Organizational structures of institutions and professional groups are assessed. Actions taken by employers, insurers, consumers, and government, and the effects on physicians and provider organizations are analyzed.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 216",
  "title": "Healthcare Leadership",
  "unit": "4",
  "discription": "Describes the critical knowledge and skills needed to be effective leaders in today's complex healthcare environment. Sessions cover conflict resolution, leadership and negotiation skills, strategic planning, and ethics. Guest speakers include business leaders and entrepreneurs from the local healthcare industry.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 217",
  "title": "Project Management for Healthcare Professionals",
  "unit": "2",
  "discription": "Covers core body of knowledge and skills of project management specific to the healthcare industry. Students learn how to define, plan, and execute a project on time, on budget and within performance specifications. Topics include project life cycle, definition, and charter creation; assembling high performance teams; risk analysis; and project closure.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 218",
  "title": "Professional Development Seminar: Mentorship and Assessment",
  "unit": "2",
  "discription": "Faculty member directs a student's study in development of mentorship and leadership skills as related to student's research interest. Readings, assignments, and formalized career assessment and mentoring sessions designed to integrate course work with the development of the student's ISP proposal on an applied research topic. This course is taken in the last quarter prior to enrollment in LHCO 298 Independent Study Project course.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 219",
  "title": "Process Improvement in Health Care",
  "unit": "4",
  "discription": "Students learn and apply concepts and techniques of business process analysis and improvements as building blocks for operations improvement strategies in health care. Students will analyze and improve processes in various contexts using different process improvement tools from simple process-mapping to computer-based process-modeling. Use of fundamental and sophisticated analytical techniques to design and manage efficient and effective operations and processes will be covered. The importance of balancing technical/analytical and organizational/behavioral aspects of business process improvements will be highlighted.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 220",
  "title": "Topics in Health Law",
  "unit": "2",
  "discription": "The survey course introduces students to the relationship of law to health care, including liability, government regulation, financial and ethical issues, contracting, and negotiation and dispute resolution. The course will incorporate the most current trends related to health law and feature guest speakers on relevant topics.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 221",
  "title": "Current Topics in Healthcare",
  "unit": "2",
  "discription": "The course will address current topics in the healthcare industry, especially related to population health and current evolving trends. Special guest lecturers from the San Diego healthcare community will be invited to address the seminar. This will provide an opportunity for students to hear directly from healthcare leaders and will involve a question and answer session.",
  "prerequsite": "admission to the MAS in the Leadership of Healthcare Organizations Program or consent of department."
 },
 {
  "code": "LHCO 298",
  "title": "Independent Study Project in the Management of Health Care",
  "unit": "4",
  "discription": "The Independent Study Project (ISP) is the cornerstone of the MAS Program. Students will be involved in a high-level applied research project that integrates what they have learned in their formal course work. The ISP will be an independent and creative scholarly activity in an area related to one or more of the topics covered in the formal curriculum. Students' work will be evaluated by a committee consisting of faculty and, when appropriate, industry advisers.",
  "prerequsite": "LHCO 218, admission to the MAS in the Leadership of Healthcare Organizations Program, or consent of department."
 }
]