[
 {
  "code": "MAE 02",
  "title": "Introduction to Aerospace Engineering",
  "unit": "4",
  "description": "An introduction to topics in aeronautical and astronautical engineering including aerodynamics, propulsion, flight mechanics, structures, materials, orbital mechanics, design, mission planning, and environments. General topics include historical background, career opportunities, engineering ethics, and professionalism.",
  "prerequisite": "none."
 },
 {
  "code": "MAE 03",
  "title": "Introduction to Engineering Graphics and Design",
  "unit": "4",
  "description": "Introduction to design process through a hands-on design project performed in teams. Topics include problem identification, concept generation, project management, risk reduction. Engineering graphics and communication skills are introduced in the areas of: Computer-Aided Design (CAD), hand sketching, and technical communication. Program or materials fees may apply.",
  "prerequisite": "PHYS 2A or 4A. Enrollment restricted to BE 25, MC 25, MC 27, MC 29, and MC 30-34 majors only."
 },
 {
  "code": "MAE 05",
  "title": "Quantitative Computer Skills",
  "unit": "4",
  "description": "Introductory course for nonengineering majors. Use of computers in solving problems; applications from life sciences, physical sciences, and engineering. Students run existing computer programs and complete some programming in BASIC.",
  "prerequisite": "none."
 },
 {
  "code": "MAE 07",
  "title": "Spatial Visualization",
  "unit": "1",
  "description": "(Cross-listed with SE 7.) Spatial visualization is the ability to manipulate 2-D and 3-D shapes in one’s mind. In this course, students will perform exercises that increase their spatial visualization skills. P/NP grades only. Students may not receive credit for SE 7 and MAE 7.",
  "prerequisite": "none."
 },
 {
  "code": "MAE 08",
  "title": "Matlab Programming for Engineering Analysis",
  "unit": "4",
  "description": "Computer programming in Matlab with elementary numerical analysis of engineering problems. Arithmetic and logical operations, arrays, graphical presentation of computations, symbolic mathematics, solutions of equations, and introduction to data structures.",
  "prerequisite": "MATH 20A and 20B or consent of instructor."
 },
 {
  "code": "MAE 11",
  "title": "Thermodynamics",
  "unit": "4",
  "description": "Fundamentals of engineering thermodynamics: energy, work, heat, properties of pure substances, first and second laws for closed systems and control volumes, gas mixtures. Application to engineering systems, power and refrigeration cycles, combustion. Renumbered from MAE 110A. Students may not receive credit for MAE 11 and MAE 110A.",
  "prerequisite": "PHYS 2C and CHEM 6A. Enrollment restricted to engineering majors only."
 },
 {
  "code": "MAE 20",
  "title": "Elements of Materials Science",
  "unit": "4",
  "description": "The structure of materials: metals, ceramics, glasses, semiconductors, superconductors, and polymers to produce desired, useful properties. Atomic structures. Defects in materials, phase diagrams, microstructural control. Mechanical and electrical properties are discussed. Time temperature transformation diagrams. Diffusion.",
  "prerequisite": "PHYS 2A or 4A, CHEM 6A or CHEM 6AH, and MATH 20C."
 },
 {
  "code": "MAE 21",
  "title": "Aerospace Materials Science",
  "unit": "4",
  "description": "Atomic structure and physical properties of engineering materials including metals, ceramics, glasses, polymers, and composite materials. Defects and phase diagram of materials. Material testing and processing. Program or materials fees may apply.",
  "prerequisite": "PHYS 2A or 4A, CHEM 6A or CHEM 6AH, and MATH 20B. Enrollment restricted to MC 25 majors only."
 },
 {
  "code": "MAE 30A",
  "title": "Kinematics",
  "unit": "4",
  "description": "Statics: statics of particles and rigid bodies in 3-D. Free body diagrams. Moment of a force, couples, equivalent systems of forces. Distributed forces, centroids, and centers of gravity. Introduction to dynamics: 3-D relative motion, kinematics, and kinetics of particles. Newton’s equations of motion. Equilibrium problems with friction. Enrollment restricted to engineering majors MC25, MC27, MC29, SE27.",
  "prerequisite": "PHYS 2A and MATH 31BH or MATH 20C."
 },
 {
  "code": "MAE 30B",
  "title": "Dynamics and Vibrations",
  "unit": "4",
  "description": "Dynamics: energy methods for motion of particles and rigid bodies, including virtual work, power, and Lagrange’s equations. Impact and impulses. Systems of particles. Introduction to 3-D dynamics of rigid bodies. Introduction to vibrations: free and harmonically forced vibrations of undamped and damped single degree of freedom systems. Enrollment restricted to engineering majors only MC25, MC27, MC29, SE27.",
  "prerequisite": "MAE 30A."
 },
 {
  "code": "MAE 40",
  "title": "Linear Circuits",
  "unit": "4",
  "description": "Steady-state and dynamic behavior of linear, lumped-parameter electrical circuits. Kirchhoff's laws. RLC circuits. Node and mesh analysis. Operational amplifiers. Signal acquisition and conditioning. Electric motors. Design applications in engineering.",
  "prerequisite": "MATH 20D and MATH 31AH or MATH 18 or MATH 20F, and PHYS 2B."
 },
 {
  "code": "MAE 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges. Topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": "none."
 },
 {
  "code": "MAE 92A",
  "title": "Design Competition—Design, Build, and Fly Aircraft",
  "unit": "1",
  "description": "(Cross-listed with SE 10A.) Student teams design, build, and fly unmanned aircraft for a national student competition. Students concentrate on vehicle system design including aerodynamics, structures, propulsion, and performance. Teams engineering, fabricate the aircraft, submit a design report, and prep aircraft for competition.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 93",
  "title": "Design Competition—Design, Build, and Test Race Car",
  "unit": "1",
  "description": "Student teams design, build, and test a formula-style racing car for an international student competition. Students concentrate on vehicle system analysis and design, manufacturability and performance. Teams engineer, fabricate car, submit a design report and prep car for competition.",
  "prerequisite": "department approval."
 },
 {
  "code": "MAE 98",
  "title": "Directed Group Study",
  "unit": "2",
  "description": "Directed group study on a topic or in a field not included in the regular departmental curriculum. P/NP grades only. May be taken for credit two times. Credit may not be received for a course numbered 97, 98, or 99 subsequent to receiving credit for a course numbered 197, 198, or 199.",
  "prerequisite": "department approval."
 },
 {
  "code": "MAE 99H",
  "title": "Independent Study",
  "unit": "1",
  "description": "Independent study or research under direction of a member of the faculty.",
  "prerequisite": "student must be of first-year standing and a Regent's Scholar; approved Special Studies form."
 },
 {
  "code": "MAE 101A",
  "title": "Introductory Fluid Mechanics",
  "unit": "4",
  "description": "Fluid statics; fluid kinematics; integral and differential forms of the conservation laws for mass, momentum, and energy; Bernoulli equation; potential flows; dimensional analysis and similitude.",
  "prerequisite": "PHYS 2A or 4A and MATH 20D and MATH 20E or MATH 31CH, or consent of instructor. Enrollment restricted to MC25, MC27, and MC29 majors only."
 },
 {
  "code": "MAE 101B",
  "title": "Advanced Fluid Mechanics",
  "unit": "4",
  "description": "Laminar and turbulent flow. Pipe flow including friction factor. Boundary layers, separation, drag, and lift. Compressible flow including shock waves.",
  "prerequisite": "MAE 101A or CENG 101A, and MAE 11 or MAE 110A or CENG 102, or consent of instructor."
 },
 {
  "code": "MAE 101C",
  "title": "Heat Transfer",
  "unit": "4",
  "description": "Extension of fluid mechanics in MAE 101A-B to viscous, heat-conducting flows. Application of the energy conservation equation to heat transfer in ducts and external boundary layers. Heat conduction and radiation transfer. Heat transfer coefficients in forced and free convection. Design applications.",
  "prerequisite": "MAE 101A or CENG 101A, and MAE 105."
 },
 {
  "code": "MAE 101D",
  "title": "Intermediate Heat Transfer",
  "unit": "4",
  "description": "Course builds on the MAE fluids sequence, offering more advanced concepts in conduction, convection, radiation, and heat exchanger design. This course covers numerical methods in conduction, boiling, condensation and evaporation analysis, natural and turbulent convection, spectral and directional radiative transfer, heatpipes, thermal design of spacecraft, heat exchanger analysis and design.",
  "prerequisite": "senior standing and MAE 101C, or consent of instructor."
 },
 {
  "code": "MAE 104",
  "title": "Aerodynamics",
  "unit": "4",
  "description": "Basic relations describing flow field around wings and bodies at subsonic and supersonic speed. Thin-wing theory. Slender-body theory. Formulation of theories for evaluating forces and moments on airplane geometries. Application to the design of high-speed aircraft.",
  "prerequisite": "MAE 101A and 101B, or consent of instructor. Enrollment restricted to MC 25, MC 27, MC 28, and SE 27 majors only."
 },
 {
  "code": "MAE 105",
  "title": "Introduction to Mathematical Physics",
  "unit": "4",
  "description": "Fourier series, Sturm Liouville theory, elementary partial differential equations, integral transforms with applications to problems in vibration, wave motion, and heat conduction.",
  "prerequisite": "PHYS 2A and B, and MATH 20D or 21D. Enrollment restricted to engineering majors only."
 },
 {
  "code": "MAE 107",
  "title": "Computational Methods in Engineering",
  "unit": "4",
  "description": "Introduction to scientific computing and algorithms; iterative methods, systems of linear equations with applications; nonlinear algebraic equations; function interpolation and differentiation and optimal procedures; data fitting and least-squares; numerical solution of ordinary differential equations.",
  "prerequisite": "MAE 8 or 9, and MATH 18 or 20F or 31AH."
 },
 {
  "code": "MAE 108",
  "title": "Probability and Statistical Methods for Mechanical Engineering",
  "unit": "4",
  "description": "Probability theory, conditional probability, Bayes theorem, random variables, densities, expected values, characteristic functions, central limit theorem. Engineering reliability, elements of estimation, random sampling, sampling distributions, hypothesis testing, confidence intervals. Curve fitting and data analysis. Students cannot receive credit for MAE 108 and ECE 109, ECON 120A, MATH 180A, MATH 183, MATH 186, or SE 125.",
  "prerequisite": "MATH 18 or 20F."
 },
 {
  "code": "MAE 110",
  "title": "Thermodynamic Systems",
  "unit": "4",
  "description": "Thermodynamic analysis of power cycles with application to combustion driven engines: internal combustion, diesel, and gas turbines. Thermodynamics of mixtures and chemical and phase equilibrium. Computational methods for calculating chemical equilibrium. Renumbered from MAE 110B. Students may not receive credit for MAE 110 and MAE 110B.",
  "prerequisite": "MAE 11 or 110A. (Course not offered every year.)"
 },
 {
  "code": "MAE 113",
  "title": "Fundamentals of Propulsion",
  "unit": "4",
  "description": "Compressible flow, thermodynamics, and combustion relevant to aircraft and space vehicle propulsion. Analysis and design of components for gas turbines, including turbines, inlets, combustion chambers and nozzles. Fundamentals of rocket propulsion.",
  "prerequisite": "MAE 11 or MAE 110A or CENG 102, and MAE 101A or CENG 101A, and MAE 101B or CENG 101C. Enrollment restricted to MC 25, MC 27, and MC 28 majors only."
 },
 {
  "code": "MAE 117A",
  "title": "Elementary Plasma Physics",
  "unit": "4",
  "description": "(Cross-listed with Physics 151.) Particle motions, plasmas as fluids, waves, diffusion, equilibrium and stability, nonlinear effects, controlled fusion. Recommended preparation: PHYS 100B-C or ECE 107.",
  "prerequisite": "MATH 20D or 21D, or consent of instructor."
 },
 {
  "code": "MAE 118",
  "title": "Introduction to Energy and Environment",
  "unit": "4",
  "description": "Overview of present-day primary energy sources and availability: fossil fuel, renewable, and nuclear; heat engines; energy conservation, transportation, air pollution, and climate change. Students may not receive credit for both MAE 118 and MAE 118A.",
  "prerequisite": "MAE 101A or CENG 101A, or consent of instructor."
 },
 {
  "code": "MAE 119",
  "title": "Introduction to Renewable Energy: Solar and Wind",
  "unit": "4",
  "description": "Basic principles of solar radiation—diffuse and direct radiation; elementary solar energy engineering—solar thermal and solar photovoltaic; basic principles of wind dynamics—hydrodynamic laws, wind intermittency, Betz’s law; elementary wind energy engineering; solar and wind energy perspectives; operating the California power grid with 33 percent renewable energy sources. Students may not receive credit for both MAE 118B and MAE 119.",
  "prerequisite": "MAE 101A or CENG 101A, or consent of instructor."
 },
 {
  "code": "MAE 120",
  "title": "Introduction to Nuclear Energy",
  "unit": "4",
  "description": "Overview of basic fission and fusion processes. Elementary fission reactor physics and engineering; environmental and waste disposal issues. Survey of fusion technology issues and perspectives. May not receive credit for both MAE 118C and MAE 120.",
  "prerequisite": "MAE 101A or CENG 101A, or consent of instructor."
 },
 {
  "code": "MAE 121",
  "title": "Air Pollution Transport and Dispersion Modeling",
  "unit": "4",
  "description": "Overview of air pollution and wastes and their impact. Characteristics of air pollutants. Air pollution transport. Atmospheric stability. Plume rise and dispersion. Meteorological data. Selecting the appropriate air quality model and case studies. Modeling complex terrain situations. Current air quality modeling issues. Laws and regulations to control air pollution.",
  "prerequisite": "MAE 122."
 },
 {
  "code": "MAE 122",
  "title": "Flow and Transport in the Environment",
  "unit": "4",
  "description": "Introduction to the air and aquatic environments. Buoyancy, stratification, and rotation. Earth surface energy balance. Introduction to the atmospheric boundary layer. Advection and diffusion. Turbulent diffusion and dispersion in rivers and in the atmospheric boundary layer. Surface waves and internal gravity waves.",
  "prerequisite": "MAE 101A or CENG 101A, or consent of instructor."
 },
 {
  "code": "MAE 123",
  "title": "Introduction to Transport in Porous Media",
  "unit": "4",
  "description": "Introduction to groundwater flow. Pollution transport through the water table. Fundamentals of flow. Single- and multi-phase flow. Darcy law. Well hydraulics. Diffusion and dispersion. Gravity currents and plumes in porous media. Chemistry of fluid-solid interactions. Fundamentals of adsorption and surface reactions.",
  "prerequisite": "MAE 105."
 },
 {
  "code": "MAE 125",
  "title": "Building Energy Efficiency",
  "unit": "4",
  "description": "Physical building performance including building thermodynamics, daylighting, and solar control. Heat transfer through building envelope, solar geometry, and shading. Heating, ventilation, and air conditioning system design, water heating, microclimates, passive system design, energy efficient design, applicant energy use, cost estimating. Building energy codes and standards. Building design project with whole building energy simulation software.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "MAE 126A",
  "title": "Environmental Engineering Laboratory",
  "unit": "4",
  "description": "Analysis of experiments in Environmental Engineering: Drag in a water tunnel, shading effects on solar photovoltaic, buoyant plume dispersion in a water tank, atmospheric turbulence, and others. Use of sensors and data acquisition. Laboratory report writing; error analysis; engineering ethics.",
  "prerequisite": "MAE 101A or CENG 101A; MAE 170 and MAE 122."
 },
 {
  "code": "MAE 126B",
  "title": "Environmental Engineering Design",
  "unit": "4",
  "description": "Fundamental principles of environmental design. Building a working prototype or computer model for an environmental engineering application. Work in teams to propose and design experiments and components, obtain data, complete engineering analysis, and write a report. Engineering ethics and professionalism.",
  "prerequisite": "MAE 126A."
 },
 {
  "code": "MAE 130",
  "title": "Advanced Vibrations",
  "unit": "4",
  "description": "Harmonically excited vibrations. Vibration of multiple degree-of-freedom systems. Observations, including beat frequencies, static and dynamic coupling, traveling and standing wave phenomena. Vibration of continuous systems. Hamilton's equations. Distributed and point forces and moments in continuous systems and the generalized Dirac distribution. Response to impact and impulse excitation. Modeling continuous systems with approximate discrete models. Restricted to engineering majors only MC25, MC27, MC29, MO21, SE27.",
  "prerequisite": "MATH 18 or MATH 20F or MATH 31AH and MAE 30B or MAE 130B."
 },
 {
  "code": "MAE 131A",
  "title": "Solid Mechanics I",
  "unit": "4",
  "description": "Concepts of stress and strain. Hooke's Law. Axial loading of bars. Torsion of circular shafts. Shearing and normal stresses in beam bending. Deflections in beams. Statically determinate and indeterminate problems. Combined loading. Principal stresses and design criteria. Buckling of columns.",
  "prerequisite": "MATH 20D and MAE 30A or MAE 130A or SE 101A."
 },
 {
  "code": "MAE 131B",
  "title": "Fundamentals of Solid Mechanics II",
  "unit": "4",
  "description": "Analysis of 3-D states of stress and strain. Governing equations of linear elasticity. Solution of elasticity problems in rectangular and polar coordinates. Stress concentration. Failure criteria. Torsion of noncircular and thin walled members. Energy methods. Plastic collapse and limit analysis.",
  "prerequisite": "MAE 131A or SE 110A and MAE 105. Enrollment restricted to engineering majors only."
 },
 {
  "code": "MAE 133",
  "title": "Finite Element Methods in Mechanical and Aerospace Engineering",
  "unit": "4",
  "description": "Development of stiffness and mass matrices based upon variational principles and application to static, dynamic, and design problems in structural and solid mechanics. Architecture of computer codes for linear and nonlinear finite element analysis. The use of general-purpose finite element codes.",
  "prerequisite": "MAE 131A or SE 110A. (Not offered every year.)"
 },
 {
  "code": "MAE 142",
  "title": "Dynamics and Control of Aerospace Vehicles",
  "unit": "4",
  "description": "The dynamics of vehicles in space or air are derived for analysis of the stability properties of spacecraft and aircraft. The theory of flight, lift, drag, Dutch roll and phugoid modes of aircraft are discussed. Optimal state space control theory for the design of analog and digital controllers (autopilots).",
  "prerequisite": "MAE 104 and MAE 143B or ECE 171A, or consent of instructor. Enrollment restricted to engineering majors only."
 },
 {
  "code": "MAE 143A",
  "title": "Signals and Systems",
  "unit": "4",
  "description": "Dynamic modeling and vector differential equations. Concepts of state, input, output. Linearization around equilibria. Laplace transform, solutions to ODEs. Transfer functions and convolution representation of dynamic systems. Discrete signals, difference equations, z-transform. Continuous and discrete Fourier transform.",
  "prerequisite": "MATH 20D or 21D, MATH 20E, MATH 18 or 20F or 31AH, or consent of instructor."
 },
 {
  "code": "MAE 143B",
  "title": "Linear Control",
  "unit": "4",
  "description": "Analysis and design of feedback systems in the frequency domain. Transfer functions. Time response specifications. PID controllers and Ziegler-Nichols tuning. Stability via Routh-Hurwitz test. Root locus method. Frequence response: Bode and Nyquist diagrams. Dynamic compensators, phase-lead and phase-lag. Actuator saturation and integrator wind-up.",
  "prerequisite": "MAE 143A or consent of instructor."
 },
 {
  "code": "MAE 144",
  "title": "Embedded Control and Robotics",
  "unit": "4",
  "description": "Each student builds, models, programs, and controls an unstable robotic system built around a small Linux computer. Review/synthesis of: A) modern physical and electrical CAD. B) dynamics, signals and systems, linear circuits; PWMs, H-bridges, quadrature encoders. C) embedded Linux, C, graphical programming; multithreaded applications; bus communication to supporting ICs. D) classical control theory in both continuous-time (CT) and discrete-time (DT); interconnection of CT and DT elements. Program or materials fees may apply.",
  "prerequisite": "upper-division standing or graduate student, and MAE 143B or BENG 122A or ECE 171A, or consent of instructor."
 },
 {
  "code": "MAE 145",
  "title": "Introduction to Robotic Planning and Estimation",
  "unit": "4",
  "description": "This course is an introduction to robotic planning algorithms and programming. Topics: sensor-based planning (bug algorithms), motion planning via decomposition and search (basic search algorithms on graphs, ",
  "prerequisite": null
 },
 {
  "code": "MAE 148",
  "title": "Introduction to Autonomous Vehicles",
  "unit": "4",
  "description": "Fundamentals of autonomous vehicles. Working in small teams, students will develop 1/8-scale autonomous cars that must perform on a simulated city track. Topics include robotics system integration, computer vision, algorithms for navigation, on-vehicle vs. off-vehicle computation, computer learning systems such as neural networks, locomotion systems, vehicle steering, dead reckoning, odometry, sensor fusion, GPS autopilot limitations, wiring, and power distribution and management.",
  "prerequisite": "ECE 15 or ECE 35 or MAE 2 or MAE 3 and department approval."
 },
 {
  "code": "MAE 149",
  "title": "Sensor Networks",
  "unit": "4",
  "description": "(Cross-listed with ECE 156.) Characteristics of chemical, biological, seismic and other physical sensors; signal processing techniques supporting distributed detection of salient events; wireless communication and networking protocols supporting formation of robust censor fabrics; current experience with low power, low-cost sensor deployments. Students may not receive credit for both MAE 149 and ECE 156. May be coscheduled with SIOC 238.",
  "prerequisite": "upper-division standing. (Not offered every year.)"
 },
 {
  "code": "MAE 150",
  "title": "Computer-Aided Design",
  "unit": "4",
  "description": "Computer-aided analysis and design. Design methodology, tolerance analysis, Monte Carlo analysis, kinematics and computer-aided design of linkages, numerical calculations of moments of inertia, design of cams and cam dynamics; finite element analysis, design using Pro-E, Mechanica Motion and Mechanica Structures.",
  "prerequisite": "MAE 30A or MAE 130A or SE 101A or BENG 110, MAE 107 or SE 121, MAE 3, and senior standing in engineering major, or consent of instructor."
 },
 {
  "code": "MAE 152",
  "title": "Introductions to Manual and CNC Machining",
  "unit": "1",
  "description": "In this class, students are introduced to precision machining. Students will learn the proper safe operating procedures of a manual mill and lathe, band saws, and hand tools. Other topics include the basics of tolerancing, design (Fusion 360), and operation of CNC milling and turning. Program or materials fees may apply. Recommended preparation: It is recommended that students take introduction to design process through a hands-on design project course or some other introduction to shop course.",
  "prerequisite": null
 },
 {
  "code": "MAE 154",
  "title": "Product Design and Entrepreneurship",
  "unit": "4",
  "description": "This course will teach teams of students how to develop concepts and business plans in the design of new and innovative products. Emphasis will be placed on identifying user needs, concept generation, and prototype fabrication.",
  "prerequisite": "upper-division standing and consent of instructor."
 },
 {
  "code": "MAE 155A",
  "title": "Aerospace Engineering Design I",
  "unit": "4",
  "description": "Fundamental principles of aerospace vehicle design including the conceptual, preliminary, and detailed design phases. Aeronautical or astronautical design project that integrates all appropriate engineering disciplines as well as issues associated with optimization, teamwork, manufacturability, reporting, and professionalism.",
  "prerequisite": "MAE 2, MAE 21, or SE 2 or SE 104, MAE 104, MAE 30B or MAE 130C, and SE 160B, or consent of instructor."
 },
 {
  "code": "MAE 155B",
  "title": "Aerospace Engineering Design II",
  "unit": "4",
  "description": "The principles of aerospace vehicle design including the conceptual, preliminary, and detailed design phases. Aeronautical or astronautical design project that integrates all appropriate engineering disciplines as well as issues associated with optimization, teamwork, manufacturability, reporting, and professionalism. Program or materials fees may apply.",
  "prerequisite": "MAE 113, MAE 142, MAE 155A, and MAE 170, or consent of instructor."
 },
 {
  "code": "MAE 156A",
  "title": "Fundamental Principles of Mechanical Design I",
  "unit": "4",
  "description": "Fundamental principles of mechanical design and the design process. Application of engineering science to the design and analysis of mechanical components. Initiation of team design projects that culminate in MAE 156B with a working prototype designed for a real engineering application. Professional ethics discussed. Program or materials fees may apply.",
  "prerequisite": "MAE 3, MAE 30B, MAE 131A, MAE 150, and MAE 170, or consent of instructor. Open to major code MC 27 only."
 },
 {
  "code": "MAE 156B",
  "title": "Fundamental Principles of Mechanical Design II",
  "unit": "4",
  "description": "Fundamental principles of mechanical design and the design process. Culmination of a team design project initiated in MAE 156A which results in a working prototype designed for a real engineering application.",
  "prerequisite": "MAE 156A in the immediately preceding quarter, MAE 101C, MAE 143B, and MAE 160 or MAE 131B. Open to major code MC 27 only."
 },
 {
  "code": "MAE 160",
  "title": "Mechanical Behavior of Materials",
  "unit": "4",
  "description": "Elasticity and inelasticity, dislocations and plasticity of crystals, creep, and strengthening mechanisms. Mechanical behavior of ceramics, composites, and polymers. Fracture: mechanical and microstructural. Fatigue. Laboratory demonstrations of selected topics.",
  "prerequisite": "MAE 20, MAE 30A or MAE 130A or SE 101A, and MAE 131A, or consent of instructor."
 },
 {
  "code": "MAE 165",
  "title": "Fatigue and Failure Analysis of Engineering Components",
  "unit": "4",
  "description": "The engineering and scientific aspects of crack nucleation, slow crack growth, and unstable fracture in crystalline and amorphous solids. Microstructural effects on crack initiation, fatigue crack growth and fracture toughness. Methods of fatigue testing and fracture toughness testing. Fractography and microfractography. Design safe methodologies and failure prevention. Failure analysis of real engineering structures.",
  "prerequisite": "consent of instructor. (Not offered every year.)"
 },
 {
  "code": "MAE 166",
  "title": "Nanomaterials",
  "unit": "4",
  "description": "(Cross-listed with NANO 156.) Basic principles of synthesis techniques, processing, microstructural control and unique physical properties of materials in nanodimensions. Nanowires, quantum dots, thin films, electrical transport, optical behavior, mechanical behavior, and technical applications of nanomaterials.",
  "prerequisite": "upper-division standing. (Not offered every year.)"
 },
 {
  "code": "MAE 167",
  "title": "Wave Dynamics in Materials",
  "unit": "4",
  "description": "Pressure and shear waves in infinite solids. Reflection and diffraction. Rayleigh and Love waves in semi-infinite space. Impulse load on a half space. Waveguides and group velocity.",
  "prerequisite": "consent of instructor. (Not offered every year.)"
 },
 {
  "code": "MAE 170",
  "title": "Experimental Techniques",
  "unit": "4",
  "description": "Principles and practice of measurement and control and the design and conduct of experiments. Technical report writing. Lectures relate to dimensional analysis, error analysis, signal-to-noise problems, filtering, data acquisition and data reduction, as well as background of experiments and statistical analysis. Experiments relate to the use of electronic devices and sensors.",
  "prerequisite": "PHYS 2C or PHYS 4B and PHYS 2CL or MAE 140. Enrollment restricted to MC 25, MC 27, MC 29, CE 25, BE 25, BE 27."
 },
 {
  "code": "MAE 171A",
  "title": "Mechanical Engineering Laboratory I",
  "unit": "4",
  "description": "Design and analysis of experiments in fluid mechanics, solid mechanics, and control engineering. Experiments in wind tunnel, water tunnel, vibration table and material testing machines, and refined electromechanical systems. Laboratory report writing; error analysis; engineering ethics.",
  "prerequisite": "MAE 101A and MAE 170. Enrollment restricted to MC 27 majors only."
 },
 {
  "code": "MAE 171B",
  "title": "Mechanical Engineering Laboratory II",
  "unit": "4",
  "description": "Design and analysis of original experiments in mechanical engineering. Students research projects using experimental facilities in undergraduate laboratories: wind tunnel, water channel, vibration table, and testing machine and control systems. Students propose and design experiments, obtain data, complete engineering analysis and write a major report.",
  "prerequisite": "MAE 171A. (Not offered every year.)"
 },
 {
  "code": "MAE 175A",
  "title": "Aerospace Engineering Laboratory I",
  "unit": "4",
  "description": "Analysis of aerospace engineering systems using experimental facilities in undergraduate laboratories: wind tunnel, water channel, vibration table, and testing machine. Students operate facilities, obtain data, complete engineering analysis and write major reports.",
  "prerequisite": "senior standing; MAE 101C or CENG 101B; MAE 143B or CENG 120; and MAE 170, or consent of instructor."
 },
 {
  "code": "MAE 180A",
  "title": "Spacecraft Guidance I",
  "unit": "4",
  "description": "Astrodynamics, orbital motion, perturbations, coordinate systems and frames of reference. Geosynchronous orbits, stationkeeping. Orbital maneuvers, fuel consumption, guidance systems. Observation instrument point, tracking, control. Basic rocket dynamics. Navigation, telemetry, re-entry, and aero- assisted maneuvers. Mission design. Students perform analyses based on mission requirements.",
  "prerequisite": "upper-division standing in physics, mathematics, or engineering department."
 },
 {
  "code": "MAE 181",
  "title": "Space Mission Analysis and Design",
  "unit": "4",
  "description": "Space mission concepts, architectures, and analysis. Mission geometry. Astrodynamics. Orbit and constellation design. Space environment. Payload and spacecraft design and sizing. Power sources and distribution. Thermal management. Structural design. Guidance and navigation. Space propulsion. Orbital debris and survivability. Cost modeling and risk analysis.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MAE 184",
  "title": "Flight Simulation Techniques",
  "unit": "4",
  "description": "Students will develop software and methods to simulate the motion characteristics of flight vehicles. Six degree-of-freedom equations of motion will be reviewed with emphasis on computer implementation. Algorithms for data modeling, numerical integration, equilibrium, and linearization will be introduced. Three-dimensional visualization techniques will be explored for representing operator and observer viewpoints. Applications include aircraft, automobiles, and marine vessels.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MAE 190",
  "title": "Topics in Mechanical and Aerospace Engineering",
  "unit": "4",
  "description": "Topics of special interest in mechanical and aerospace engineering. May be repeated for credit as topics vary.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "MAE 191",
  "title": "Topics in Mechanical and Aerospace Engineering with Laboratory",
  "unit": "4",
  "description": "Topics of special interest in mechanical and aerospace engineering with laboratory. May be repeated for credit as topics vary.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "MAE 197",
  "title": "Engineering Internship",
  "unit": "1-12",
  "description": "Students work in local industry or hospitals under faculty supervision. Units may not be applied toward graduation requirements. Salaried or unsalaried. Number of units determined by enrollment frequency. First quarter up to four units. Subsequent quarters cannot exceed one unit.",
  "prerequisite": "consent of instructor and department stamp, 2.50 overall GPA minimum, at least ninety units."
 },
 {
  "code": "MAE 198",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study on a topic or in a field not included in the regular department curriculum, by special arrangement with a faculty member. May be taken P/NP only.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 199",
  "title": "Independent Study for Undergraduates",
  "unit": "4",
  "description": "Independent reading or research on a problem by special arrangement with a faculty member. P/NP grades only.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 200",
  "title": "Controls",
  "unit": "4",
  "description": "This course covers topics in probability and stochastic processes, linear control and estimation including optimal linear control, nonlinear stabilization, and optimal control and estimation for nonlinear systems. ",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 201",
  "title": "Mechanics of Fluids",
  "unit": "4",
  "description": "This course covers topics in kinematics, equations of motion, dimensional analysis, laminar and irrotational flow, vorticity dynamics, and boundary layers.",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 202",
  "title": "Thermal Processes",
  "unit": "4",
  "description": "This course covers topics in energy conservation, heat conduction, convection, radiation, heat transfer in ducts, external boundary layer, and heat exchangers.",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 203",
  "title": "Solid Mechanics and Materials",
  "unit": "4",
  "description": "This course covers topics in kinematics, conservation laws, constitutive equation of linear elastic solids, plasticity, and viscoelasticity.",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 204",
  "title": "Robotics",
  "unit": "4",
  "description": "This course covers topics in robotics, dynamics, kinematics, mechatronics, control, locomotion, and manipulation.",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 205",
  "title": "Graduate Seminar",
  "unit": "1",
  "description": "Each graduate student in MAE is expected to attend one seminar per quarter, of his or her choice, dealing with current topics in fluid mechanics, solid mechanics, applied plasma physics and fusion, chemical engineering, applied ocean sciences, energy and combustion, environmental engineering, or materials science, and dynamics and controls. Topics will vary. (S/U grades only)",
  "prerequisite": null
 },
 {
  "code": "MAE 206",
  "title": "Energy Systems",
  "unit": "4",
  "description": "This course covers topics in primary energy sources, availability and variability, fossil fuels, renewables and nuclear, energy dependent energy sources, heat engine, energy conservation, exergy, transportation, air pollution, and climate change.",
  "prerequisite": "nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "MAE 207",
  "title": "Topics in Engineering Science",
  "unit": "4",
  "description": "A course to be given at the discretion of the faculty in which topics of current interest in engineering will be presented.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 208",
  "title": "Mathematics for Engineers",
  "unit": "4",
  "description": "This course will reintroduce the mathematics fundamentals necessary for success in the engineering graduate program in MAE. Topics will include calculus, ODE’s, vector calculus, linear algebra, probability and PDE’s.",
  "prerequisite": "nongraduate students can enroll with consent of instructor."
 },
 {
  "code": "MAE 209",
  "title": "Continuum Mechanics Applied to Medicine/Biology",
  "unit": "4",
  "description": "(Cross-listed with BENG 209.) Introduction to the basic definitions of continuum mechanics and their mathematical formulation at the graduate level with applications to problems in medicine and biology. This course is intended for students with little or no background in mechanics; it is an introduction to the Biomechanics courses BENG 250 A-B in the Department of Bioengineering and to Solid and Fluid Mechanics courses MAE 210A and MAE 231A in the Department of Mechanical and Aerospace Engineering. This course should NOT be taken concurrently with MAE 210A or MAE 231A.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 210A",
  "title": "Fluid Mechanics I",
  "unit": "4",
  "description": "(Cross-listed with CENG 210A.) Basic conservation laws. Flow kinematics. The Navier-Stokes equations and some of its exact solutions. Nondimensional parameters and different flow regimes, vorticity dynamics.",
  "prerequisite": null
 },
 {
  "code": "MAE 210B",
  "title": "Fluid Mechanics II",
  "unit": "4",
  "description": "Potential flows, boundary layers, low-Reynolds number flows.",
  "prerequisite": "BENG 209 or MAE 209 or MAE 210A; MAE 101A and B; and MAE 110A, or consent of instructor."
 },
 {
  "code": "MAE 210C",
  "title": "Fluid Mechanics III",
  "unit": "4",
  "description": "Flow instabilities, linear stability theory; introduction to turbulent flows.",
  "prerequisite": "MAE 210A-B or consent of instructor."
 },
 {
  "code": "MAE 211",
  "title": "Introduction to Combustion",
  "unit": "4",
  "description": "Fundamental aspects of flows of reactive gases, with emphasis on processes of combustion, including the relevant thermodynamics, chemical kinetics, fluid mechanics, and transport processes. Topics may include deflagrations, detonations, diffusion flames, ignition, extinction, and propellant combustion.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 212",
  "title": "Introductory Compressible Flow",
  "unit": "4",
  "description": "Equations of motion for compressible fluids; one-dimensional gas dynamics and wave motion, waves in supersonic flow, including oblique shock waves; flow in ducts, nozzles, and wind tunnels; methods of characteristics. Nongraduate students may enroll with consent of instructor.",
  "prerequisite": null
 },
 {
  "code": "MAE 213",
  "title": "Mechanics of Propulsion",
  "unit": "4",
  "description": "Fluid mechanics, thermodynamics and combustion processes involved in propulsion of aircraft and rockets by air breathing engines, and solid and liquid propellant rocket engines characteristics and matching of engine components; diffusers, compressors, combustors, turbines, pumps, nozzles.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 214A",
  "title": "Introduction to Turbulence and Turbulent Mixing",
  "unit": "4",
  "description": "Basic features of turbulent flows. Analytical description of turbulence: random variables, correlations, spectra, Reynolds-averaging, coherent structures. Length and time scales. Kolomogorov similarity theory. Turbulence transport equations. Free shear flows. Homogeneous turbulence. Wall-bounded flows. Mixing of velocity and scalar fields.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 217A",
  "title": "Introduction to Gas Discharge Plasma Physics",
  "unit": "4",
  "description": "Charged particle motion in electromagnetic field, atomic processes in plasmas, electric breakdown of the gases, plasma quasi-neutrality, sheath, probes. Electron kinetics in low-temperature plasma, particle and energy fluxes, DC and RF driven discharges, instabilities of gas discharge plasmas.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 217B",
  "title": "Introduction to Nonmagnetized Hot Plasma Physics",
  "unit": "4",
  "description": "Coulomb collisions, collisionless approximation for hot plasma dynamics, Vlasov equation, waves in nonmagnetized plasma, dispersion equation, WKB approximation, Landau dumping, plasma instabilities, quasi-linear theory.",
  "prerequisite": "MAE 217A or consent of instructor."
 },
 {
  "code": "MAE 217C",
  "title": "Introduction to Magnetized Hot Plasma Physics",
  "unit": "4",
  "description": "Drifts of magnetized charged particles, charged particle motion in different magnetic configurations, toroidal plasma equilibrium, Grad-Shafranov equation, neoclassical plasma transport in tokamak, waves in homogeneous magnetized plasma, waves in inhomogeneous magnetized plasma, instabilities of magnetized plasma.",
  "prerequisite": "MAE 217A and B, or consent of instructor."
 },
 {
  "code": "MAE 218A",
  "title": "Introduction to High Energy Density Physics (MHD and Pinches)",
  "unit": "4",
  "description": "Equation of state, Saha equilibrium. Shock rarefaction, and blast waves, self- similar motion. Rayleigh-Taylor, Kelvin-Helmholtz, and Richtmyer-Meshkov instabilities. Z-pinch, Bennett equilibrium, radiation collapse, and radiation sources.",
  "prerequisite": "MAE 217A, B, and C, or consent of instructor."
 },
 {
  "code": "MAE 220A",
  "title": "Physics of Gases",
  "unit": "4",
  "description": "Thermodynamics of gases for use in gas dynamics. Derivation of thermodynamic functions from statistical mechanics. Applications of classical and quantum statistical mechanics to chemical, thermal, and radiative properties of gases. Equilibrium and nonequilibrium radiation, chemical equilibrium, and elements of chemical kinetics. Laser and reacting-flow applications.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 220B",
  "title": "Physical Gas Dynamics",
  "unit": "4",
  "description": "Velocity distribution functions, the Boltzmann equation, moment equations and the Navier-Stokes equations. The dynamics of molecular collisions. The Chapman-Enskog expansion and transport coefficients: shear and bulk viscosity, heat conduction, molecular and thermal diffusion. Linearizations about equilibrium: applications to acoustics and supersonic flows with relaxation.",
  "prerequisite": "MAE 220A and graduate standing."
 },
 {
  "code": "MAE 221A",
  "title": "Heat Transfer",
  "unit": "4",
  "description": "(Cross-listed with CENG 221A.) Conduction, convection, and radiation heat transfer. Development of energy conservation equations. Analytical and numerical solutions to transport problems. Specific topics and applications vary.",
  "prerequisite": "MAE 101A-B-C (or CENG 101A-B-C) or consent of instructor."
 },
 {
  "code": "MAE 221B",
  "title": "Mass Transfer",
  "unit": "4",
  "description": "(Cross-listed with CENG 221B.) Fundamentals of diffusive and convective mass transfer and mass transfer with chemical reaction. Development of mass conservation equations. Analytical and numerical solutions to mass transport problems. Specific topics and applications will vary.",
  "prerequisite": "MAE 101A-B-C (or CENG 101A-B-C), or consent of instructor."
 },
 {
  "code": "MAE 224A",
  "title": "Environmental Fluid Dynamics I",
  "unit": "4",
  "description": "Basics of stratified flows. Linear waves: surface waves, internal gravity waves, dispersion, reflection, mountain waves. Ray tracing. Gravity currents and intrusions. Hydraulic control. Stability of and mixing in stratified shear flows. Recommended preparation: MAE 210A.",
  "prerequisite": null
 },
 {
  "code": "MAE 224B",
  "title": "Environmental Fluid Dynamics II",
  "unit": "4",
  "description": "Plumes and thermals. Application to building ventilation. Basics of rotating flows. Geostrophic flow. Thermal wind balance. Ekman boundary layer. Shallow water equations. Normal modes of a stratified fluid. Potential vorticity. Waves in a rotating fluid. Recommended preparation: MAE 210A.",
  "prerequisite": "MAE 224A or consent of instructor."
 },
 {
  "code": "MAE 228",
  "title": "Selected Topics in Plasma Physics",
  "unit": "4",
  "description": "Collisionless magnetic reconnection, interactions of relativistic laser field with plasma, plasma in astrophysics, computational plasma physics.",
  "prerequisite": "MAE 217A-B-C or consent of instructor."
 },
 {
  "code": "MAE 231A",
  "title": "Foundations of Solid Mechanics",
  "unit": "4",
  "description": "Specification of stress and strain; infinitesimal and finite deformation; conservation equations; typical constitutive equations; minimum potential energy principle.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 231B",
  "title": "Elasticity",
  "unit": "4",
  "description": "Basic field equations. Typical boundary value problems of classical linear elasticity. Problems of plane stress and plane strain. Variational principles.",
  "prerequisite": "MAE 209/BENG 209, or MAE 231A, or consent of instructor."
 },
 {
  "code": "MAE 231C",
  "title": "Inelasticity",
  "unit": "4",
  "description": "(Cross-listed with SE 273.) Overview of inelastic behavior of materials. Models of plasticity, viscoplasticity, viscoelasticity. Micromechanics and modeling of damage. Fatigue phenomena. Fracture mechanics. Processes and models of the failure of materials. Students may not receive credit for both SE 273 and MAE 231C.",
  "prerequisite": "graduate standing and MAE 231A and 231B, or SE 271 and 272, or consent of instructor."
 },
 {
  "code": "MAE 232A",
  "title": "Finite Element Methods in Solid Mechanics I",
  "unit": "4",
  "description": "(Cross-listed with SE 276A.) Finite element methods for linear problems in solid mechanics. Emphasis on the principle of virtual work, finite element stiffness matrices, various finite element formulations and their accuracy, and the numerical implementation required to solve problems in small strain, isotropic elasticity in solid mechanics.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 232B",
  "title": "Finite Element Methods in Solid Mechanics II",
  "unit": "4",
  "description": "(Cross-listed with SE 276B.) Finite element methods for linear problems in structural dynamics. Beam, plate, and doubly curved shell elements are derived. Strategies for eliminating shear locking problems are introduced. Formulation and numerical solution of the equations of motion for structural dynamics are introduced and the effect of different mass matrix formulations on the solution accuracy is explored.",
  "prerequisite": "graduate standing and MAE 232A or SE 276A."
 },
 {
  "code": "MAE 232C",
  "title": "Finite Element Methods in Solid Mechanics III",
  "unit": "4",
  "description": "(Cross-listed with SE 276C.) Finite element methods for problems with both material and geometrical (large deformations) nonlinearities. The total LaGrangian and the updated LaGrangian formulations are introduced. Basic solution methods for the nonlinear equations are developed and applied to problems in plasticity and hyperelasticity.",
  "prerequisite": "graduate standing and MAE 232B or SE 276B."
 },
 {
  "code": "MAE 233A",
  "title": "Fracture Mechanics",
  "unit": "4",
  "description": "Theoretical strength; stress concentration. Linear and nonlinear fracture mechanics: stress singularity, fracture modes, crack tip plastic zone, dugdale model, the R-curve; power-law materials, the J-integral; fatigue; special topics.",
  "prerequisite": "MAE 231A, MAE 231B, or consent of instructor."
 },
 {
  "code": "MAE 233B",
  "title": "Micromechanics",
  "unit": "4",
  "description": "General theory of transformation strains and corresponding elastic fields; Green's functions and other solution methods; dislocations; inclusions and inhomogeneities; micromechanics of plastic flow, microcracking, cavitation, and damage in crystalline and other solids.",
  "prerequisite": "MAE 231A-B-C or consent of instructor."
 },
 {
  "code": "MAE 235",
  "title": "Computational Techniques in Finite Elements",
  "unit": "4",
  "description": "(Cross-listed with SE 255.) Practical application of the finite element method to problems in solid mechanics. Elements of theory are presented as needed. Covered are static and dynamic heat transfer and stress analysis. Basic processing, solution methods, and postprocessing are practiced with commercial finite element software. Students may not receive credit for SE 233 and MAE 235.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 238",
  "title": "Stress Waves in Solids",
  "unit": "4",
  "description": "Linear wave propagation; plane waves; reflection and refraction; dispersion induced by geometry and by material properties. Application of integral transform methods. Selected topics in nonlinear elastic, anelastic, and anisotropic wave propagation.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 242",
  "title": "Robot Motion Planning",
  "unit": "4",
  "description": "Modeling, solving, and analyzing planning problems for single robots or agents. Configuration space for motion planning, sampling-based motion planning, combinatorial motion planning, feedback motion planning, differential models, and nonholonomic constraints. Basic decision-theory and dynamic programming, sensor and information spaces.",
  "prerequisite": null
 },
 {
  "code": "MAE 247",
  "title": "Cooperative Control of Multi-agent Systems",
  "unit": "4",
  "description": "Tools for the design of cooperative control strategies for multi-agent systems are presented. Topics include continuous and discrete-time evolution models, proximity graphs, performance measures, invariance principles, and coordination algorithms for rendezvous, deployment, flocking, formation of autonomous vehicles and consensus.",
  "prerequisite": null
 },
 {
  "code": "MAE 251",
  "title": "Structure and Analysis of Solids",
  "unit": "4",
  "description": "Cross-listed with NANO 227, MATS 227, and CHEM 222.) Key concepts in the atomic structure and bonding of solids such as metals, ceramics, and semiconductors. Symmetry operations, point groups, lattice types, space groups, simple and complex inorganic compounds, structure/property comparisons, structure determination with X-ray diffraction. Ionic, covalent, metallic bonding compared with physical properties. Atomic and molecular orbitals, bands vs. bonds, free electron theory. Students may only receive credit for one of the following: CHEM 222, MAE 251, MATS 227, or NANO 227.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 253",
  "title": "Advanced Ceramics",
  "unit": "4",
  "description": "(Cross-listed with MATS 236.) Topics include phase equilibria and crystallography, defects and thermodynamics (Kröger-Vink notation), glass science, electrical and ionic transport behavior, Brouwer diagrams, powder synthesis and compaction, sintering theory and grain growth, mechanical, optical, magnetic, electrical properties, fuel cells. Students may not receive credit for MATS 236 and MAE 253.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 254",
  "title": "Energy Materials and Applications",
  "unit": "4",
  "description": "(Cross-listed with MATS 256.) This class will cover the fundamentals/engineering aspects of various energy materials based on metallic, ceramic, semiconductor, and chemical structures, and their applications related to solar cells, fuel cells, batteries, fusion energy, and hydrogen storage will be discussed. Students may not receive credit for MATS 256 and MAE 254.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 255",
  "title": "Boundary Layer and Renewable Energy Meteorology",
  "unit": "4",
  "description": "Radiative and convective heat transfer in the atmosphere. Surface energy balance and the urban heat island. Turbulence and dispersion in the atmospheric boundary layer. Solar and wind energy systems, resource assessment, and intermittency.",
  "prerequisite": "MAE 210A or consent of instructor."
 },
 {
  "code": "MAE 256",
  "title": "Radiative Transfer for Energy Applications",
  "unit": "4",
  "description": "Global insolation heat engine; solar-wind coupling; regional/seasonal insolation patterns; atmospheric radiation balance; RTE models; scattering; optical depth and transmittance of cloud layers; Schwarzschild’s equation; absorption/emission lines; rotational, vibrational and electronic transitions; Doppler/pressure broadening; Elsasser/Malkmus/Edwards models; solution methods.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 260",
  "title": "Fundamentals and Applications of Computational Materials Science",
  "unit": "4",
  "description": "(Cross-listed with MATS 260.) Computational methods for MatSci will be discussed, dealing with atomic scale empirical or semiempirical potentials. How and why to develop such potentials for metallic materials will be a focus of the course. Molecular dynamics and Monte Carlo methods will be covered in detail. Applications of these techniques to some example problems in materials science, mechanical deformation, dislocation interactions, nucleation/growth of phases, melting solidification structures, and point defects are presented.",
  "prerequisite": null
 },
 {
  "code": "MAE 261",
  "title": "Cardiovascular Fluid Mechanics",
  "unit": "4",
  "description": "Topics in the mechanics of blood flow including analytical solutions for flow in deformable vessels, one-dimensional equations, cardiovascular anatomy, lumped parameter models, vascular trees, scaling laws, and an introduction to the biomechanics and treatment of adult and congenital cardiovascular diseases.",
  "prerequisite": "MAE 210A and 290A, or consent of instructor."
 },
 {
  "code": "MAE 262",
  "title": "Biological Fluid Mechanics",
  "unit": "4",
  "description": "Fluids phenomena relevant to the function, environment, and dynamics of biological cells. Topics include low-Reynolds number flows, cell motility, internal cellular flows, development and morphogenesis, hydrodynamics of suspensions and polymers, rheology, diffusion, hydrodynamics of deformable bodies (vesicles, membranes, filaments), cells under shear flow.",
  "prerequisite": "MAE 209 or 210A and graduate standing, or consent of instructor."
 },
 {
  "code": "MAE 263",
  "title": "Experimental Methods in Cell Mechanics",
  "unit": "4",
  "description": "Methods to measure mechanical aspects of cellular nature and behavior such as intracellular rheology, intracellular force distribution and propagation, cell adhesion strength, generation of propulsive forces during locomotion, interaction with the extracellular matrix, and response to external mechanical stimuli.",
  "prerequisite": "MAE 209 or MAE 210A, and graduate standing."
 },
 {
  "code": "MAE 264",
  "title": "Mechanics and Thermodynamics of Biological Membranes",
  "unit": "4",
  "description": "This course will introduce the advanced graduate student to the topics of mechanical and thermodynamic analyses of cellular membranes, lipid bilayers, and the study of synthetic vesicles.",
  "prerequisite": "MAE 209 and graduate standing, or consent of instructor."
 },
 {
  "code": "MAE 265A",
  "title": "Electronic and Photonic Properties of Materials",
  "unit": "4",
  "description": "(Cross-listed with MATS 251A.) The electronic and optical properties of metals, semiconductors, and insulators. The concept of the band structure. Electronic and lattice conductivity. Type I and Type II superconductivity. Optical engineering using photonic band gap crystals in one-, two-, and three- dimensions. Current research frontiers. Students may not receive credit for MATS 251A and MAE 265A.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 265B",
  "title": "Magnetic Materials: Principles and Applications",
  "unit": "4",
  "description": "(Cross-listed with MATS 251B and NANO 251A and ECE 221.) The basis of magnetism: Classical and quantum mechanical points of view. Different kinds of magnetic materials. Magnetic phenomena including anisotropy, magnetostriction, domains, and magnetization dynamics. Current frontiers of nanomagnetics research including thin films and particles. Optical, data storage, and biomedical engineering applications of soft and hard magnetic materials. Letter grades only. Students may not receive credit for ECE 221 and MAE 265B and MATS 251B and NANO 251A.",
  "prerequisite": "graduate standing; consent of instructor."
 },
 {
  "code": "MAE 266",
  "title": "Biomaterials",
  "unit": "4",
  "description": "(Cross-listed with MATS 252.) This class will cover biomaterials and biomimetic materials. Metal, ceramic, and polymer biomaterials will be discussed. Emphasis will be on the structure-property relationships, biocompatibility/degradation issues and tissue/material interactions. Synthesis and mechanical testing of biomimetic materials will also be discussed.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 267",
  "title": "Nanomaterials and Properties",
  "unit": "4",
  "description": "(Cross-listed with MATS 253.) This course discusses synthesis techniques, processing, microstructural control and unique physical properties of materials in nanodimensions. Topics include nanowires, quantum dots, thin films, electrical transport, electron emission properties, optical behavior, mechanical behavior, and technical applications of nanomaterials.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 271A",
  "title": "Thermodynamics of Solids",
  "unit": "4",
  "description": "(Cross-listed with NANO 265, MATS 201A and ECE 238A.) The thermodynamics and statistical mechanics of solids. Basic concepts, equilibrium properties of alloy systems, thermodynamic information from phase diagrams, surfaces and interfaces, crystalline defects.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 271B",
  "title": "Solid State Diffusion and Reaction Kinetics",
  "unit": "4",
  "description": "(Cross-listed with MATS 201B.) Thermally activated processes, Boltzmann factor, homogenous and heterogeneous reactions, solid state diffusion, Fick's laws, diffusion mechanisms, Kirkendall effect, Boltzmann-Matano analysis, high diffusivity paths.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 271C",
  "title": "Phase Transformations",
  "unit": "4",
  "description": "(Cross-listed with MATS 201C and ECE 238C.) Classification of phase transformations; displacive and reconstructive transformations; classical and nonclassical theories of nucleation; Becker-Doering, Volmer-Weber, lattice instabilities, spinodal decomposition. Growth theories; interface migration, stress effects, terrace-ledge mechanisms, epitaxial growth, kinetics and mechanics. Precipitation. Order-disorder transformations. Solidification. Amorphization.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 272",
  "title": "Imperfections in Solids",
  "unit": "4",
  "description": "(Cross-listed with MATS 205A.) Point, line, and planar defects in crystalline solids, including vacancies, self interstitials, solute atoms, dislocations, stacking faults, and grain boundaries; effects of imperfections on mechanical properties; interactions of dislocations with point defects; strain hardening by micro-obstacles, precipitation, and alloying elements.",
  "prerequisite": null
 },
 {
  "code": "MAE 273A",
  "title": "Dynamic Behavior of Materials",
  "unit": "4",
  "description": "(Cross-listed with MATS 213A.) Elastic waves in continuum; longitudinal and shear waves. Surface waves. Plastic waves; shock waves, Rankine-Hugoniot relations. Method of characteristics, differential and difference form of conservation equations; dynamic plasticity and dynamic fracture. Shock wave reflection and interaction.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 276",
  "title": "Mechanics of Soft Materials",
  "unit": "4",
  "description": "(Cross-listed with MATS 231.) Main focus is the large deformations and instabilities in soft materials, such as elastomers, gels, and biomaterials. Some contents in thermodynamics and finite deformation theory are reviewed and summarized. Fundamental theories are applied to study the mechanics of gels, electroactive polymers, and biomaterials. This course intends to use soft material as an example to illustrate how to study the interaction between mechanics and other fields in materials (e.g., electric field, chemical field). Students may not receive credit for both MAE 276 and MATS 231.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "MAE 277A",
  "title": "Complexity and Large-Scale Systems",
  "unit": "4",
  "description": "(Cross-listed with AESE 278A, CSE 278A, and ECE 205.) Comprehensive introduction to system and event complexity, software and systems engineering practices for complexity management, agile and plan-driven development, development and management processes and process models, data-, information- and knowledge-management, basics of distributed data and computation. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS-AESE or consent of instructor."
 },
 {
  "code": "MAE 278A",
  "title": "Modeling, Simulation, and Analysis",
  "unit": "4",
  "description": "(Cross-listed with AESE 278C, CSE 278C, and ECE 206.) Model-driven architecture and development concepts, business process and workflow modeling, structured analysis and IDEF modeling methods, object-, component- and service-orientation and the Unified Modeling Language, event- and stream models, colored Petri Nets, executable architectures, distributed simulation for performance analysis. This course will meet from 8:00 a.m. to 5:00 p.m. every alternating Friday and Saturday.",
  "prerequisite": "enrollment in MAS- AESE or consent of instructor."
 },
 {
  "code": "MAE 280A",
  "title": "Linear Systems Theory",
  "unit": "4",
  "description": "Linear algebra: inner products, outer products, vector norms, matrix norms, least squares problems, Jordan forms, coordinate transformations, positive definite matrices, etc. Properties of linear dynamic systems described by ODEs: observability, controllability, detectability, stabilizability, trackability, optimality. Control systems design: state estimation, pole assignment, linear quadratic control.",
  "prerequisite": null
 },
 {
  "code": "MAE 280B",
  "title": "Linear Control Design",
  "unit": "4",
  "description": "Parameterization of all stabilizing output feedback controllers, covariance controllers, H-infinity controllers, and L-2 to L-infinity controllers. Continuous and discrete-time treatment. Alternating projection algorithms for solving output feedback problems. Model reduction. All control design problems reduced to one critical theorem in linear algebra.",
  "prerequisite": "MAE 280A."
 },
 {
  "code": "MAE 281A",
  "title": "Nonlinear Systems",
  "unit": "4",
  "description": "Existence and uniqueness of solutions of EDE's, sensitivity equations. Stability, direct and converse Lyapunov theorems, LaSalle's theorem, linearization, invariance theorems. Center manifold theorem. Stability of perturbed systems with vanishing and nonvanishing perturbations, input-to- state ability, comparison method. Input-output stability. Perturbation theory and averaging. Singular perturbations. Circle and Popov criteria.",
  "prerequisite": "MAE 280A."
 },
 {
  "code": "MAE 281B",
  "title": "Nonlinear Control",
  "unit": "4",
  "description": "Small gain theorem, passivity. Describing functions. Nonlinear controllability, feedback linearization, input-state and input-output linearization, zero dynamics. Stabilization, Brockett's necessary conditions (local), control Lyapunov functions, Sontag's formula (global). Integrator back stepping, forwarding. Inverse optimality, stability margins. Disturbance attenuation, deterministic and stochastic, nonlinear H-infinity. Nonlinear observers.",
  "prerequisite": "MAE 281A."
 },
 {
  "code": "MAE 283A",
  "title": "Parametric Identification: Theory and Methods",
  "unit": "4",
  "description": "Constructing dynamical models from experimental data. Deterministic and stochastic discrete time signals. Discrete time systems. Nonparametric identification: correlation and spectral analysis. Parametric identification: realization and prediction error methods, least squares estimation, approximate modeling. Experiment design. Frequency domain identification. Recommended preparation: MAE 143C.",
  "prerequisite": null
 },
 {
  "code": "MAE 283B",
  "title": "Approximate Identification and Control",
  "unit": "4",
  "description": "Identification for control: approximate identification, estimation of models via closed-loop experiments. Closed-loop identification techniques. Estimation of model uncertainty. Model invalidation techniques. Iterative techniques for model estimation and control design.",
  "prerequisite": "MAE 283A."
 },
 {
  "code": "MAE 284",
  "title": "Robust and Multivariable Control",
  "unit": "4",
  "description": "Multivariable feedback systems: transfer function matrices, Smith-McMillan form, poles, zeros, principal gains, operator norms, limits on performance. Model uncertainties, stability and performance robustness. Design of robust controllers, H_inf and mu synthesis. Controller reduction.",
  "prerequisite": "MAE 141B or MAE 280A."
 },
 {
  "code": "MAE 285",
  "title": "Design of Micro/Nanoacoustofluidic Devices",
  "unit": "4",
  "description": "Acoustofluidics is a burgeoning field reliant on high frequency acoustics and underpinning many new developments and devices at micro to nano scales. First the basics, piezoelectricity, microfluidics, acoustics, and device metrology. Then, new physics arising from the unusually large accelerations (10^7 to 10^9 m/s^2) induced by acoustic waves. Finally, how various phenomena of acoustofluidics at small scales can be used in designing practical devices.",
  "prerequisite": "MAE 210A or CENG 210A, and MAE 210B, graduate standing, or consent of instructor. ****"
 },
 {
  "code": "MAE 286",
  "title": "Hybrid Systems",
  "unit": "4",
  "description": "Definition of hybrid system. Examples in mechanics, vision, and multi-agent systems. Trajectories of hybrid systems. Chattering, Zeno phenomena. Stability analysis. Arbitrary switching: common Lyapunov functions. Slow switching: dwell time. State-dependent switching: multiple Lyapunov functions, Invariance Principle. Hybrid control design. Applications.",
  "prerequisite": "MAE 281A or consent of instructor."
 },
 {
  "code": "MAE 287",
  "title": "Control of Distributed Parameter Systems",
  "unit": "4",
  "description": "Lyapunov stability; exact solutions to PDEs; boundary control of parabolic PDEs (reaction-advection-diffusion and other equations); boundary observer design; control of complex-valued PDEs (Schrodinger and Gunzburg-Landau equations); boundary control of hyperbolic PDEs (wave equations) and beam equations; control of first-order hyperbolic PDEs and delay equations; control of Navier-Stokes equations; motion planning for PDEs; elements of adaptive control for PDEs and control of nonlinear PDEs.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 288A",
  "title": "Optimal Control",
  "unit": "4",
  "description": "Deterministic methods: Pontryagin's Maximum Principle, dynamic programming, calculus of variations. Stochastic methods: Gauss-Markov processes, Linear Quadratic control, Markov chains. Linear Quadratic Gaussian Control and the Separation Principle.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 288B",
  "title": "Optimal Estimation",
  "unit": "4",
  "description": "Least Squares and Maximum Likelihood Estimation methods, Gauss-Markov models, State Estimation and Kalman Filtering, prediction and smoothing. The extended Kalman filter.",
  "prerequisite": "MAE 280A completed or concurrent, or consent of instructor."
 },
 {
  "code": "MAE 289A",
  "title": "Mathematical Analysis for Applications",
  "unit": "4",
  "description": "Topics in mathematical analysis, with the emphasis on those of use in applications. The topics may include metric spaces, open and closed sets, compact sets, continuity, differentiation, series of functions and uniform convergence, convex sets and functions, transforms, and Stokes theorem.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 289B",
  "title": "Real Analysis for Applications",
  "unit": "4",
  "description": "Topics in real analysis, with the emphasis on those of use in applications. May include countable/uncountable, open and closed sets, topology, Borel sets, sigma algebras, measurable functions, integration (Lebesgue), absolute continuity, function spaces, and fixed-point theorems.",
  "prerequisite": "MAE 289A, graduate standing, or consent of instructor."
 },
 {
  "code": "MAE 289C",
  "title": "Functional Analysis and Applications",
  "unit": "4",
  "description": "Topics in functional analysis, with the emphasis on those of use in applications. May include function spaces, linear functionals, dual spaces, reflexivity, linear operators, strong and weak convergence, Hahn-Banach Theorem, nonlinear functionals, differential calculus of variations, Pontryagin Maximum Principle. Students cannot obtain credit for MAE 289C if they have taken MAE 289.",
  "prerequisite": "MAE 289B, graduate standing, or consent of instructor."
 },
 {
  "code": "MAE 290A",
  "title": "Numerical Methods for Linear Algebra and ODE Simulation",
  "unit": "4",
  "description": "Fundamental matrix decompositions: LU, QR, Eigen, Schur, Jordan, SVD. Exploiting sparsity, finding parallelism, minimizing storage. Pseudoinverses. Finite differences, adaptive integration. Stability and accuracy of Runge- Kutta and linear multistep methods for marching ODEs. Low-storage IMEXRK methods.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "MAE 290B",
  "title": "Numerical Methods for Differential Equations",
  "unit": "4",
  "description": "Numerical solution of differential equations in mathematical physics and engineering, ordinary and partial differential equations. Linear and nonlinear hyperbolic parabolic, and elliptic equations, with emphasis on prototypical cases, the convection-diffusion equation, Laplace's and Poisson equation. Finite difference methods.",
  "prerequisite": "MAE 290A or consent of instructor."
 },
 {
  "code": "MAE 290C",
  "title": "Computational Fluid Dynamics",
  "unit": "4",
  "description": "Numerical methods in fluid dynamics and convective transport processes. Numerical solution of the Euler and Navier-Stokes equation. Additional topics will vary according to instructor. Examples include eigenvalue problems in hydrodynamic stability, vortex methods, spectral and panel methods. Students may not receive credit for both MAE 290C and MAE 223.",
  "prerequisite": "MAE 210A-B, 290A-B."
 },
 {
  "code": "MAE 291",
  "title": "Design and Mechanics in Computer Technology",
  "unit": "4",
  "description": "Design and mechanics problems inherent in computer peripherals such as disk files, tape drives, and printers. Formulation and solution of problems involving mechanics, fluid mechanics, and materials; Reynolds equation, slider bearings; friction and wear; actuator design, impact printing; silicon fluid jets.",
  "prerequisite": "consent of instructor. (Not offered every year.)"
 },
 {
  "code": "MAE 292",
  "title": "Computer-Aided Design and Analysis",
  "unit": "4",
  "description": "Introduction to 2-D and 3-D computer-aided design. Design problems may include: ball bearing kinematics, Weibull statistics, nonrepeatable spindle run-out, four bar linkages, beam deflection and vibration, design of magnetic head suspension, hydrodynamic theory of lubrication, air bearings, heat transfer, optical servo, design of ink jet print head.",
  "prerequisite": "consent of instructor. (Not offered every year.)"
 },
 {
  "code": "MAE 293",
  "title": "Flow Control",
  "unit": "4",
  "description": "Intersection of control theory and fluid mechanics. Applications: transition delay, turbulence mitigation, noise reduction, weather forecasting, shape optimization, and UAV's (perching). Tractable feedback (Riccati-based) formulations via parallel and parabolic flow assumptions. Regularization of variational (adjoint-based) formulations for MPC and MHE. EnKF and EnVE approaches for forecasting.",
  "prerequisite": "MAE 290A or consent of instructor."
 },
 {
  "code": "MAE 294A",
  "title": "Introduction to Applied Mathematics",
  "unit": "4",
  "description": "(Cross-listed with SIO 203A.) Review of exact methods for ordinary differential equations. Expansions about regular and irregular singular points. Introduction to asymptotic expansions. Approximate methods for nonlinear differential equations. Regular and singular perturbation theory. Additional topics depending upon the interests of the instructor.",
  "prerequisite": null
 },
 {
  "code": "MAE 294B",
  "title": "Introduction to Applied Mathematics II",
  "unit": "4",
  "description": "(Cross-listed with SIO 203B.) Asymptotic methods: method of steepest descent (if not covered in I) WKB, method of multiple scales, boundary layer theory. Elements of complex analysis.",
  "prerequisite": "MAE 294A or SIO 203A or consent of instructor."
 },
 {
  "code": "MAE 294C",
  "title": "Introduction to Applied Mathematics III",
  "unit": "4",
  "description": "(Cross-listed with SIO 203C.) Partial differential equations: characteristics, similarity solutions, Green's functions, images, wave equation, diffusion equation, Laplace's equation. Applications to continuum mechanics, potential fields, and transport phenomena such as diffusion, linear and nonlinear waves, Burger's equation and shocks. Other topics according to the interests of the instructor.",
  "prerequisite": "MAE 294B, or SIO 203B, or SIO 215B, or consent of instructor."
 },
 {
  "code": "MAE 295",
  "title": "Field Study",
  "unit": "1-12",
  "description": "Provides field study in industry with faculty supervision. Analysis and problem solving using real world applications.",
  "prerequisite": "consent of adviser and department; 3.0 GPA."
 },
 {
  "code": "MAE 296",
  "title": "Independent Study",
  "unit": "1-4",
  "description": "Independent reading or research on a problem as arranged by a designated faculty member. Must be taken for a letter grade only.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MAE 298",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Directed group study on a topic or in a field not included in regular department curriculum, by special arrangement with a faculty member.",
  "prerequisite": "consent of instructor. (S/U grades permitted.)"
 },
 {
  "code": "MAE 299",
  "title": "Graduate Research",
  "unit": "1-12",
  "description": "Independent work by graduate students engaged in research and writing theses. MAE graduate students only. (S/U grades only.)",
  "prerequisite": null
 },
 {
  "code": "MAE 501",
  "title": "Teaching Experience",
  "unit": "2",
  "description": "Teaching experience in an appropriate MAE undergraduate course under direction of the faculty member in charge of the course. Lecturing one hour per week in either a problem-solving section or regular lecture. (S/U grade only.)",
  "prerequisite": "consent of instructor and the MAE department."
 },
 {
  "code": "MDE 209",
  "title": "Mechanics and Transport Phenomena for Biomedical Device Design",
  "unit": "4",
  "description": "Introduction to the basic definitions of continuum mechanics and their mathematical formulation at the graduate level with applications to problems in medicine and biology.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 210",
  "title": "Medical Devices: Clinical Perspectives",
  "unit": "4",
  "description": "This course is a seminar series with invited clinician speakers intended to address needs and opportunities for meaningful application of engineering principles in clinical practice, with emphasis on next generation medical devices.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 225A",
  "title": "Biobusiness: Small to Large I",
  "unit": "2",
  "description": "First in a two-quarter series focusing on early stages of a business plan. Biotech is a special breed of business, especially in the start-up and early phases. You will study and analyze (1) start-up proposals, (2) the genesis of the biotech industry, (3) biotech categories and growth strategies, (4) the process of spinning out viable product concepts from academia, (5) financing techniques, (6) business development, (7) acquisition/IPO valuation methods, and (8) potentially disruptive technologies. Students may not receive credit for both MDE 225 and MDE 225A.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 225B",
  "title": "Biobusiness: Small to Large II",
  "unit": "2",
  "description": "Second in a two-quarter series focusing on finalizing and completing a business plan. In this course, you will study and analyze (1) start-up proposals, (2) the genesis of the biotech industry, (3) biotech categories and growth strategies, (4) the process of spinning out viable product concepts from academia, (5) financing techniques, (6) business development, (7) acquisition/IPO valuation methods, and (8) potentially disruptive technologies to finalize your business plan. Students may not receive credit for both MDE 225 and MDE 225B.",
  "prerequisite": "MDE 225A. MDE students only."
 },
 {
  "code": "MDE 230",
  "title": "Life Sciences and Technologies",
  "unit": "4",
  "description": "A general survey of modern high-throughput instruments used for imaging and analyzing structure-function relationships at the molecular and cellular levels. An overview of potential human genomic and systems approaches for designing and validating medical device safety and performance.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 231A",
  "title": "Fundamentals of Physiology and Anatomy I",
  "unit": "2",
  "description": "A basic introduction to human physiology and anatomy form and function as it relates to clinical perspectives on patient needs. Students may not receive credit for both MDE 231A and MDE 231.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 231B",
  "title": "Fundamentals of Physiology and Anatomy II",
  "unit": "2",
  "description": "Case studies of integrative physiology to understand how this information is used in designing combination medical devices and instruments for diagnosis or research. Students may not receive credit for both MDE 231A and MDE 231.",
  "prerequisite": "MDE 231A. MDE students only."
 },
 {
  "code": "MDE 240",
  "title": "Embedded System Design",
  "unit": "4",
  "description": "This course gives an introduction to digital signal processing (DSP) techniques and data-based parameter estimation (DBPE) techniques for the measurement, filtering, and analysis of experimental data obtained with embedded systems in medical devices.",
  "prerequisite": "consent of instructor. MDE students only."
 },
 {
  "code": "MDE 260A",
  "title": "Design and Implementation of Medical Device Technology I",
  "unit": "1",
  "description": "Introduction of project-based course in medical device engineering, medical product regulation, quality systems and standards, engineering project management, and business development.",
  "prerequisite": "MDE students only."
 },
 {
  "code": "MDE 260B",
  "title": "Design and Implementation of Medical Device Technology II",
  "unit": "2",
  "description": "Second of a three-quarter sequence, project-based course in medical device engineering, medical product regulation, quality systems and standards, engineering project management, and business development. Students will begin to design a medical device and an engineering strategy.",
  "prerequisite": "MDE 260A and consent of instructor. MDE students only."
 },
 {
  "code": "MDE 260C",
  "title": "Design and Implementation of Medical Device Technology III",
  "unit": "1",
  "description": "Third of a three-quarter sequence, project-based course in medical device engineering, medical product regulation, quality systems and standards, engineering project management, and business development. Students will complete and implement their medical device design and engineering strategy.",
  "prerequisite": "MDE 260B and consent of instructor. MDE students only."
 },
 {
  "code": "MDE 266",
  "title": "Biomaterials for Medical Device Design",
  "unit": "4",
  "description": "This class will cover biomaterials and biomimetic materials. Metal, ceramic, and polymer biomaterials will be discussed. Emphasis will be on the structure- property relationships, biocompatibility/degradation issues, and tissue/material interactions. Synthesis and mechanical testing of biomimetic materials will also be discussed.",
  "prerequisite": "consent of instructor. MDE students only."
 },
 {
  "code": "MDE 292",
  "title": "Computer Aided Design of Medical Devices",
  "unit": "4",
  "description": "Computer-aided analysis and design with applications to medical devices. Solid model representation, finite element analysis for strength and deformation, material selection, kinematics, statistical analysis, and visualization of analytical results. Software packages used will include 3-D CAD, FEA solvers, and student generated code. Analytical methods will be applied to case studies of medical devices.",
  "prerequisite": "MDE students only."
 }
]