[
 {
  "code": "MATS 200",
  "title": "Graduate Seminar",
  "unit": "0",
  "discription": "Each graduate student in the Materials Science and Engineering Program is expected to attend a weekly seminar in materials science or related areas. MS students must enroll for three quarters, PhD students for six quarters. (S/U grades only.)",
  "prerequsite": null
 },
 {
  "code": "MATS 201A",
  "title": "Thermodynamics of Solids",
  "unit": "4",
  "discription": "The thermodynamics and statistical mechanics of solids. Basic concepts; equilibrium properties of alloy systems; thermodynamic information from phase diagrams, surfaces, and interfaces; crystalline defects.",
  "prerequsite": "consent of instructor. (Cross-listed with ECE 238A, MAE 271A, NANO 265.)"
 },
 {
  "code": "MATS 201B",
  "title": "Solid State Diffusion and Reaction Kinetics",
  "unit": "4",
  "discription": "Thermally activated processes, Boltzmann factor, homogeneous and heterogeneous reactions, solid state diffusion, Fick's laws, diffusion mechanisms, Kirkendall effect, Boltzman-Matano analysis, high diffusivity paths.",
  "prerequsite": "consent of instructor. (Cross-listed with ECE 238B, MAE 271B.)"
 },
 {
  "code": "MATS 201C",
  "title": "Phase Transformations",
  "unit": "4",
  "discription": "Classification of phase transformations: displacive and reconstructive transformations: classical and nonclassical theories of nucleation: Becker- Doering, Volmer-Weber, lattice instabilities, spinodal decomposition. Growth theories: interface migration, stress effects, terrace-ledge mechanisms, epitaxial growth, kinetics, and mechanics. Precipitation. Order-disorder transformations. Solidification. Amorphization.",
  "prerequsite": "consent of instructor. (Cross-listed with MAE 271C.)"
 },
 {
  "code": "MATS 205A",
  "title": "Imperfections in Solids",
  "unit": "4",
  "discription": "Point, line, and planar defects in crystalline solids, including vacancies, self-interstitials, solute atoms, dislocations, stacking faults, and grain boundaries; effects of imperfections on mechanical properties; interactions of dislocations with point defects; strain hardening by micro-obstacles, precipitation, and alloying elements.",
  "prerequsite": "consent of instructor. (Cross-listed with MAE 272.)"
 },
 {
  "code": "MATS 213A",
  "title": "Dynamic Behavior of Materials I",
  "unit": "4",
  "discription": "Elastic waves in continuum; longitudinal and shear waves. Surface waves. Plastic waves; shock waves; Rankine-Hugoniot relations. Method of characteristics, differential and difference form of conservation equations; dynamic plasticity and dynamic fracture. Shock wave reflection and interaction.",
  "prerequsite": "consent of instructor. (Cross-listed with MAE 273A.)"
 },
 {
  "code": "MATS 227",
  "title": "Structure and Analysis of Solids",
  "unit": "4",
  "discription": "Key concepts in the atomic structure and bonding of solids such as metals, ceramics, and semiconductors. Symmetry operations, point groups, lattice types, space groups, simple and complex inorganic compounds, structure/property comparisons, structure determination with X-ray diffraction. Ionic, covalent, metallic bonding compared with physical properties. Atomic and molecular orbitals, bands verses bonds, free electron theory.",
  "prerequsite": "graduate student or consent of instructor. (Cross- listed with CHEM 222, MAE 251, NANO 227.)"
 },
 {
  "code": "MATS 231",
  "title": "Mechanics of Soft Materials",
  "unit": "4",
  "discription": "Main focus is the large deformations and instabilities in soft materials, such as elastomers, gels, and biomaterials. Some contents in thermodynamics and finite deformation theory are reviewed and summarized. Fundamental theories are applied to study the mechanics of gels, electroactive polymers, and biomaterials. This course intends to use soft material as an example to illustrate how to study the interaction between mechanics and other fields in materials (e.g., electric field, chemical field). ",
  "prerequsite": "graduate standing. (Cross-listed with MAE 276.)"
 },
 {
  "code": "MATS 236",
  "title": "Advanced Ceramic",
  "unit": "4",
  "discription": "Topics include phase equilibria and crystallography, defects and thermodynamics (Kröger-Vink Notation), glass science, electrical and ionic transport behavior, Brouwer diagrams, powder synthesis and compaction, sintering theory and gain growth, mechanical, optical, magnetic, electrical properties, fuel cells.",
  "prerequsite": "graduate standing or consent of instructor. (Cross-listed with MAE 253.)"
 },
 {
  "code": "MATS 251A",
  "title": "Electronic and Photonic Properties of Materials",
  "unit": "4",
  "discription": "The electronic and optical properties of metals, semiconductors, and insulators. The concept of the band structure. Electronic and lattice conductivity. Type I and Type II superconductivity. Optical engineering using photonic band gap crystals in one-, two-, and three-dimensions. Current research frontiers.",
  "prerequsite": "consent of the instructor. (Cross- listed with MAE 265A.)"
 },
 {
  "code": "MATS 251B",
  "title": "Magnetic Materials: Principles and Applications",
  "unit": "4",
  "discription": "The basis of magnetism: classical and quantum mechanical points of view. Different kinds of magnetic materials. Magnetic phenomena including anisotropy, magnetostriction, domains, and magnetization dynamics. Current frontiers of nanomagnetic research including thin films and particles. Optical, data storage, and biomedical engineering applications of soft and hard magnetic materials.",
  "prerequsite": "consent of instructor. (Cross- listed with ECE 221, MAE 265B, NANO 251A.)"
 },
 {
  "code": "MATS 252",
  "title": "Biomaterials and Medical Devices",
  "unit": "4",
  "discription": "This class will cover biomaterials and biomimetic materials. Metal, ceramic, and polymer biomaterials will be discussed. Emphasis will be on the structure- property relationships, biocompatibility/degradation issues and tissue/material interactions. Synthesis and mechanical testing of biomimetic materials will also be discussed.",
  "prerequsite": "consent of instructor. (Cross-listed with MAE 266.)"
 },
 {
  "code": "MATS 253",
  "title": "Nanomaterials and Properties",
  "unit": "4",
  "discription": "This course discusses synthesis techniques, processing, microstructural control, and unique physical properties of materials in nanodimensions. Topics include nanowires, quantum dots, thin films, electrical transport, electron emission properties, optical behavior, mechanical behavior, and technical applications of nanomaterials.",
  "prerequsite": "consent of instructor. (Cross-listed with MAE 267.)"
 },
 {
  "code": "MATS 255",
  "title": "Biomaterials and Biomimetics",
  "unit": "4",
  "discription": "Fundamentals of materials science as applied to bioengineering design. Hierarchical structures. Cells and tissues. Natural and synthetic polymeric materials. Biomineralized materials. Biological composites. Cellular materials (foams). Functional biological materials. Biomaterials and implants. Bioinspired design and materials. (Cross-listed with NANO 252, CENG 256.)",
  "prerequsite": null
 },
 {
  "code": "MATS 256",
  "title": "Energy Materials and Applications",
  "unit": "4",
  "discription": "This class will cover the fundamentals/engineering aspects of various energy materials based on metallic, ceramic, semiconductor; and chemical structures and their applications related to solar cells, fuel cells, batteries, fusion energy, and hydrogen storage will be discussed.",
  "prerequsite": "graduate standing or consent of instructor. (Cross-listed with MAE 254.)"
 },
 {
  "code": "MATS 257",
  "title": "Polymer Science and Engineering",
  "unit": "4",
  "discription": "Quantitative basic understanding of different branches of polymer science varying from polymer chemistry, characterization, thermodynamics, rheological properties, smart materials, self-assembly in biopolymers (natural) and synthetic polymers, and applications of polymers ranging from medicine to structure.",
  "prerequsite": "graduate standing. (Cross-listed with BENG 242, NANO 257.)"
 },
 {
  "code": "MATS 261A",
  "title": "Processing of Polymers and Composites",
  "unit": "4",
  "discription": "Introduction to processing and fabrication methods of polymers and composite materials. Processing techniques; facilities and equipment, material- processing-microstructure interaction, materials selection, form and quality control. Extrusion, injection molding, blow molding, compression molding, thermoforming, casting, foaming. Wet layup; sprayup; autoclave cure, SMC; RTM; resin infusion; winding and fiber placement; pultrusion. Process induced defects and environmental considerations.",
  "prerequsite": "graduate standing. (Cross-listed with SE 251A.)"
 },
 {
  "code": "MATS 261B",
  "title": "Mechanical Behavior of Polymers and Composites",
  "unit": "4",
  "discription": "Material-science oriented course on polymers and composites. Mechanical properties of polymers; micromechanisms of elastic and plastic deformations, fracture, and fatigue of polymers and composites.",
  "prerequsite": "graduate standing. (Cross-listed with SE 251B.)"
 },
 {
  "code": "MATS 295",
  "title": "Research Conference",
  "unit": "2",
  "discription": "Group discussion of research activities and progress of group members.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "MATS 296",
  "title": "Independent Study",
  "unit": "4",
  "discription": "",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "MATS 299",
  "title": "Graduate Research",
  "unit": "1–12",
  "discription": "Subject to the approval of a faculty adviser, students may choose courses offered by departments participating in the Materials Science and Engineering Program. Please see the graduate coordinator for more information.",
  "prerequsite": null
 }
]