[
 {
  "code": "MUIR 1",
  "title": "First Year Experience",
  "unit": "2",
  "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only.",
  "prerequisite": "department approval. Open to incoming Muir College students only."
 },
 {
  "code": "MUIR 2",
  "title": "Transfer Year Experience",
  "unit": "2",
  "description": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only.",
  "prerequisite": "department approval. Open to Muir College transfer students only."
 },
 {
  "code": "MUIR 199",
  "title": "Muir Special Project",
  "unit": "4-16",
  "description": "A course of independent work on a research or creative project to satisfy a Muir graduation requirement. (Only Muir students who have had Muir Special Project proposals approved may enroll in this course.) Students wishing to enroll must submit a written request with a description of the project. (Muir students must submit the Muir Special Project 199 form to the major advisor and to the Office of the Provost by the seventh week of the quarter prior to the quarter in which the 199 is to be undertaken. For information on other requirements, consult the provost's office.)",
  "prerequisite": "upper-division status, approval by project advisor and by provost. (Letter grades only.)"
 },
 {
  "code": "MCWP 40",
  "title": "Critical Writing",
  "unit": "4",
  "description": "First course of sequence in university reading and writing which satisfies the Muir College graduation requirement in writing. Required of all Muir College first-year students and of transfer students who have not completed a comparable course elsewhere. MCWP 40 introduces students to the basic elements of argument and analysis. Students engage in close reading of texts, weekly writing and revision, and individual conferences. Course must be taken for a letter grade. Those who need additional work to prepare for MCWP 50 will be given a grade of IP and will be required to take MCWP 41.",
  "prerequisite": "satisfaction of the UC Entry Level Writing requirement."
 },
 {
  "code": "MCWP 50",
  "title": "Critical Writing",
  "unit": "4",
  "description": "Second course of sequence in reading and writing which satisfies the Muir College graduation requirement in writing. Required of all Muir College first- year students and of transfer students. MCWP 50 focuses on advanced skills of argument and analysis. Students engage in close reading of texts, weekly writing and revision, and individual conferences. Course must be taken for a letter grade.",
  "prerequisite": "satisfaction of MCWP 40 requirement or completion of TAG or IGETC agreement."
 },
 {
  "code": "MCWP 125",
  "title": "Argument and Analysis",
  "unit": "4",
  "description": "An advanced course in argumentation and analysis, with particular attention both to constructing arguments and analyzing the logic and rhetoric of others' arguments. Students will engage in close reading of texts, weekly writing and revision, and individual conferences. A course specially designed for and required of transfer students who enter Muir College under the aegis of TAG or IGETC.",
  "prerequisite": "department approval."
 }
]