[
 {
  "code": "MGT 3",
  "title": "Quantitative Methods in Business",
  "unit": "4",
  "discription": "Introduction to techniques to develop/analyze data for informed tactical and strategic management decisions: statistical inference, probability, regression analysis, and optimization. Using these analytic approaches, theory-based formulas, and spreadsheets, students explore managerial applications across all areas of business activity.",
  "prerequsite": null
 },
 {
  "code": "MGT 4",
  "title": "Financial Accounting",
  "unit": "4",
  "discription": "Cross-listed with ECON 4. Recording, organizing, and communicating financial information to business entities.",
  "prerequsite": null
 },
 {
  "code": "MGT 5",
  "title": "Managerial Accounting",
  "unit": "4",
  "discription": "Internal accounting fundamentals, including cost behavior, cost application methods, overhead allocation methods, break-even analysis, budgeting, cost variance analysis, inventory management, and capital budgeting.",
  "prerequsite": null
 },
 {
  "code": "MGT 12",
  "title": "Personal Financial Management",
  "unit": "4",
  "discription": "Course examines management of personal financial assets: savings and checking accounts, fixed assets, and credit cards. Budgeting, loan applications, payment terms, and statement reconciliation will be covered as will credit ratings, cash management, compound interest, bank operations, and contract obligations.",
  "prerequsite": null
 },
 {
  "code": "MGT 16",
  "title": "Personal Ethics at Work",
  "unit": "4",
  "discription": "Course examines the ethical foundation for choices individuals make every day both in the workplace and in their private lives, the connection between economic and ethical obligations with examples related to privacy, reporting, whistle-blowing, workplace relationships, confidentiality, and intellectual property.",
  "prerequsite": null
 },
 {
  "code": "MGT 18",
  "title": "Managing Diverse Teams",
  "unit": "4",
  "discription": "The modern workplace includes people different in culture, gender, age, language, religion, education, and more. Students will learn why diverse teams make better decisions and are often integral to the success of organizations. Topics include challenges of diversity, and the impact of emotional, social, and cultural intelligence on team success. Content will include significant attention to the experiences of Asian Americans and African Americans as members and leaders of such diverse teams. Students will not receive credit for both MGT 18 and MGT 18GS.",
  "prerequsite": null
 },
 {
  "code": "MGT 18GS",
  "title": "Managing Diverse Teams",
  "unit": "4",
  "discription": "The modern workplace includes people different in culture, gender, age, language, religion, education, and more. Students will learn why diverse teams make better decisions and are often integral to the success of organizations. Topics include challenges of diversity, and the impact of emotional, social, and cultural intelligence on team success. Content will include significant attention to the experiences of Asian Americans and African Americans as members and leaders of such diverse teams. Students must submit applications to the International Center Programs Abroad Office and be accepted into the Global Seminar Program. Students will not receive credit for both MGT 18 and MGT 18GS. Program or materials fees may apply.",
  "prerequsite": null
 },
 {
  "code": "MGT 45",
  "title": "Principles of Accounting",
  "unit": "4",
  "discription": "Covers the principles, methods and applications of general accounting, cost accounting and investment ROI. Development of the three key financial reports and their interrelations, cost identification, product costing, inventory control, operational performance, and investment return",
  "prerequsite": null
 },
 {
  "code": "MGT 52",
  "title": "Test and Measurement in the Workplace",
  "unit": "4",
  "discription": "This course introduces students to the psychometric, legal, ethical, and practical considerations of using tests and measurements for evidence-based decision-making in the workplace. Emphasis is given to selection and performance measurements for individual, team, business unit and organization- wide use in marketing, STEM, and operations. Student teams will develop managerial recommendations following company specific research and analysis.",
  "prerequsite": null
 },
 {
  "code": "MGT 103",
  "title": "Product Marketing and Management",
  "unit": "4",
  "discription": "Defining markets for products and services, segmenting these markets, and targeting critical customers within segments. Strategies to position products and services within segments. The critical role of pricing as well as market research, product management, promotion, selling, and customer support.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 105",
  "title": "Product Promotion and Brand Management",
  "unit": "4",
  "discription": "Principles and decisions to be considered in overall communications and promotion strategy for traditional channels and emerging social networks. Decisions on promotional mix, ad design, implementation and evaluation for establishing brand equity, measure brand performance and sustaining brand equity.",
  "prerequsite": "MGT 103."
 },
 {
  "code": "MGT 106",
  "title": "Sales and Sales Management",
  "unit": "4",
  "discription": "Examines the sales function from strategic competitive importance to the firm to required direct sales skills of individual salespersons. Major subject areas covered are the sales process, recruitment and training, organization and focus, \"territories,\" evaluation and compensation.",
  "prerequsite": "MGT 103."
 },
 {
  "code": "MGT 107",
  "title": "Consumer Behavior",
  "unit": "4",
  "discription": "The course identifies the factors that influence the selection and usage of products and services. Students will be introduced to problems/decisions that include evaluating behavior, understanding the consumers' decision process, and strategies to create desirable consumer behavior.",
  "prerequsite": "MGT 103."
 },
 {
  "code": "MGT 108R",
  "title": "Applied Market Research",
  "unit": "4",
  "discription": "The business world revolves around managerial decisions, and those ought to be data driven. In this course we will learn about planning, implementing, and analyzing market research; synthesizing multi-methods research; and presenting market research results by actually doing it. We will learn how to plan and conduct interviews; how to design, execute, and analyze surveys; and how to employ cutting-edge tools such as adaptive conjoint analysis to quantify attribute levels and trade-offs. This course is a distance education course.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 109",
  "title": "Topics in Marketing",
  "unit": "4",
  "discription": "Introduces advanced topics of special interest in marketing. Topics may include advertising, consumer behavior, pricing, product life cycles, etc. This course may also cover the unique demands of innovation-driven, biotech, and high-technology markets.",
  "prerequsite": "MGT 103, upper-division standing."
 },
 {
  "code": "MGT 112",
  "title": "Global Business Strategy",
  "unit": "4",
  "discription": "Will examine the advantages and complications of the multinational organization with emphasis on translating marketing, financing, and operating plans in light of geographical, cultural, and legal differences across the globe. Will also cover organizational considerations for transglobal management.",
  "prerequsite": "MGT 103 and either MGT 181 or MGT 187, upper- division standing."
 },
 {
  "code": "MGT 117",
  "title": "Business Law",
  "unit": "4",
  "discription": "Focuses on elements of business law that are essential for the basic management of business operations. Topics include the law of contracts, sales, partnership, corporations, bankruptcy, and securities. Students will also gain knowledge of intellectual property law and dispute resolution.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 119",
  "title": "Topics in Business",
  "unit": "4",
  "discription": "Introduces advanced topics of special interest in business and addresses the new frontiers in the industry. Topics may include intellectual property, consumer behavior, market research, analytics, and spreadsheet modeling, etc. May be taken for credit three times. Instructional methods include face-to- face lecture, case presentation, assigned reading, and group discussion.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 121A",
  "title": "Innovation to Market A",
  "unit": "4",
  "discription": "Consider new project concepts. Discern market needs, competitive environment, and determine “go to market” strategy. Research potential markets, customers, partners, and competitors. Consider price versus attributes, alternative distribution channels, gaining unfair advantage. Examine the need and structure of a start-up team.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 121B",
  "title": "Innovation to Market B",
  "unit": "4",
  "discription": "Build a business plan. Establish intellectual property rights. Provide financial projections and determine financing needs. Explore investment sourcing, business valuation, and harvesting opportunities. Determine operational plans and key employee requirements.",
  "prerequsite": "MGT 181 or MGT 187 and MGT 111 or MGT 121A, upper-division standing."
 },
 {
  "code": "MGT 127",
  "title": "Innovation and Technology Strategy",
  "unit": "4",
  "discription": "Outlines frameworks and tools for formulating strategy to manage technology and think strategically in fast-moving industries (e.g., high tech, biotech, and clean tech). Students will gain insights into technology, strategy, and markets, especially how disruptive technologies create opportunities for start-ups and transform established firms, and how technology firms achieve competitive advantage through tech-enabled innovations. Illustrated by case studies on cutting-edge start-ups industry leaders.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "MGT 128",
  "title": "Business Innovation and Growth",
  "unit": "4",
  "discription": "Business innovation is accelerating and the service sector is the fastest- growing sector of the economy. This course helps students prepare for careers as businesses transition to a service economy and help them identify career and entrepreneurial opportunities. Students gain understanding of the design and innovation approaches in businesses and the service industry. The course also addresses trends of businesses services getting digitized and technology- enabled for growth, productivity, and scalability. Credit not allowed for MGT 128 and MGT 128R.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 128R",
  "title": "Business Innovation and Growth",
  "unit": "4",
  "discription": "Business innovation is accelerating and the service sector is the fastest- growing sector of the economy. This course helps students prepare for careers as businesses transition to a service economy and help them identify career and entrepreneurial opportunities. Students gain understanding of the design and innovation approaches in businesses and the service industry. The course also addresses trends of businesses’ services getting digitized and technology-enabled for growth, productivity, and scalability. Credit not allowed for MGT 128R and MGT 128. ",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 129",
  "title": "Topics in Entrepreneurship",
  "unit": "2",
  "discription": "Introduces advanced topics of special interest in entrepreneurship. Examples of course topics include (but are not limited to) venture capital funding process, entrepreneurial business development and marketing, workplace climate and morale, and developing a capable workforce. Instructional methods include face-to-face lecture, case presentation, assigned reading and group discussion. May be taken for credit three times.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "MGT 131A",
  "title": "Intermediate Accounting A",
  "unit": "4",
  "discription": "Preparation and interpretation of accounting information under both FASB and IASB guidelines pertaining to revenue and expense recognition, receivables, and inventories.",
  "prerequsite": "upper-division standing and MGT 5 and either MGT 4 or ECON 4."
 },
 {
  "code": "MGT 131B",
  "title": "Intermediate Accounting B",
  "unit": "4",
  "discription": "Preparation and interpretation of accounting information under both FASB and IASB guidelines pertaining to property plant and equipment, leases, intangible assets, investments, long-term debt, and stockholders’ equity.",
  "prerequsite": "MGT 131A."
 },
 {
  "code": "MGT 132",
  "title": "Auditing",
  "unit": "4",
  "discription": "Theory and practice of the attest process; planning and implementing the audit of the financial statements and internal control over financial reporting to ensure compliance with applicable requirements.",
  "prerequsite": "MGT 131B."
 },
 {
  "code": "MGT 133",
  "title": "Advanced Cost Accounting",
  "unit": "4",
  "discription": "Covers cost accumulation and analysis, for both manufacturing cost components and service activities, budgeting and cost projections, cost variance analysis, relevant costs, and capital investment analysis.",
  "prerequsite": "MGT 131B."
 },
 {
  "code": "MGT 134",
  "title": "Federal Taxation—Individuals",
  "unit": "4",
  "discription": "Covers theory and practical application of federal income tax regulations for individuals pertaining to gross income, adjusted gross income, itemized deductions, business operations, passive activities, property transactions, deferred income recognition, and reporting standards.",
  "prerequsite": "MGT 131B."
 },
 {
  "code": "MGT 135",
  "title": "Federal Taxation—Companies",
  "unit": "4",
  "discription": "Covers the theory and practical application of federal income tax regulations for corporations and other enterprises pertaining to formulations, annual operations, distributions, liquidations, reorganizations, affiliations, and reporting standards.",
  "prerequsite": "MGT 131B."
 },
 {
  "code": "MGT 136",
  "title": "Advanced Accounting",
  "unit": "4",
  "discription": "Covers accounting topics related to consolidated financial statements, variable interest entities, foreign currency translation, segment reporting, and business combinations.",
  "prerequsite": "MGT 132."
 },
 {
  "code": "MGT 137",
  "title": "Financial Statement Analysis",
  "unit": "4",
  "discription": "Examines tools and techniques to analyze a firm’s financial position and performance. This course combines both accounting and finance in a practical framework for debt and equity valuation methods from both a conceptual and practical framework.",
  "prerequsite": "upper-division standing and MGT 5 and either MGT 4 or ECON 4."
 },
 {
  "code": "MGT 138",
  "title": "Information Technology and Accounting",
  "unit": "4",
  "discription": "This course provides an introduction to the role and use of models and modeling in managerial decision-making. Students will gain hands-on experience in evaluating accounting data using Microsoft Excel. Content includes creating data boxes in financial accounting, using multiple sheets with formulas, preparing professional quality financial reports, and creating graphs to interpret business results. Students will also explore the utility of QuickBooks and the functionality for small businesses.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 139",
  "title": "Accounting Information Systems",
  "unit": "4",
  "discription": "Develop an understanding of transaction cycles (e.g., sales order and purchase order processing) with a focus on processing steps, internal controls, and data used. Gain hands-on experience developing flowcharts, processing transactions in a manual accounting information system, and analyzing transaction data using Microsoft Excel and other tools.",
  "prerequsite": "MGT 131B and upper-division standing."
 },
 {
  "code": "MGT 143",
  "title": "Forensic Accounting",
  "unit": "4",
  "discription": "Course covers key forensic accounting concepts including fraudulent financial reporting, money laundering, business valuation, and litigation support. Learning objectives are the application of analytical accounting and communication skills in identifying and presenting financial issues in both criminal and civil litigation.",
  "prerequsite": "MGT 131B and upper-division standing."
 },
 {
  "code": "MGT 146",
  "title": "Ethics in Accounting",
  "unit": "4",
  "discription": "This course will focus on three major components: 1) what matters (the purpose of ethics in the accounting profession); 2) why ethics matter (the reasons, skills, and abilities that make a difference); and 3) how a professional \"walks the walk.\" The course provides students with the opportunity to gain knowledge, awareness, and recognition of ethical terms, theories, codes, etc. Students will be given the opportunity to practice making choices and exercise professional judgment.",
  "prerequsite": "MGT 132, upper-division standing."
 },
 {
  "code": "MGT 147",
  "title": "Not-For-Profit and Government Accounting",
  "unit": "4",
  "discription": "Addresses issues faced in government and not-for-profit accounting. Students will gain insight into how and why these issues may have been resolved either similarly or differently from the for-profit business sector. Focus will be placed on how revenue and expense recognition, asset and liability valuation, the scope of the reporting entity, reporting cash flows, etc., differ in comparison to for-profit business accounting.",
  "prerequsite": "MGT 131B, upper-division standing."
 },
 {
  "code": "MGT 149",
  "title": "Topics in Accounting",
  "unit": "4",
  "discription": "Introduces advanced topics of special interest in accounting. Examples of course topics include (but are not limited to) corporate valuation and forecasting, global taxation and business strategy, current issues in the practice and regulation of auditing. May be taken for credit two times for a maximum of eight credits if the topics are substantially different.",
  "prerequsite": "MGT 131B, upper-division standing."
 },
 {
  "code": "MGT 151",
  "title": "Foundations and Principles of Business Analytics",
  "unit": "4",
  "discription": "This course surveys the foundations, principles, and potential of the data science/business convergence. In a nontechnical manner, the course aligns business problems, challenges, and objectives with affiliated disciplines such as machine learning and large-data statistics, providing new structures and frameworks that will help the student understand the fundamental interconnections of these important fields.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "MGT 153",
  "title": "Business Analytics",
  "unit": "4",
  "discription": "This course is designed to help a business manager use data to make good decisions in complex decision-making situations. Students will learn core business analytics concepts and skills including Excel, relational databases and Structured Query Language (SQL), principles of effective data visualizations and interactive data visualization (e.g., Tableau), and data preprocessing and regression analysis using data analytics programming (e.g., Python).",
  "prerequsite": "MATH 10A or MATH 18 or MATH 20A or MATH 31AH and BENG 100 or BIEB 100 or COGS 14B or ECE 109 or ECON 120A or MAE 108 or MATH 11 or MATH 180A or MATH 181A or MATH 183 or MATH 186 or MGT 3 or PSYC 60 or SIO 187, upper-division standing."
 },
 {
  "code": "MGT 154",
  "title": "Advanced Business Research",
  "unit": "4",
  "discription": "When considering complex business problems, research is often undertaken as a means of aiding decision-making. This course gives an in-depth look at the business research process, including methods of qualitative and quantitative research. Students learn about the design and execution of business analytics (including common descriptive and predictive models), and how models are selected, executed, and evaluated, with focus on extracting impactful information to aid in making informed decisions.",
  "prerequsite": "MGT 153, department approval required, upper-division standing."
 },
 {
  "code": "MGT 157",
  "title": "Real Estate Securitization",
  "unit": "4",
  "discription": "Residential and commercial mortgage-backed securities markets and the market for structured real estate debt; the estimation of prices, yields, and various measures of investment performance; creating and structuring security issues; legal, regulatory, and institutional issues; derivative products (CDOs, CDSs, options, futures, etc.); and current political, economic, and policy issues.",
  "prerequsite": "MGT 181 and upper-division standing."
 },
 {
  "code": "MGT 158",
  "title": "Real Estate and the Tech Sector",
  "unit": "4",
  "discription": "Introduction to the emerging real estate tech sector; newly available datasets and technologies are transforming the real estate sector; introduction of quantitative methods for analyzing real estate and urban trends; utilizing large datasets and software in making optimal decisions from the perspective of buyers, sellers, real estate agents and brokers, developers, and regulators.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 162",
  "title": "Negotiation",
  "unit": "2",
  "discription": "The ability to negotiate effectively is a critical skill for business professionals. Students will develop a systematic and insightful approach to negotiation. The course provides an introduction to strategic thinking and the basic concepts, tactics, and cognitive aspects of negotiation. Interactive negotiation exercises are used to isolate and emphasize specific analytic points and essential skills.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 164",
  "title": "Business and Organizational Leadership",
  "unit": "4",
  "discription": "Students will study alternative organizational structures—their stakeholders and corporate cultures, and their use in meeting strategic enterprise priorities facing a company. This course provides students with insights into motivational factors, communications networks, organizational cultures, and alternative leadership styles. The concept of change management and its challenges is also studied along with power and influence. Students may not receive credit for MGT 164 and MGT 164GS. Course previously listed as: Organizational Leadership.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 164GS",
  "title": "Business and Organizational Leadership",
  "unit": "4",
  "discription": "Students will study alternative organizational structures—their stakeholders and corporate cultures and their use in meeting various strategic priorities facing a company. This course provides students with insights into motivational factors, communications networks, organizational cultures, and alternative leadership styles. The concept of change management and its challenges is also studied along with power and influence. Students must submit applications to the International Center Programs Abroad Office and be accepted into the Global Seminar Program. Students may not receive credit for MGT 164 and MGT 164GS. Course previously listed as: Organizational Leadership.",
  "prerequsite": "upper-division standing. Program or materials fees may apply."
 },
 {
  "code": "MGT 166",
  "title": "Business Ethics and Corporate Responsibility",
  "unit": "4",
  "discription": "Will cover ethical conduct issues for leaders from a wide array of organizations and industries including consideration of differences among global trading partners. The issues impacting corporate responsibility will be examined as will full-cycle cost analysis of products and services.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 167",
  "title": "Social Entrepreneurship",
  "unit": "4",
  "discription": "Social entrepreneurs create innovative solutions to solve challenging social and environmental issues affecting the world around them. In this course, students will learn how to apply entrepreneurial business and innovative skills to effectively tackle global issues impacting society such as environmental degradation, rural health care availability, educational improvements in economically disadvantaged regions of the world, famine in an era of obesity, and clean water development.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 171",
  "title": "Operations Management",
  "unit": "4",
  "discription": "Operations management (OM) involves the systematic design, execution, and improvement of business processes, projects, and partner relationships. This course goes beyond cost minimization and addresses issues that firms large and small must confront in their journey toward sustained scalability, growth, and profitability. Also examines human factors such as psychological contract, team management, empowerment, employee-initiated process improvements, morale, motivation, rewards, and incentives.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 172",
  "title": "Business Project Management",
  "unit": "4",
  "discription": "Addresses effective practices for management of business projects. Includes both project management processes—scheduling, milestone setting, resource allocation, budgeting, risk mitigation—and human capital management—communication, teamwork, leadership. Also considers requirements for effectively working across functional and organizational boundaries.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 173",
  "title": "Project Management: Health Services",
  "unit": "4",
  "discription": "This course covers efficient techniques for managing health services projects, including both the technical aspects of project management as well as the human-capital management issues associated with blending administrative and technical staff with health-care professionals. Topics include scheduling methods, milestone setting, governmental regulations, resource allocation, interpersonal skills, and performing research and development projects—all with a health services focus.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 175",
  "title": "Supply Chain Management",
  "unit": "4",
  "discription": "Supply chain management involves the flows of materials and information that contribute value to a product, from the source of raw materials to end customers. This course explains how supply chains work and describes the major challenges in managing an efficient supply chain. Covers various strategic and tactical supply chain issues such as distribution strategy, information sharing strategy, outsourcing, procurement (including e-markets), product design, virtual integration, and risk management. Credit is not allowed for both MGT 174 and MGT 175.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 176",
  "title": "Strategic Cost Management",
  "unit": "4",
  "discription": "Covers a process to conduct and create a professional supply market analysis report, starting from data sources and processes to develop cost models. Includes a structured process to create and implement supplier selection and qualification as well as cost management strategies. Students will sharpen analytical skills, think creatively outside the box, and be able to sell their strategy by studying real-life examples of how these concepts have been implemented at various Fortune 100 companies.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "MGT 177",
  "title": "Analytics and Spreadsheet Modeling in Supply Chain Management",
  "unit": "4",
  "discription": "In today’s global economy, competition is not firm against firm, but rather supply chain against supply chain. Companies utilize analytics (i.e., the use of data, together with statistical and quantitative models, to make better, data-driven business decisions) to gain advantage in their supply chain management. Course covers the use of data analytics and spreadsheet modeling in decision-making involved in supply chain management, including logistics, facility management, fulfillment, and pricing.",
  "prerequsite": "MGT 153, upper-division standing."
 },
 {
  "code": "MGT 179",
  "title": "Topics in Supply Chain Management",
  "unit": "2",
  "discription": "Introduces advanced topics of special interest in supply chain. Students will develop the ability to apply the supply chain management concepts that they have learned to real-life situations. May be taken for credit two times if topics are substantially different.",
  "prerequsite": "MGT 175."
 },
 {
  "code": "MGT 181",
  "title": "Enterprise Finance",
  "unit": "4",
  "discription": "Will cover debt and equity financing of the enterprise, the role of commercial banks, venture firms, and investment banks; along with enterprise valuation, cash flow management, capital expenditure decisions, return on investment, economic value add, and foreign currency translation.",
  "prerequsite": "upper-division standing and (MATH 10A or MATH 20A or MGT 3) and (MGT 5 or MGT 45) and (MGT 4 or MGT 45 or ECON 4)."
 },
 {
  "code": "MGT 183",
  "title": "Financial Investments",
  "unit": "4",
  "discription": "Examines financial theory and empirical evidence useful for making investment decisions. Portfolio theory, equilibrium models, and market efficiency are examined for stock securities and fixed income instruments. Risk adjusted ROIs for capital investments’ impact on stock prices and free options will also be studied.",
  "prerequsite": "MGT 181, MGT 187, or ECON 173B."
 },
 {
  "code": "MGT 184",
  "title": "Money and Banking",
  "unit": "4",
  "discription": "Focuses on role of financial institutions, implications for firm financing and valuation as well as the Federal Reserve, financial regulation, the money supply process, and monetary policy. Mechanisms through which monetary policy affects businesses and credit channels will be covered.",
  "prerequsite": "MGT 181, MGT 187, or ECON 173B."
 },
 {
  "code": "MGT 185",
  "title": "Investment Banking",
  "unit": "4",
  "discription": "This course provides students with an overview of the investment banking industry, including IPOs, equity offerings, debt offerings, valuation, mergers and acquisition, private equity, asset securitization, prime brokerage, sales and trading, and market making. Emphasis of the class will be on traditional corporate finance, which includes equity and debt offerings as well as mergers and acquisitions.",
  "prerequsite": "MGT 181, MGT 187, or ECON 173B, and upper-division standing. ****"
 },
 {
  "code": "MGT 187",
  "title": "New Venture Finance",
  "unit": "4",
  "discription": "Taking a global perspective, this course examines how innovation is funded and the financial tools necessary over the life cycle of a new venture—development, growth, maturity, and exit. Students will learn to perform financial analysis to determine the feasibility of financing new, transformed, and growing ventures, whether foreign or domestic. The course will also cover term sheets, valuation methods, and the role of private equity investors—angels, VCs, and vendors.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "MGT 189",
  "title": "Topics in Finance",
  "unit": "4",
  "discription": "Introduces advanced topics of special interest in finance. Topics may include behavioral finance, financial derivatives, portfolio management, fixed income securities, asset pricing theory, commercial banking, etc. May be taken for credit up to three times.",
  "prerequsite": "MGT 181 or MGT 187, upper- division standing **.**"
 },
 {
  "code": "MGT 198",
  "title": "Directed Group Study",
  "unit": "4",
  "discription": "A small group undertaking, on a topic or in a field not included in the regular curriculum, by special arrangement with a faculty member.",
  "prerequsite": "instructor consent and department approval."
 },
 {
  "code": "MGT 199",
  "title": "Directed Independent Study",
  "unit": "4",
  "discription": "Directed individual study or research by special arrangement and under supervision of a faculty member.",
  "prerequsite": "consent of instructor and department approval; approved Special Studies form."
 },
 {
  "code": "MGT 402",
  "title": "Management Communications",
  "unit": "1",
  "discription": "Course focuses on various management communications platforms. Students will learn strategies to establish competence, build trust, motivate and inspire, and achieve commitment to action. Participants will develop, present, and receive intensive peer feedback for both written communications and presentations. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 403",
  "title": "Quantitative Analysis",
  "unit": "4",
  "discription": "Through lecture and online delivery, students will be introduced to key techniques for using data to make informed management decisions. Covers probability, statistics, decision analysis, and optimization techniques. Emphasizes managerial applications in such areas as operations management, marketing, and finance. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 404",
  "title": "Accounting",
  "unit": "4",
  "discription": "Through lecture and online delivery, students will be introduced to the basic concepts and methods used in financial statements. The course highlights the linkages between accounting information and management planning, decision making, and control. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 405",
  "title": "Managerial Economics",
  "unit": "4",
  "discription": "Through lecture and online delivery, this course will introduce students to the tools and concepts of microeconomics to analyze decision problems within technology driven firms through the coverage of microeconomic concepts relevant to managerial decision making. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 406",
  "title": "Leadership Skills, Values, and Teamwork in Technology Firms",
  "unit": "4",
  "discription": "Through lecture and online delivery, introduces principles of effective teamwork and leadership and of strategic managerial communication. Provides an introduction to case study and to ethical issues confronting managers in technology or science-driven firms. Develops managerial communication skills. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 407",
  "title": "Marketing",
  "unit": "4",
  "discription": "By taking an analytical approach to the study of marketing problems, this course provides an understanding of customers and competitors as a basis for developing, pricing, promoting, and distributing goods and services that satisfy customer and organizational objectives. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 408",
  "title": "Finance",
  "unit": "4",
  "discription": "Through lecture and online delivery, this course will focus on basic business financial concepts with particular attention to challenges of finance in start-up and small- and medium-sized enterprises. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 409",
  "title": "Organizational Strategy",
  "unit": "4",
  "discription": "After identifying characteristics common to technology driven firms, the implications of living in, managing, and leading such an organization are explored. Covers skills such as leadership of project teams and negotiations. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 410",
  "title": "Strategy",
  "unit": "4",
  "discription": "Through lecture and online delivery, this course explores the strategic management of technology-driven firms focusing on the analytical tools and techniques that support strategy formulation and the related managerial skills and decision processes that foster strategy implementation. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 412",
  "title": "Lab to Market: Opportunity and Business Model Analysis",
  "unit": "4",
  "discription": "An integrated examination of competencies needed to transform innovations into profitable market opportunities. Focus on processes to generate ideas, assess which ones are viable business opportunities, and evolve them into products and businesses. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 413",
  "title": "Operations, Information Systems, and Data Analysis",
  "unit": "4",
  "discription": "Through lecture and online delivery, students will be familiarized with the problems and issues confronting operations managers, and to introduce language, conceptual models, and analytical techniques that are broadly applicable in confronting such problems. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 414A",
  "title": "Lab to Market Workshop I",
  "unit": "4",
  "discription": "Through lecture, provides broad coverage of leading-edge developments in technical and scientific research, with an eye to their potential applicability and value in business. Provides basis for project-based Lab to Market Workshop II. An IP grade will be awarded at the end of the quarter. Final grade will not be given until the completion of MGT 414B. Letter grades only.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 414B",
  "title": "Lab to Market Workshop II",
  "unit": "4",
  "discription": "Project-based course, requiring identification and completion of major project assessing potential business value of emerging or potential technology or science. Students work individually or in teams. Periodic class meetings include presentation of interim and final reports. Letter grades only.",
  "prerequsite": "MGT 414A and MBA student or department stamp."
 },
 {
  "code": "MGT 416",
  "title": "Readings in Management",
  "unit": "1 or 2",
  "discription": "Review and discussion of current research and literature on selected topics in business and management. Research paper and presentation required. May be taken for credit three times. Students may not earn credit for both MGT 416 and MGT 252 if the courses have the same course subtitle. They are course equivalents.",
  "prerequsite": "MBA students only or consent of instructor with department stamp."
 },
 {
  "code": "MGT 417",
  "title": "Current Business Law Issues",
  "unit": "4",
  "discription": "Explores current issues in business law, emphasizing concerns faced by new companies. Students learn how the law regulates and shapes businesses; examine the legal role in business formations, operations, and dissolutions; and gain knowledge of contract and intellectual property law. Letter grades only. Students may not earn credit for both MGT 417 and MGT 212. Also, students may not receive credit for both MGT 417 and MGT 219 with the course subtitle Current Business Law Issues.",
  "prerequsite": "MBA students only or consent of instructor and department stamp."
 },
 {
  "code": "MGT 419",
  "title": "Global Business Immersion",
  "unit": "2",
  "discription": "Introduces advanced topics in global business, with a regional emphasis. Instructional methods include lectures, case presentations, readings, and discussions. A substantial portion of learning outcomes will be met by visiting businesses in another world region, observing operations, and interviewing executives. The visit to the foreign region will typically be one to two weeks and may occur outside the normal academic quarter. S/U grades only. May be taken for credit two times. Students may not earn credit for both MGT 419 and MGT 259 if the courses have the same course subtitle. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 420",
  "title": "Negotiation",
  "unit": "4",
  "discription": "Examines methods of conflict resolution needed for effective management in a constantly changing business environment. Applies these tools to the broad spectrum of negotiation problems faced by the manager and professional. Includes simulations, role playing, and cases. Students may not earn credit for both MGT 420 and MGT 260. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 421",
  "title": "CEO, the Board of Directors, and Corporate Governance",
  "unit": "4",
  "discription": "Provides an understanding of relationships among shareholders, managers, and boards. Focuses on the office of the chief executive officer and on the board of directors, including the roles and responsibilities of directors, and the legal, economic, managerial, and psychological issues they confront. Students may not earn credit for both MGT 421 and MGT 211. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 422",
  "title": "Creativity and Innovation",
  "unit": "4",
  "discription": "This course focuses on fostering and maintaining creativity in entrepreneurial ventures and in general management more broadly. Reading materials, cases, classroom, and home exercises will help students understand and be able to use creativity in their own working lives. Students may not earn credit for both MGT 422 and MGT 222. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 425",
  "title": "Opportunity and Business Model Analysis",
  "unit": "2",
  "discription": "Builds on core management courses and deals with identifying and assessing new technological and product opportunities. Assessment methods and frameworks will be introduced for technologies and opportunities. Various business models to profitably address the market opportunities will also be discussed.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 426",
  "title": "Creating a High-Performing Workplace",
  "unit": "2",
  "discription": "Students will learn to develop a workforce that performs at the highest level through strategies and practices that recruit productive people, build commitment, foster innovation, and inspire and empower motivated employees to deliver results. Letter grades only. Students may not earn credit for both MGT 426 and MGT 262. Students may not receive credit for both MGT 426 and MGT 269 with the course subtitle Creating a High-Performing Workplace.",
  "prerequsite": "MBA student or department stamp."
 },
 {
  "code": "MGT 427",
  "title": "Decision Analysis",
  "unit": "4",
  "discription": "Provides practical techniques to help structure decision problems and analyze them quantitatively. Techniques help thinking clearly about objectives, alternatives, consequences, and uncertainties, and enable logical judgments with other types of information. Letter grades only. Students may not earn credit for both MGT 427 and MGT 240. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 429",
  "title": "Topics in Corporate Governance",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in corporate governance. Instructional methods include face-to-face lecture, case presentations, assigned readings, and online group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 429 and MGT 219 if courses have same course subtitle. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 430",
  "title": "Biotechnology Industry, Structure, and Strategy",
  "unit": "4",
  "discription": "Provides a business overview of the life science industry, its major market segments, financial structure, and financing strategies. Develops an understanding of major industry issues and strategies, including business development, financing, partnering and alliances, emerging trends, ethical and policy issues. Students may not earn credit for both MGT 430 and MGT 250. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 439",
  "title": "Topics in Organizational Behavior",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in management and organizational behavior. Instructional methods include face-to-face lecture, case presentations, assigned readings, and online group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 439 and MGT 269 when they have the same subtitles.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 442",
  "title": "Topics in Decision Sciences",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in management and decision sciences. Instructional methods include face-to-face lecture, case presentations, assigned readings, and group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 442 and MGT 249 with same course subtitle. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 443",
  "title": "Topics in International Business",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in international business. Instructional methods include face-to-face lecture, case presentations, assigned readings, and group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 443 and MGT 229 when the course subtitles are the same.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 444",
  "title": "Topics in Business Strategy",
  "unit": "2 or 4",
  "discription": "Advanced topics of special interest in business strategy. Instructional methods include face-to-face lecture sessions and case discussion. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 444 and MGT 251 when the subtitles are the same.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 445",
  "title": "Regulation and Innovation",
  "unit": "4",
  "discription": "Addresses the complex role of regulation in business innovation. Includes legal issues such as how to structure a business, whether to seek intellectual property protection, when and how to raise capital or formulate exit strategies, how to make employment decisions.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 447",
  "title": "Drug Discovery, Development, and Commercialization",
  "unit": "3",
  "discription": "(Cross-listed with SPPS 273, PHAR 210, and BIOM 267). This elective is designed to increase knowledge of the drug discovery, development, regulatory, and commercialization process. Students will have an increased understanding of how an investigational agent eventually becomes an approved drug for patient use. Lectures and a student group project will be conducted for this elective.",
  "prerequsite": "open to Skaggs School of Pharmacy and Pharmaceutical Sciences, School of Medicine, and graduate biomedical science students; and Rady School of Management graduate students."
 },
 {
  "code": "MGT 449",
  "title": "Topics in Operations and Technology",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in operations. Instructional methods include face-to-face lecture, case presentations, assigned readings, and online group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 449 and MGT 279 when the course subtitles are the same.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 450",
  "title": "Project Management",
  "unit": "4",
  "discription": "Provides management concepts and tools to enable the more effective design, planning, and control of projects. Includes both the qualitative and quantitative aspects of project management. Students may not earn credit for both MGT 450 and MGT 270. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 451",
  "title": "Technology and Innovation Strategy",
  "unit": "4",
  "discription": "Outlines tools for formulating and evaluating technology strategy, including an introduction to the economics of technical change, models of technological evolution, and models of organizational dynamics and innovation. Provides an understanding of how technology firms gain and sustain competitive advantage. Students may not earn credit for both MGT 451 and MGT 271. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 452",
  "title": "New Product Development",
  "unit": "4",
  "discription": "Provides comprehensive analytical coverage of the new product development process, focusing on the basic tools, methods, and organizational structures used in new product development and management. Students may not earn credit for both MGT 452 and MGT 272. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 453",
  "title": "Supply Chain Management",
  "unit": "4",
  "discription": "Describes the systems approach to managing the entire flow of information, materials, and services from raw materials suppliers through factories and warehouses to the end customer, which is the key to productivity and competitiveness of manufacturing and service enterprises. Letter grades only.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 454",
  "title": "Disruptive Technologies for Health Care",
  "unit": "4",
  "discription": "Introduces how IT will transform health sciences. Highlights how IT and associated disruptive innovations in health-care delivery will enable physicians, patients, and caregivers to cost effectively prevent, diagnose, and monitor health conditions; manage treatment; and facilitate timely communication and intervention. Letter grades only. Students may not earn credit for both MGT 454 and MGT 274. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 455",
  "title": "Customer Analytics",
  "unit": "4",
  "discription": "Many firms have extensive information about customers' choices and how they react to marketing campaigns, but few have the expertise to efficiently act on such information. In this course, students will learn a scientific approach to marketing with hands-on use of technologies such as databases, analytics, and computing systems to collect, analyze, and act on customer information.",
  "prerequsite": "Restricted to MBA students or by department approval."
 },
 {
  "code": "MGT 459",
  "title": "Topics in Innovation",
  "unit": "2 or 4",
  "discription": "Advanced topics in business innovation, delivered by lecture, case presentation, and group discussion. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 459 and MGT 221 if the course has the same course subtitle. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 463",
  "title": "Projects in Technology Commercialization",
  "unit": "4",
  "discription": "This elective engages students in the process of commercializing technology through experiential learning. Students will gain an increased understanding of commercialization, including introducing a new product into the market, customer development, and market selection. Students will be required to incorporate the latest research methods for identifying customers, analyzing markets, and developing strategies for market entry and growth. Lectures and a student group project will be conducted. Students may not earn credit for both MGT 463 and MGT 223. Also, students may not receive credit for both MGT 463 and MGT 221 Topics in Innovation course with the subtitle Projects in Technology Commercialization.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 464",
  "title": "Projects in Business Innovation",
  "unit": "4",
  "discription": "Students will use latest research in management, marketing, finance, strategy, and operations to analyze current business problems posed by real companies and will recommend to senior management strategies that resolve the problem(s) presented in the project. Students may not earn credit for both MGT464 and MGT224. Students may not receive credit for both MGT 224 and MGT 221 Topics in Innovation with the course subtitle Projects in Business Innovation.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 469",
  "title": "Topics in Accounting",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in accounting. Instructional methods include face-to-face lecture, case presentations, assigned readings, and online group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not receive credit for both MGT 239 and MGT 469.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 475",
  "title": "Research for Marketing Decisions",
  "unit": "4",
  "discription": "Methods and applications of qualitative and quantitative marketing research to solve substantive marketing problems. Emphasis on integrating problem formulation, research design, questionnaire construction, and sampling to yield the most valuable information, and on the proper use of statistical methods. Students may not earn credit for both MGT 475 and MGT 202. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 476",
  "title": "Marketing Strategy",
  "unit": "4",
  "discription": "Addresses formulation and implementation of marketing strategy based on an integrative view of competitive brand strategy over the product life cycle. Provides a framework for developing marketing strategies yielding sustainable competitive advantage based on customer, competitor, industry, and environmental analysis. Students may not earn credit for both MGT 476 and MGT 201. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 477",
  "title": "Consumer Behavior",
  "unit": "4",
  "discription": "The course identifies the factors that influence the selection and usage of products and services. Students will be introduced to problems/decisions that include evaluating behavior; understanding the consumers' decision process, and strategies to create desirable consumer behavior. Students may not earn credit for both MGT 477 and MGT 203. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 478",
  "title": "Marketing Communications",
  "unit": "4",
  "discription": "This course differentiates decisions/principles considered when developing an overall communications and promotions strategy. Key decisions include the promotional mix, the design, implementation and evaluation of communications strategies and the thinking required to develop a creative strategy. Students may not earn credit for both MGT 478 and MGT 204. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 479",
  "title": "Pricing",
  "unit": "4",
  "discription": "This class covers issues in pricing decisions. The main emphasis will be on the data and tools required to make successful profitable pricing decisions. Students may not earn credit for both MGT 479 and MGT 205. They are course equivalents.",
  "prerequsite": "MGT 407 and MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 480",
  "title": "Sales and Sales Management",
  "unit": "4",
  "discription": "Offers a pragmatic view into the world of sales, from its strategic importance to the day-to-day creation and management of a sales organization. Students will also have the opportunity to develop and practice their own sales skills. Letter grades only. Students may not earn credit for both MGT 480 and MGT 206. Also, students may not receive credit for MGT 480 and MGT 209 Topics in Marketing with the course subtitle Sales and Sales Management.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 488R",
  "title": "Applied Market Research",
  "unit": "4",
  "discription": "The business world revolves around managerial decisions, and those ought to be data driven. In this course we will learn about planning, implementing, and analyzing market research; synthesizing multi-methods research; and presenting market research results. We will do this by actually doing it. We will learn how to plan and conduct interviews; how to design, execute, and analyze surveys; and how to employ cutting-edge tools such as adaptive conjoint analysis to quantify attribute levels and trade-offs. This course is a distance education course.",
  "prerequsite": "MBA student or consent of instructor."
 },
 {
  "code": "MGT 489",
  "title": "Topics in Marketing",
  "unit": "2 or 4",
  "discription": "Introduces advanced topics of special interest in marketing. Instructional methods include face-to-face lecture, case presentations, assigned readings, and group discussions. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 489 and MGT 209 if the course has the same course subtitle. They are course equivalents.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 491",
  "title": "Investments",
  "unit": "4",
  "discription": "Examines financial theory and empirical evidence useful for making investment decisions. Topics include portfolio theory, equilibrium models of security prices, the empirical behavior of security prices, market efficiency, and fixed-income markets and behavioral finance.",
  "prerequsite": "MGT 408 and MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 492",
  "title": "Financial Risk Management",
  "unit": "4",
  "discription": "Explains how to identify, measure, and analyze investment risks associated with interest rates, currency exchange, and equity markets, and acquire techniques to manage and control risk through the use of over-the-counter and exchange-traded derivatives. Letter grades only.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 495",
  "title": "Topics in Finance",
  "unit": "2 or 4",
  "discription": "Advanced topics in finance. Instructional methods include face-to-face lecture and case discussion. May be taken for credit four times, for a maximum of sixteen units if the topics are significantly different. Students may not earn credit for both MGT 495 and MGT 282 when the course subtitles are the same.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 496A",
  "title": "Venture Capital Management I",
  "unit": "2",
  "discription": "Hands-on experience in venture investing. Direct involvement in all stages of managing Rady Venture Fund, including applicant sourcing, initial analysis, due diligence, investment negotiation, portfolio monitoring. IP grade awarded at end of quarter. Final grade assigned upon completion of MGT 496B. Students may not earn credit for both MGT 496A and MGT 289A. S/U grades only.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 496B",
  "title": "Venture Capital Management II",
  "unit": "2",
  "discription": "Provides hands-on experience in venture investing. Direct involvement in all stages of managing the Rady Venture Fund, including sourcing applicants, performing initial analysis, due diligence, investment negotiation, monitoring of the portfolio. Students have substantial input into fund investment decisions. Students may not earn credit for both MGT 496B and MGT 289B. They are course equivalents. S/U grades only.",
  "prerequsite": "MGT 496A and MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 497",
  "title": "Advanced Management Research Practicum",
  "unit": "1",
  "discription": "Internship with approved business or governmental agency, allowing student to pursue topics raised in the management core and elective courses. S/U grades only. May be taken for credit four times, for a maximum of four units, with instructor consent. Students may not earn credit for both MGT 497 and MGT 297. Internship credit may not be applied to fulfill specific course requirements or to credits required for graduation.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGT 499",
  "title": "Individual Directed Study",
  "unit": "1–4",
  "discription": "Individual study or research under the direction of a selected faculty member. May be taken for credit twelve times. Students may earn credit for a total of twelve units in MGT 299 and/or MGT 499.",
  "prerequsite": "MBA student or consent of instructor and department stamp."
 },
 {
  "code": "MGTF 405",
  "title": "Business Forecasting",
  "unit": "4",
  "discription": "Introduction to state-of-the-art forecasting methods in finance. Students will learn to estimate forecasting models based on past values of the predicted variable(s), surveys, market information, and other economic data. Participants will become critical consumers of forecasts reported in the media. Letter grades only.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 406",
  "title": "Behavioral Finance",
  "unit": "4",
  "discription": "Develop theories of behavior motivated by psychology to describe various features of financial markets. Examine how the insights from behavioral finance complement the traditional paradigm and shed light on investors' trading patterns, the behavior of asset prices, and corporate finance. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 407",
  "title": "Valuation in Corporate Finance",
  "unit": "4",
  "discription": "Covering the fundamentals of corporate finance and their application to valuation (including the WACC approach, APV approach, multiples, and real option valuation). We focus on important areas of corporate finance, including capital structure, real options, and financial distress and bankruptcy. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 408",
  "title": "Real Estate Finance",
  "unit": "4",
  "discription": "Examination of real estate capital markets, both debt and equity. Covered topics include real estate valuation, real options applied to real estate, real estate equity markets, and the place of real estate within a diversified investor's portfolio. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 409",
  "title": "Mergers, Acquisitions, and Corporate Restructuring",
  "unit": "4",
  "discription": "Explains the mergers and acquisitions process. Topics include history, motivation, valuation, legal framework, and tax issues of mergers and acquisitions, antitakeover strategies, takeover tactics, leveraged buyouts, joint venture, and strategic alliances. Students may not receive credit for both MGTF 409 and MGT 284.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 410",
  "title": "New Venture Finance",
  "unit": "4",
  "discription": "Focuses on the financing of new ventures and technological innovation. Includes perspectives of both the entrepreneur and the investor, investigating the venture capital process and methods of financial valuation useful in the venture capital industry and for other technology investments. Letter grades only. Students may not receive credit for both MGTF 410 and MGT 280.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 412",
  "title": "Financial Statement Analysis",
  "unit": "4",
  "discription": "Develop a deeper familiarity with financial accounting and assumptions underlying measurements reported in financial statements. Understanding of economic and regulatory forces underlying corporate disclosure of financial statements. Knowledge of data sources and analytical tools to extract and evaluate this data. Letter grades only. ",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 432",
  "title": "Portfolio Theory in Practice",
  "unit": "4",
  "discription": "Provides students with a deeper and broader understanding of risk-return analysis (especially, but not exclusively, mean-variance analysis) than is common among users. Surveys how risk-return analysis is used in practice and examines the \"Modern Portfolio Theory Industry\" and its entrepreneurs. Letter grades only. Students may not receive credit for both MGT 232 and MGT 282 Topics in Finance course with same course subtitle: Portfolio Theory in Practice.",
  "prerequsite": "MGT 281 or MGT 491; restricted to master of finance students, MBA students, or consent of instructor."
 },
 {
  "code": "MGTF 401",
  "title": "Financial Accounting",
  "unit": "4",
  "discription": "Overview of financial accounting reporting, with a primary focus on the analysis of economic events and their effect on the major financial statements (balance sheet, income statement, and statement of cash flows). Learn the nature and purpose of accounting methods. Letter grades only. Students may not receive credit for both MGTF 401 and MGT 404.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 402",
  "title": "Investment Analysis",
  "unit": "4",
  "discription": "Introduces quantitative methods for analyzing the pricing and return behavior of assets such as stocks, bonds, and derivatives; and develops methods for implementing modern portfolio theory in practice. The most influential financial models are derived; their practical applications are discussed. Letter grades only.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 403",
  "title": "Advanced Financial Risk Management",
  "unit": "4",
  "discription": "Introduces ways to identify, measure, estimate, and control risks in the context of risk management as applied in fixed income, foreign exchange, and equity markets. Reviews the pricing and hedging applications of derivatives, such as futures, options, and CDSs. Letter grades only.",
  "prerequsite": "restricted to master of finance program, MBA program, or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 404",
  "title": "Financial Econometrics and Empirical Methods",
  "unit": "4",
  "discription": "Bridging the gap between theoretical financial models and the real world. Covering the major accomplishments of empirical finance. Empirical exercises and analysis of real financial data will help students to truly appreciate the content of the course. Letter grades only.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 405",
  "title": "Business Forecasting",
  "unit": "4",
  "discription": "Introduction to state-of-the-art forecasting methods in finance. Students will learn to estimate forecasting models based on past values of the predicted variable(s), surveys, market information, and other economic data. Participants will become critical consumers of forecasts reported in the media. Letter grades only.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 406",
  "title": "Behavioral Finance",
  "unit": "4",
  "discription": "Develop theories of behavior motivated by psychology to describe various features of financial markets. Examine how the insights from behavioral finance complement the traditional paradigm and shed light on investors' trading patterns, the behavior of asset prices, and corporate finance. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 407",
  "title": "Valuation in Corporate Finance",
  "unit": "4",
  "discription": "Covering the fundamentals of corporate finance and their application to valuation (including the WACC approach, APV approach, multiples, and real option valuation). We focus on important areas of corporate finance, including capital structure, real options, and financial distress and bankruptcy. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 408",
  "title": "Real Estate Finance",
  "unit": "4",
  "discription": "Examination of real estate capital markets, both debt and equity. Covered topics include real estate valuation, real options applied to real estate, real estate equity markets, and the place of real estate within a diversified investor's portfolio. Letter grades only.",
  "prerequsite": "MGTF 402; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 409",
  "title": "Mergers, Acquisitions, and Corporate Restructuring",
  "unit": "4",
  "discription": "Explains the mergers and acquisitions process. Topics include history, motivation, valuation, legal framework and tax issues of mergers and acquisitions, antitakeover strategies, takeover tactics, leveraged buyouts, joint venture, and strategic alliances. Students may not receive credit for both MGTF 409 and MGT 284.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 410",
  "title": "New Venture Finance",
  "unit": "4",
  "discription": "Focuses on the financing of new ventures and technological innovation. Includes perspectives of both the entrepreneur and the investor, investigating the venture capital process, and methods of financial valuation useful in the venture capital industry and for other technology investments. Letter grades only. Students may not receive credit for both MGTF 410 and MGT 280.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 411",
  "title": "Stochastic Calculus and Continuous Time Finance",
  "unit": "4",
  "discription": "Many closed-form analytic results in finance are obtained in the continuous- time setting. This course covers portfolio choice, derivative pricing, and term structure modeling in continuous time setting. The objective is to understand important topics and master techniques of continuous-time models. Letter grades only. Students may not receive credit for both MGTF411 and MGT286. These are course duplicates.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 412",
  "title": "Financial Statement Analysis",
  "unit": "4",
  "discription": "Develop a deeper familiarity with financial accounting and assumptions underlying measurements reported in financial statements. Understanding of economic and regulatory forces underlying corporate disclosure of financial statements. Knowledge of data sources and analytical tools to extract and evaluate this data. Letter grades only.",
  "prerequsite": "restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 413",
  "title": "Computational Finance Methods",
  "unit": "4",
  "discription": "This course introduces students to a variety of mathematical methods as applied in finance, including Monte Carlo simulation, optimization methods, and numerical solution to PDEs. Letter grades only.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 414",
  "title": "Analyzing Large Data",
  "unit": "4",
  "discription": "Introduction to both structured and unstructured data analysis. Methods for \"harvesting\" internet data and putting it into suitable format will be covered. Other topics include large market microstructure data (tick-by-tick data, high-frequency data), data with missing observations, and Kalman filtering. Letter grades only.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 415",
  "title": "Collecting and Analyzing Financial Data",
  "unit": "4",
  "discription": "Teaches students how to obtain and process data in order to answer empirical questions in finance. The data can be numerical or textual, and structured or unstructured. Specific data sources may include CRSP, Compustat, Thomson Reuters, and Bloomberg. Some programming. Letter grades only.",
  "prerequsite": "restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 416",
  "title": "Professional Seminars in Finance",
  "unit": "1",
  "discription": "Discussion series involving industry experts, alumni, and executives on current issues in financial services. Educates students on industry trends. Prepares students to be effective users of the financial press and to be effective in discussion and interaction with financial professionals. S/U grades only. May be taken for credit two times. Students may not earn credit for both this course and MGT 401, which is a comparable course offered in the MBA program.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 417",
  "title": "Professional Communications in Finance",
  "unit": "1",
  "discription": "Focuses on communications skills and abilities required for effective professionals in the financial services sector. Addresses oral and written communications, including presentations, informational and job interviewing, resume writing, cross-cultural communication, and report writing. S/U grades only. May be taken for credit two times. Students may not earn credit for both this course and MGT 402, which is a comparable course offered in the MBA program.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 418",
  "title": "Preparing for the CFA Exam",
  "unit": "2",
  "discription": "The Chartered Financial Analyst (CFA) designation is the industry-accepted gold standard for financial analysts. To earn the CFA charter, students must pass three very challenging exams. Students will look at each of the ten major topic areas and explore the level of understanding that is required to pass the first-level exam. Students will do applied valuation work as well as highlight study habits of successful past candidates.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 420",
  "title": "Money and Banking",
  "unit": "4",
  "discription": "This course is aimed at developing analytical and transferable skills in the area of management of monetary policy and banking and nonbanking financial institutions, issues of credit and financial regulation. Making the connection with real life is the primary focus of this course.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 430",
  "title": "Asset Management",
  "unit": "4",
  "discription": "Students will investigate the reasons behind resource expenditure related to Modern Portfolio Theory (MPT). They will examine ways in which an investor can aim to outperform the predictions of MPT, either by reducing risk without impacting return negatively, or increasing returns without increasing risk. The concepts of this course will be demonstrated through a combination of classroom lectures and case discussions.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 432",
  "title": "Portfolio Theory in Practice",
  "unit": "4",
  "discription": "Provides students with a deeper and broader understanding of risk-return analysis (especially, but not exclusively, mean-variance analysis) than is common among users. Surveys how risk-return analysis is used in practice and examines the \"Modern Portfolio Theory Industry\" and its entrepreneurs. Letter grades only. Students may not receive credit for both MGT 232 and MGT 282 Topics in Finance course with same course subtitle: Portfolio Theory in Practice.",
  "prerequsite": "MGT 281 or MGT 491; restricted to master of finance students, MBA students, or by consent of instructor."
 },
 {
  "code": "MGTF 458",
  "title": "Financial Innovations for Economic Development",
  "unit": "4",
  "discription": "This course focuses on the means and methods of finance applied to social, economic, and environmental challenges of development. Financial innovations give rise to new intermediaries, new types of instruments, and new services or techniques to create jobs, build communities, and enable capital formation and economic growth. Students will discover why capital structure matters in aligning diverse interests into new business models to finance social and economic change.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTF 490",
  "title": "Capstone: Applied Finance Project",
  "unit": "4",
  "discription": "The Capstone project is one of the primary measures of student learning. Evaluation is based on students' ability to apply course material to the Capstone project. Satisfactory completion of the project is required for award of the degree. Letter grades only.",
  "prerequsite": "MGTF 401, MGTF 402, MGTF 403, MGTF 404, and restricted to master of finance program or by consent of instructor and department stamp."
 },
 {
  "code": "MGTF 495",
  "title": "Special Topics in Finance",
  "unit": "2–4",
  "discription": "Introduces advanced topics of special interest in finance. Instructional methods can include face-to-face lecture, case presentations, assigned teaching, and/or online group discussions. May be taken for credit up to four times. Students may not earn credit when course subtitles are the same.",
  "prerequsite": "restricted to master of finance program or by department stamp."
 },
 {
  "code": "MGTA 401",
  "title": "Professional Seminar",
  "unit": "1",
  "discription": "Discussion series where domain experts and business leaders present up-to-date research, discuss legal, privacy, and ethical issues, and provide professional skills development. S/U grades only. May be taken for credit two times.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 414",
  "title": "Web Data Analytics",
  "unit": "2",
  "discription": "This course focuses on collecting, drawing inference, and making business decisions based on data. It will cover tools such as Python, APIs, and NLP to collect, manipulate, and analyze data from the web and other sources, with the objective of making students data-savvy and comfortable with deriving insights from real-world, large data sets. Students will be exposed to the power of clickstream analysis and the possibilities that can be unleashed from industrial applications of web data analytics.",
  "prerequsite": null
 },
 {
  "code": "MGTA 415",
  "title": "Analyzing Unstructured Data",
  "unit": "4",
  "discription": "Unstructured data such as text, images, and video are routinely collected by companies and other organizations. The complex nature and scale of data such as this requires specialized analytics frameworks. In this course, we discuss and use tools that empower decision makers to extract actionable information from unstructured data.",
  "prerequsite": "MGTA 452."
 },
 {
  "code": "MGTA 451",
  "title": "Business Analytics in Marketing, Finance, and Operations",
  "unit": "4",
  "discription": "Business analytics projects should strive to create substantial value to an organization by solving impactful business problems. In this class, students will learn to identify business opportunities in the substantive areas of marketing, finance, and operations.",
  "prerequsite": "restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 452",
  "title": "Collecting and Analyzing Large Data",
  "unit": "4",
  "discription": "This course aims to provide students with an introduction to data analytics in R where the emphasis is more on business \"data\" than \"analytics.\" The emphasis is on collecting, handling, manipulating, and summarizing large data sets. Case studies are used throughout the course.",
  "prerequsite": "MGTA 451 and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 453",
  "title": "Business Analytics",
  "unit": "4",
  "discription": "This course is designed to help a business manager to use data to make good decisions in complex decision-making situations. Several analytical and econometric methods will be covered including decision analysis, regression analysis, optimization, and simulation.",
  "prerequsite": "MGTA 451 and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 454",
  "title": "Business Analytics Capstone Project",
  "unit": "4",
  "discription": "Students will pursue their capstone experience as part of a team to solve practical business problems faced by companies. Each team will work as external consultants on a project to create value for a client company. Student may not receive credit for both MGTA 454 and MGTA 454A or MGTA 454B.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 454A",
  "title": "Business Analytics Capstone Project I",
  "unit": "2",
  "discription": "Project-based course, in which students apply knowledge and methods acquired in their course work to a specific business analytics problem faced by a company. The project will be comprehensive in nature, allowing students to exhibit their acquired skills. Class meetings will be scheduled where teams will outline project goals, describe the available data and planned analyses, and present initial results. This course is part of a course series. An IP grade will be awarded at the end of the quarter. Final grade will not apply until the completion of MGTA 454B. Students may not receive credit for both MGTA 454A and MGTA 454.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 454B",
  "title": "Business Analytics Capstone Project II",
  "unit": "2",
  "discription": "Project-based course, in which students apply knowledge and methods acquired in their course work to a specific business analytics problem faced by a company. This is a continuation of MGTA 454A. Class meetings will be scheduled where teams will present their interim and final analysis results and outline how the partner company could use the project outcomes (e.g., a decision support tool) in decision-making. This course is part of a course series. Final grade will apply after the completion of MGTA 454B. Students may not receive credit for both MGTA454 and MGTA 454A or MGTA 454B.",
  "prerequsite": "MGTA 454A and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 455",
  "title": "Customer Analytics",
  "unit": "4",
  "discription": "Many firms have extensive information about customers' choices and how they react to marketing campaigns, but few have the expertise to efficiently act on such information. In this course, students will learn a scientific approach to marketing with hands-on use of technologies such as databases, analytics, and computing systems to collect, analyze, and act on customer information.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 456",
  "title": "Supply Chain Analytics",
  "unit": "4",
  "discription": "This course focuses on improving the performance of production and service operations, as well as supply chains, through the combination of data and analytical tools including statistics, forecasting, and optimization. Students will learn to employ analytics in capacity and distribution facility planning and contracting; how to determine data collection requirements for dynamic management of inventory levels; and how to improve revenue management under demand learning.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 457",
  "title": "Business Intelligence Systems",
  "unit": "2",
  "discription": "A decision support system consists of decision model, data, and user interface. This course covers the R and Shiny programming and design skills to develop a DSS that addresses a manager's decision-making needs.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 458",
  "title": "Experiments in Firms",
  "unit": "4",
  "discription": "Students will learn to design and run experiments to guide policy and business decisions. They will learn to distinguish between a correlation and a causal effect and also to critically evaluate causal claims based on nonexperimental data.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 459",
  "title": "Managerial Judgment and Decision-Making",
  "unit": "4",
  "discription": "Decision making is difficult with scarce resources, inexact information, and conflicting stakeholder agendas (i.e., most of the time). Students will use advanced behavioral research to gain a competitive advantage, by improving their decisions and their understanding of how others decide.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 460",
  "title": "Business Analytics Project Management",
  "unit": "2",
  "discription": "Many projects fail to produce valuable results, are over budget, or not finished on time. This course will teach students how to set and manage goals and expectations of the team and of the executive sponsors for business analytics projects.",
  "prerequsite": "MGTA 451, MGTA 452, MGTA 453, and restricted to MS in business analytics program or with department and instructor approval."
 },
 {
  "code": "MGTA 461",
  "title": "Web Mining and Recommender Systems",
  "unit": "4",
  "discription": "A graduate course devoted to current methods for recommender systems, data mining, and predictive analytics.",
  "prerequsite": null
 },
 {
  "code": "MGTA 462",
  "title": "Big Data Technology and Business",
  "unit": "4",
  "discription": "This course is designed to provide students with the skills and knowledge to manage large-scale and complex data for business applications. Students will learn how to handle large volumes of data through database systems and to use big data technologies to perform scalable analytics.",
  "prerequsite": null
 },
 {
  "code": "MGTA 479",
  "title": "Pricing Analytics",
  "unit": "4",
  "discription": "This class covers the key drivers for making data-driven pricing decisions. Price setting is one of the most crucial of all tactical marketing decisions. It involves a detailed understanding of both supply-side (e.g., costs) and demand-side factors (e.g., consumer willingness to pay). In this course, we will approach the pricing decision as an intersection of economic, strategic, and behavioral considerations.",
  "prerequsite": null
 },
 {
  "code": "MGTP 401",
  "title": "Professional Seminar",
  "unit": "1",
  "discription": "Professional Seminar presents current industry research, professional skills development, and industry experts and business leaders as speakers. S/U grades only. May be taken for credit two times.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 414",
  "title": "Business Law",
  "unit": "4",
  "discription": "Focuses on elements of business law that are essential for the basic management of business operations. Topics include the law of contracts, sales, partnership, corporations, securities, accountants' legal liability, and Sarbanes Oxley statutes.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 416",
  "title": "Ethics in Accounting and Business",
  "unit": "4",
  "discription": "Addresses ethical theories and critical thinking approaches to analyzing ethical issues. The course provides approaches for helping students make decisions when confronting ethical issues. ",
  "prerequsite": "restricted to MPAc students (major code RS91)."
 },
 {
  "code": "MGTP 421",
  "title": "Internal Control over Financial Reporting",
  "unit": "4",
  "discription": "Examines internal control from both an internal and external audit perspective, including control frameworks, improved information technology, role of corporate governance and audit committees, corporate risk management, SOX 404, internal auditing, and forensic auditing.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 422",
  "title": "Systems, Processes, and Technology for Accounting",
  "unit": "4",
  "discription": "This course helps students to see the connection between information systems and business performance. This course will also enable students to assess the opportunities and problems that managers in a wide range of organizations face as they attempt to use IT applications to add value to their business.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 424",
  "title": "Professional Research and Communication for Accountants",
  "unit": "4",
  "discription": "Introduces communication strategies to ensure effective communication to internal and external business and governmental audiences at all levels. Students will search and report on a range of technical topics from the professional/practitioner accounting literature.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 429",
  "title": "Advanced Topics in Accounting and Auditing",
  "unit": "4",
  "discription": "Covers advanced topics of special interest in accounting and auditing. May be taken for credit up to four times. Students may repeat course if topics vary significantly.",
  "prerequsite": "MGTP 432, restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 431",
  "title": "Not-for-profit and Government Accounting",
  "unit": "4",
  "discription": "Addresses issues faced in government and not-for-profit accounting. Students will gain insight into how and why these issues may have been resolved either similarly or differently from the for-profit business sector. Focus will be placed on how revenue and expense recognition, asset and liability valuation, the scope of the reporting entity, reporting cash flows, etc., differ in comparison to for-profit business accounting.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 432",
  "title": "Advanced Auditing and Forensic Accounting",
  "unit": "4",
  "discription": "Provides students with applied knowledge on how assurance professionals assess and evaluate assurance-related evidence and risks. Topics include strategic risk analysis, corporate governance, internal control assessments, audit sampling, modified audit reports, and fraud detection. ",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 433",
  "title": "Current Issues in the Practice and Regulation of Auditing",
  "unit": "4",
  "discription": "This course examines current issues facing private and public sector accounting institutions and their regulators, including the Public Company Accounting Oversight Board (PCAOB) and the U.S. Securities and Exchange Commission (SEC).",
  "prerequsite": "MGT 432, restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 434",
  "title": "Financial Statement Analysis",
  "unit": "4",
  "discription": "Examines tools and techniques to analyze a firm's financial position and performance. This course combines both accounting and finance in a practical framework for debt and equity valuation methods from both a conceptual and practical framework.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 441",
  "title": "Corporate Valuation and Forecasting",
  "unit": "4",
  "discription": "Applies economic and financial analysis techniques to forecast the firm's future performance and estimate the firm's intrinsic value. Emphasizes earnings management, profitability analysis, credit analysis, predicting financial distress, pro-forma business modeling, and industry analysis.",
  "prerequsite": "MGTP 434, restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 443",
  "title": "Global Taxation and Business Strategy",
  "unit": "4",
  "discription": "Examines corporate and tax strategies in an international context. Evaluates the effectiveness of global strategies, including the effects of tax treaties, cultures, political systems, foreign currency transactions, international licensing, reorganization of foreign corporations, and other current topics.",
  "prerequsite": "MGTP 434, restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 451",
  "title": "Accounting Data Analytics",
  "unit": "4",
  "discription": "This course focuses on developing a quantitative understanding of modern statistical and machine learning tools in their relationship to accounting, reporting, and compliance questions. Students will be introduced to publicly available databases and methods to combine and utilization information from various sources. Students are not expected to have prior coding experience when starting the course and will be given an introduction to common languages during the course.",
  "prerequsite": null
 },
 {
  "code": "MGTP 452",
  "title": "Strategic Cost Management and Technology",
  "unit": "4",
  "discription": "The course introduces students to conventional metrics to measure and decompose costs and presents a framework linking characteristics of the cost system to specific decisions ranging from short-term inventory to long-term investments.",
  "prerequsite": null
 },
 {
  "code": "MGTP 459",
  "title": "Special Topics in Taxation",
  "unit": "2 or 4",
  "discription": "Introduces special topics of taxation. Instructional methods can include lecture, case presentations, and group discussions. May be taken for credit up to two times.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGTP 495",
  "title": "Special Topic in Accounting",
  "unit": "2 or 4",
  "discription": "Advanced topics in accounting. Instructional methods include lecture, case discussions, and group assignments. May be taken for credit up to four times.",
  "prerequsite": "restricted to MPAc students (major code RS91) or by department approval."
 },
 {
  "code": "MGT 208A",
  "title": "Introduction to Management Research A",
  "unit": "4",
  "discription": "This is the first course in a three-course sequence that introduces students to the various methodologies and research paradigms employed in management research. This course covers fundamentals of empirical research methods, including research design, reliability and validity of measurements, theory building and hypothesis testing, and some history of science.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 208B",
  "title": "Introduction to Management Research B",
  "unit": "4",
  "discription": "Sequence introduces students to various management research and methodological paradigms, and discusses theory development, building, and validation approaches. Students with additional need for mathematical/analytical training may be asked to take additional courses that prepare for the rigors of the program.",
  "prerequsite": "MGT 208A."
 },
 {
  "code": "MGT 208C",
  "title": "Introduction to Management Research C",
  "unit": "4",
  "discription": "Sequence introduces students to various management research and methodological paradigms, and discusses theory development, building, and validation approaches. Students with additional need for mathematical/analytical training may be asked to take additional courses that prepare for the rigors of the program.",
  "prerequsite": "MGT 208B."
 },
 {
  "code": "MGT 225",
  "title": "Behavioral Economics",
  "unit": "4",
  "discription": "Introduction to formal and predictive approaches to incorporating behavioral regularities into economic theory. Covers developments in generalizing conventional economic models to allow patterns of behavior that appear to be common but are paradoxical for conventional models based on assumptions of rationality.",
  "prerequsite": "MGT 208A-B-C, ECON 200A-B-C."
 },
 {
  "code": "MGT 226",
  "title": "Theory of Industrial Organization and Business Strategy",
  "unit": "4",
  "discription": "This course provides the theoretical underpinnings of business strategy drawing from the body of literature in industrial organization. It will complement Department of Economics courses on industrial organization to provide depth in business strategy.",
  "prerequsite": "ECON 200A-B-C."
 },
 {
  "code": "MGT 227",
  "title": "Topics in Behavioral Economics Research",
  "unit": "4",
  "discription": "This course will explore two central themes. The first theme will focus on ways to translate scientific findings from behavioral economics into the real world. Students will discuss small changes that can make big differences in business and policy. The second theme will focus on how to design simple experiments to measure the impact of changes correctly, and the importance of understanding causality in behavioral interventions.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 228",
  "title": "Experiments in Organizations",
  "unit": "4",
  "discription": "The course focuses on the design and implementation of field experiments in companies, not for profits, and public institutions. We will cover a wide range of topics explored through experimentation including labor, human capital, health, energy, financial decision-making, marketing, pricing, public policy, and behavioral economics. Students will develop a proposal for partnering with an organization to implement an experiment.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 245",
  "title": "Theory of Technology and Operations Management",
  "unit": "4",
  "discription": "This course addresses classical operations management models in inventory and capacity planning and control leading up to models of supply chain and supplier relationship management.",
  "prerequsite": "MGT 208A-B-C, ECON 200A-B-C."
 },
 {
  "code": "MGT 246",
  "title": "Research in Management and Technology Strategy",
  "unit": "4",
  "discription": "This course covers the management of technology and innovation emphasizing product family design, market segmentation, technology selection, and product management.",
  "prerequsite": "MGT 208A-B-C, ECON 200A-B-C, MGT 245."
 },
 {
  "code": "MGT 248",
  "title": "Topics in Innovation and Operations Management Research",
  "unit": "4",
  "discription": "The course explores both traditional and contemporary topics in innovation and operations management. Students will be introduced to prior research in methodological topics like search theory, optimization, and dynamic programming; and in more applied topics like product and process design, management of supply chains, and inventory theory.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 249",
  "title": "Topics in Technology Strategy and Information Systems Research",
  "unit": "4",
  "discription": "The course explores both traditional and contemporary topics in technology strategy and information systems. Students will be introduced to both analytical formal models of topics in information systems such as network effects and software security, and will explore empirical studies that examine the role of IT in enabling organizational competitiveness.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 255",
  "title": "Psychology and Decision Making",
  "unit": "4",
  "discription": "This course introduces students to theories and research in the field of individual judgment and decision making. Topics include judgment under uncertainty, the psychology of risk, choice, decision framing, prospect theory, mental accounting, context effects, task effects, and regret.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 256",
  "title": "Consumer Behavior Research",
  "unit": "4",
  "discription": "This course covers concepts and theories useful in understanding and researching the behaviors of consumers. Sample topics include attitude formation and change, social influence and persuasion, communication, consumer decision making and judgment, and consumer knowledge.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 257",
  "title": "Behavior in Organizations",
  "unit": "4",
  "discription": "Theories/research about behavior of employees/managers in organizations, as individuals and in groups. Topics include motivation, design of incentive/compensation systems, impact of goals/objectives, managerial judgment/decision making, evaluation judgments, managing reactions to change, and group decision making.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 258",
  "title": "Topics in Social Psychology",
  "unit": "4",
  "discription": "This course introduces students to theories and research in the field of social psychology. Selected topics include cooperation and altruism, emotion, empathy, morality, power and social hierarchy, prejudice and discrimination, relationships, self and identity, social influence, and social judgment.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 259",
  "title": "Topics in Management",
  "unit": "4",
  "discription": "An in-depth analysis of classic and current research on selected topics in the field of management. Example topics include affect, culture, creativity, emotional intelligence, emotional labor, gender dynamics, groups and teams, justice, power and politics, and rationality.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 260",
  "title": "Quantitative Methods in Marketing",
  "unit": "4",
  "discription": "This course applies methods from econometrics and computer science to estimate consumers’ preferences and inform firm decisions. Sample topics include estimating econometric models with large data, using Natural Language Processing (NLP) and computer vision modeling to solve business problems.",
  "prerequsite": "ECON 200A; ECON 220A; admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 262",
  "title": "Topics in Marketing Research",
  "unit": "4",
  "discription": "This course will discuss key papers and findings in the marketing literature to make the students experts in the field. The course will require students to build on the papers discussed and to prepare students for their independent research.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 285",
  "title": "Financial Economics",
  "unit": "4",
  "discription": "This course covers the basic concepts and important models used in finance research. The subjects include expected utility theories, stochastic dominance, portfolio math, mean-variance theory, CAPM, aggregation theorems, arbitrages, and arbitrage pricing.",
  "prerequsite": "ECON 220A-B-C; admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 286",
  "title": "Continuous-Time Finance",
  "unit": "4",
  "discription": "This course covers most powerful tools in finance, i.e., which are finance models in continuous-time setting. The subjects include dynamic portfolio selection, derivative pricing, dynamic term structure, and dynamic equilibrium models. Students may not earn academic credit for both MGTF 411 and MGT 286; these are course duplicates.",
  "prerequsite": "MGT 285; admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 287",
  "title": "Empirical Finance",
  "unit": "4",
  "discription": "This course covers econometric methods including the linear regression model, serial correlation, hypothesis testing, timer series analysis, and estimation of discrete choice and simultaneous equation models.",
  "prerequsite": "MGT 285; admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 289",
  "title": "Topics in Financial Economics Research",
  "unit": "4",
  "discription": "This course will cover a rotating set of topics, chosen by the instructor, to introduce students to cutting-edge research in various areas of financial economics. Possible areas include dynamic (continuous-time) asset pricing theory, empirical and theoretical corporate finance, macro-finance, household and intermediary finance, and market microstructure and informational economics.",
  "prerequsite": "admission to management PhD program or by consent of instructor."
 },
 {
  "code": "MGT 293A",
  "title": "Literature Review and Critique Paper",
  "unit": "4",
  "discription": "This course will require the student to identify and critique the research literature in a particular area identified during the summer of first year. The student will write a review paper that identifies opportunities for further research.",
  "prerequsite": "none."
 },
 {
  "code": "MGT 293B",
  "title": "Literature Review and Critique Presentation",
  "unit": "4",
  "discription": "In this course, the student will continue work on the literature review and prepare a presentation of the gaps and opportunities identified in the literature.",
  "prerequsite": "MGT 293A."
 },
 {
  "code": "MGT 293C",
  "title": "Original Research Paper",
  "unit": "4",
  "discription": "In this course, the student will work on identifying and developing an original research problem based on the gaps identified in the literature review courses.",
  "prerequsite": "MGT 291, MGT 292, MGT 293B."
 },
 {
  "code": "MGT 293D",
  "title": "Original Research Presentation",
  "unit": "4",
  "discription": "In this course, the student will continue work on the original research problem and prepare a presentation that will prepare for candidacy.",
  "prerequsite": "MGT 292, MGT 293C."
 },
 {
  "code": "MGT 296",
  "title": "Dissertation",
  "unit": "4–12",
  "discription": "This course is taken by students actively working on their dissertation after advancing to candidacy.",
  "prerequsite": null
 },
 {
  "code": "MGT 299",
  "title": "Advanced Field Advising",
  "unit": "4",
  "discription": "Each student who has not advanced to candidacy by June of the third year must enroll in and complete MGT 299 during the fall, winter, and spring quarters of the fourth year.",
  "prerequsite": "admission to management PhD program."
 }
]