[
 {
  "code": "MMW 11",
  "title": "Prehistory and Ancient Foundations",
  "unit": "4",
  "discription": "MMW 11 explores human origins, the development of social organization, the strategies early peoples and societies used to negotiate their physical and social environments, and the rise of the ancient world’s classical traditions (to ca. 100 BCE). Open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 1 and MMW 11. Must be taken for a letter grade to meet the requirement. (F)",
  "prerequsite": null
 },
 {
  "code": "MMW 12",
  "title": "Classical and Medieval Traditions",
  "unit": "6",
  "discription": "Covering ca. 100 BCE to 1200 CE, MMW 12 examines the development of classical empires from China to the West, their collapse, and their transformation into distinct medieval forms. It also examines the rise and spread of Christianity, Islam, and Mahayana Buddhism. This course is the first of two writing- intensive quarters in the MMW sequence.",
  "prerequsite": "satisfaction of the Entry Level Writing Requirement. Open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 12, which is the first writing-intensive six-credit course in the new MMW sequence, and MMW 2, which was the first writing-intensive course in the original MMW sequence. Must be taken for a letter grade to meet the requirement. (W)"
 },
 {
  "code": "MMW 13",
  "title": "New Ideas and Cultural Encounters",
  "unit": "6",
  "discription": "MMW 13 provides a framework for understanding developments in the global past from 1200 CE to 1750 CE and the transition from the medieval to the early modern world. This course is the second of two writing-intensive quarters in the MMW sequence.",
  "prerequsite": "completion of MMW 12 or MMW 2. Open to Eleanor Roosevelt College students only. Students may not receive credit for MMW 13, which is the second writing-intensive six-credit course in the new MMW sequence, and MMW 3, which is the second writing-intensive six-credit course in the original MMW sequence. Must be taken for a letter grade to meet the requirement. (S)"
 },
 {
  "code": "MMW 14",
  "title": "Revolution, Industry, and Empire",
  "unit": "4",
  "discription": "This course examines the great changes in European society occurring from the late seventeenth century to the time of the Russian Revolution and considers the impact of those changes on the non-Western world. Topics include absolutist states and the Enlightenment, the French and American Revolutions, industrialization, the rise of nationalism and the nation-state, mass politics, Western imperialism, and the colonial experience. Developments in non-Western countries during this period will be examined from their own internal perspectives.",
  "prerequsite": "completion of MMW 12 or MMW 2; and completion of MMW 13 or MMW 3; open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 14 and MMW 5. Must be taken for a letter grade to meet the requirement. (F,W,Su)"
 },
 {
  "code": "MMW 15",
  "title": "Twentieth Century and Beyond",
  "unit": "4",
  "discription": "This course begins with a consideration of the causes and consequences of World War I, and then looks at the postwar crisis of liberal values and institutions. It addresses the deepening crisis in the 1930s, especially evident in the emergence of ideological politics and extreme nationalism in the context of worldwide depression. That period provides the background for understanding World War II. Attention is then devoted to the Cold War, the competition between capitalism and communism, and the process of decolonization. The course ends with a discussion of the collapse of communism and the emergence of a new world order (or disorder).",
  "prerequsite": "completion of MMW 12 or MMW 2; and completion of MMW 13 or MMW 3; open to Eleanor Roosevelt College students only. Students may not receive credit for both MMW 15 and MMW 6. Must be taken for a letter grade to meet the requirement. (S,Su)"
 },
 {
  "code": "MMW 121",
  "title": "Exploring the Premodern World",
  "unit": "4",
  "discription": "MMW 121, the first of two required courses for ERC transfer students, addresses themes and topics from the premodern world (from antiquity to the eighteenth century) and strengthens students’ analytical, research, and writing skills. Students may not receive credit for MMW 21 and 121. Students who previously took MMW 21 and received a grade of D or F should contact Eleanor Roosevelt College academic advising for guidance.",
  "prerequsite": "open to Eleanor Roosevelt College transfer students only. Must be taken for a letter grade to meet the requirement. (F,Su)"
 },
 {
  "code": "MMW 122",
  "title": "Exploring the Modern World",
  "unit": "4",
  "discription": "MMW 122, the second of two required courses for ERC transfer students, addresses specific themes and topics from the modern world (from the eighteenth century to the present) and strengthens transfer students’ analytical, research, and writing skills. Students may not receive credit for MMW 22 and 122. Students who previously took MMW 22 and received a grade of D or F should contact Eleanor Roosevelt College academic advising for guidance.",
  "prerequsite": "open to Eleanor Roosevelt College transfer students only. Must be taken for a letter grade to meet the requirement. (W,Su)"
 }
]