[
 {
  "code": "MUS 1A",
  "title": "Fundamentals of Music A",
  "unit": "4",
  "description": "This course, first in a three-quarter sequence, is primarily intended for students without previous musical experience. It introduces music notation and basic music theory topics such as intervals, scales, keys, and chords, as well as basic rhythm skills.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 1B",
  "title": "Fundamentals of Music B",
  "unit": "4",
  "description": "This course, second in a three-quarter sequence, focuses on understanding music theory and in developing musical ability through rhythm, ear training, and sight singing exercises. Topics include major and minor scales, seventh- chords, transposition, compound meter and rudiments of musical form.",
  "prerequisite": "MUS 1A."
 },
 {
  "code": "MUS 1C",
  "title": "Fundamentals of Music C",
  "unit": "4",
  "description": "This course, third in a three-quarter sequence, offers solid foundation in musical literacy through exercises such as harmonic and melodic dictation, sight singing exercises and rhythm in various meters. Topics include complex rhythm, harmony, and basic keyboard skills.",
  "prerequisite": "MUS 1B."
 },
 {
  "code": "MUS 2A-B-C",
  "title": "Basic Musicianship",
  "unit": "4-4-4",
  "description": "Primarily intended for music majors. Development of basic skills: perception and notation of pitch and temporal relationships. Introduction to functional harmony. Studies in melodic writing. Drills in sight singing, rhythmic reading, and dictation.",
  "prerequisite": "passing score on proficiency exam. Must be taken in sequence. Music majors must be concurrently enrolled in MUS 2AK, 2BK, and 2CK (Basic Keyboard)."
 },
 {
  "code": "MUS 2AK-BK-CK",
  "title": "Basic Keyboard",
  "unit": "2-2-2",
  "description": "Scales, chords, harmonic progressions, transposition, and simple pieces.",
  "prerequisite": "concurrent enrollment in MUS 2A, B, C."
 },
 {
  "code": "MUS 2JK",
  "title": "Jazz Keyboard",
  "unit": "2",
  "description": "This course will introduce basic voicings and voice leading, stylistically appropriate accompaniment, and basic chord substitution. For majors with a Jazz and the Music of the African diaspora emphasis to be taken concurrently with MUS 2C.",
  "prerequisite": "MUS 2AK and 2BK or passing proficiency exam, or consent of instructor. Concurrent enrollment in MUS 2C. Majors only."
 },
 {
  "code": "MUS 4",
  "title": "Introduction to Western Music",
  "unit": "4",
  "description": "A brief survey of the history of Western music from the Middle Ages to the present. Much attention will be paid to the direct experience of listening to music and attendance of concerts. Class consists of lectures, listening labs, and live performances.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 5",
  "title": "Sound in Time",
  "unit": "4",
  "description": "An examination and exploration of the art and science of music making. Topics include acoustics, improvisation, composition, and electronic and popular forms. There will be required listening, reading, and creative assignments. No previous musical background required.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 6",
  "title": "Electronic Music",
  "unit": "4",
  "description": "Lectures and listening sessions devoted to the most significant works of music realized through the use of computers and other electronic devices from the middle of this century through the present.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 7",
  "title": "Music, Science, and Computers",
  "unit": "4",
  "description": "Exploration of the interactions among music, science, and technology, including the history and current development of science and technology from the perspective of music.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 8",
  "title": "American Music: Jazz Cultures",
  "unit": "4",
  "description": "Jazz is one of the primary foundations for American music in the twentieth and twenty-first centuries. This course highlights the multicultural and international scope of jazz by taking a thematic rather than a chronological approach to the subject, and by highlighting the music and lives of a diverse array of jazz practitioners from around the country and around the world. Students may not receive credit for both MUS 8 and MUS 8GS.",
  "prerequisite": "none. (Offered in selected years.)"
 },
 {
  "code": "MUS 9",
  "title": "Symphony",
  "unit": "4",
  "description": "The symphonic masterworks course will consist of lectures and listening sessions devoted to a detailed discussion of a small number of recognized masterworks (e.g., Mozart, Beethoven, Berlioz, Stravinsky, Ligeti, etc.).",
  "prerequisite": "none. (Offered in selected years.)"
 },
 {
  "code": "MUS 11",
  "title": "Folk Music",
  "unit": "4",
  "description": "A course on folk music of the world, covered through lectures, films, and listening sessions devoted to detailed discussion of music indigenous to varying countries/areas of the world. Topics vary from year to year. May be repeated once for credit.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 12",
  "title": "Opera",
  "unit": "4",
  "description": "A study of opera masterworks that often coincide with operas presented in the San Diego Opera season. Class consists of lectures, listening labs, live performances, and opera on video.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 13",
  "title": "Worlds of Music",
  "unit": "4",
  "description": "Through surveying selected musical traditions and practices from around the world, this course explores the ways in which music both reflects and affects social, cultural, and ecological relationships. Specific case studies will be covered through lectures, films, and listening sessions.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 14",
  "title": "Contemporary Music",
  "unit": "4",
  "description": "This course offers opportunities to prepare oneself for experiences with new music (through preview lectures), hear performances (by visiting or faculty artists), to discuss each event informally with a faculty panel: an effort to foster informed listening to the new in music.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 15",
  "title": "Popular Music",
  "unit": "4",
  "description": "A course on popular music from different time periods, covered through lectures, films, and listening sessions. Topics vary from year to year. May be repeated once for credit.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 16",
  "title": "The Beatles",
  "unit": "4",
  "description": "This course will explore The Beatles from musical, cultural, historical, technological, and critical angles. It will place them in context, examining their assorted confluences and wide influences. The group will be critically examined as artists, innovators, and public personalities. Listening, watching, and discussion will provide a broader, deeper, and more personal understanding of the group's enduring appeal.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 17",
  "title": "Hip-Hop",
  "unit": "4",
  "description": "This class presents a broad chronological overview of the development of hip- hop as a musical form from the late 1970s through today. It examines the development of the style in relation to direct context and to earlier African American musical and cultural forms and considers the technological and legal issues that have impacted its development. The class is listening intensive and students will be expected to know and recognize essential structures and production techniques.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 18",
  "title": "Klezmer Music",
  "unit": "4",
  "description": "A survey of Eastern European Jewish folk music, Yiddish theatre and popular song, and their transition to America. Credit not allowed for MUS 18 and JUDA 18. (Cross-listed with JUDA 18.)",
  "prerequisite": "none."
 },
 {
  "code": "MUS 19",
  "title": "Blacktronika: Afrofuturism in Electronic Music",
  "unit": "4",
  "description": "Explores the lineage of electronic music's Black pioneers, who have been integral but overlooked in the discussion around the creation and development of house, techno, drum and bass, and experimental music. These musics were developed with sociopolitical movements at the foundation of the sounds. We will investigate the African diaspora lens through the artists' usage of science fiction, technology, and futurist ideologies.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 20",
  "title": "Exploring the Musical Mind",
  "unit": "4",
  "description": "How do we transform complex sounds into comprehensible and meaningful music? What physiological, neurological, cognitive, and cultural systems are involved? Why do we make music in such diverse ways around the globe? Does music have evolutionary or ecological significance? What is the relationship between music, motion, and emotions? This course explores contemporary understandings of how we hear and how we become musical and invites students to listen to new music in new ways. Students may not receive credit for both MUS 20 and COGS 20. (Cross-listed with COGS 20.)",
  "prerequisite": "none."
 },
 {
  "code": "MUS 32",
  "title": "Instrumental/Vocal Instruction",
  "unit": "2",
  "description": "Individual instruction on intermediate level in instrumental technique and repertory. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course. May be taken six times for credit.",
  "prerequisite": "audition and department stamp."
 },
 {
  "code": "MUS 32G",
  "title": "Group Instrumental Instruction",
  "unit": "2",
  "description": "Group instruction in instrumental or vocal technique and repertory. Intermediate level. Intended for students who make an important contribution to Department of Music ensembles.",
  "prerequisite": "written recommendation of ensemble director and audition for performance faculty on first day of classes required. Department stamp required. May be taken for credit six times. (Offered in selected years.)"
 },
 {
  "code": "MUS 32V",
  "title": "Vocal Instruction",
  "unit": "1",
  "description": "Individual instruction on intermediate level in vocal technique and repertory. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course and in MUS 32VM. May be taken six times for credit.",
  "prerequisite": "audition and department stamp."
 },
 {
  "code": "MUS 32VM",
  "title": "Vocal Master Class",
  "unit": "1",
  "description": "All students enrolled in voice lessons (32V, 132V, or 132C) perform for one another and their instructors. Students critique in-class performances, with emphasis on presentation, diction, dramatic effect, vocal quality, and musicality.",
  "prerequisite": "concurrent enrollment in MUS 32V, 132V, or 132C."
 },
 {
  "code": "MUS 33A",
  "title": "Introduction to Composition I",
  "unit": "4",
  "description": "First course in a sequence for music majors and nonmajors pursuing an emphasis in composition. The course examines “sound” itself and various ways of building sounds into musical structures and develops skills in music notation. Students compose solo pieces in shorter forms. Students may not receive credit for both MUS 33 and 33A.",
  "prerequisite": "MUS 2C or consent of instructor."
 },
 {
  "code": "MUS 33B",
  "title": "Introduction to Composition II",
  "unit": "4",
  "description": "Second part of course sequence for students pursuing a composition emphasis. Course continues the building of skills with the organization of basic compositional elements: pitch, rhythm, and timbre. It explores issues of musical texture, expression, and structure in traditional and contemporary repertoire. Writing for two instruments in more extended forms.",
  "prerequisite": "MUS 33A."
 },
 {
  "code": "MUS 33C",
  "title": "Introduction to Composition III",
  "unit": "4",
  "description": "Third part of course sequence for students pursuing a composition emphasis. Course continues the development of skills in instrumentation and analysis. It includes a survey of advanced techniques in contemporary composition, with additional focus on notation, part-preparation, and the art of writing for small groups of instruments.",
  "prerequisite": "MUS 33B."
 },
 {
  "code": "MUS 43",
  "title": "Department Seminar",
  "unit": "1",
  "description": "The department seminar serves both as a general department meeting and as a forum for the presentation of research and performances by visitors, faculty, and students. Required of all undergraduate music and music humanities majors every quarter a student is a declared music major. Four units or four quarters of enrollment are required of all undergraduate ICAM music majors who choose the MUS 43. Department Seminar option for their Visitor Series requirement. P/NP grades only. May be taken for credit up to twelve times.",
  "prerequisite": null
 },
 {
  "code": "MUS 80",
  "title": "Special Topics in Music",
  "unit": "1-4 ",
  "description": "This course presents selected topics in music and consists of lecture and listening sessions. No prior technical knowledge is necessary. The course will be offered during summer session.",
  "prerequisite": null
 },
 {
  "code": "MUS 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "MUS 95",
  "title": "Ensemble Performance",
  "unit": "2",
  "description": "Performance in an ensemble appropriate to student abilities and interests. Normally each section requires student participation for the whole academic year, with credit for participation each quarter. Sections of MUS 95W have included: African drumming, Korean percussion, Indian sitar and tabla, koto, and Indonesian flute. Not all sections will be offered every year. May be repeated for credit. Grading on participation level, individual testing, comparative papers on repertoire covered, etc.",
  "prerequisite": "audition and consent of instructor for each section. Materials fee required."
 },
 {
  "code": "MUS 101A",
  "title": "Music Theory and Practice I",
  "unit": "4",
  "description": "Study of modal counterpart in the style of the sixteenth century. Two-voice species counterpoint studies. Analysis of music of the period. Musicianship studies: sight-singing, dictation, and keyboard skills.",
  "prerequisite": "MUS 2C and 2CK."
 },
 {
  "code": "MUS 101B",
  "title": "Music Theory and Practice II",
  "unit": "4",
  "description": "Study of tonal harmony and counterpoint. Analysis of Bach chorales and other music from the Baroque period. Musicianship studies: sight-singing, dictation, and keyboard skills.",
  "prerequisite": "MUS 2C."
 },
 {
  "code": "MUS 101C",
  "title": "Music Theory and Practice III",
  "unit": "4",
  "description": "Tonal harmony and counterpoint. Analysis of larger classical forms: Sonata, Variation, Minuet and Trio, Rondo. Musicianship studies: sight-singing, dictation, and keyboard skills.",
  "prerequisite": "MUS 101B."
 },
 {
  "code": "MUS 102",
  "title": "Topics in Music Theory",
  "unit": "4",
  "description": "Selected topics in music theory. Covers Western classical repertoire from 1850 to the present. Includes chromatic and post-tonal harmony, formal analysis. May be taken for credit up to two times.",
  "prerequisite": "MUS 101B."
 },
 {
  "code": "MUS 103A",
  "title": "Seminar in Composition I",
  "unit": "4",
  "description": "First part in composition course sequence. Individual projects will be reviewed in seminar. Techniques of instrumentation will be developed through examination of scores and creative application. Assignments will include short exercises and analysis, and final project for standard ensemble.",
  "prerequisite": "MUS 33C."
 },
 {
  "code": "MUS 103B",
  "title": "Seminar in Composition II",
  "unit": "4",
  "description": "Second part in composition course sequence. Intensive work in free composition by drafting a composition for presentation at the end of MUS 103C. Written analysis of contemporary repertoire is introduced. Instruction about calligraphic conventions including computer engraving programs.",
  "prerequisite": "MUS 103A."
 },
 {
  "code": "MUS 103C",
  "title": "Seminar in Composition III",
  "unit": "4",
  "description": "Third part in composition course sequence. A mixture of individual lessons as well as group meetings, with discussion of topics germane to the development of composers, including musical aesthetics and contemporary orchestration techniques. Final performance of students' work will take place at the end of the quarter.",
  "prerequisite": "MUS 103B."
 },
 {
  "code": "MUS 103D-E-F",
  "title": "Honors Seminar in Composition",
  "unit": "4-4-4",
  "description": "Advanced individual projects for senior music majors pursuing honors in composition. Projects will be critically reviewed in seminar with fellow students and faculty composers.",
  "prerequisite": "MUS 103A-B-C and admission into the Department of Music Honors Program in composition. Department stamp required."
 },
 {
  "code": "MUS 105",
  "title": "Jazz Composition",
  "unit": "4",
  "description": "This course will explore a range of compositional possibilities from song forms to modal and more extended forms. May be taken for credit two times.",
  "prerequisite": "MUS 101A and 101B or consent of instructor."
 },
 {
  "code": "MUS 106",
  "title": "Topics in Musical Analysis",
  "unit": "4",
  "description": "Topics in musical analysis. Covers full range of musical repertoire 1900 to present, including music that does not depend on notation. May be taken for credit up to two times.",
  "prerequisite": "MUS 2C."
 },
 {
  "code": "MUS 107",
  "title": "Critical Studies Seminar",
  "unit": "4",
  "description": "This seminar explores the history of music in relation to critical issues, such as race, gender, sexuality, the environment, and politics. Readings include recent literature in cultural studies, musicology, and sociology. Topics vary. May be taken three times for credit.",
  "prerequisite": "MUS 120C."
 },
 {
  "code": "MUS 110",
  "title": "Introduction to Ethnomusicology Seminar",
  "unit": "4",
  "description": "This seminar introduces the central theories, methods, and approaches used to study the music of contemporary cultures, in their local contexts. In addition to surveying key writings, students will document music from their local environment.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MUS 111",
  "title": "Topics/World Music Traditions",
  "unit": "4",
  "description": "A study of particular regional music in their repertory, cultural context, and interaction with other traditions. Topics vary. May be taken for credit up to three times.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 112",
  "title": "Topics in European Music Before 1750",
  "unit": "4",
  "description": "This course will address topics in medieval, Renaissance, and Baroque music; topics will vary from year to year. May be repeated five times for credit.",
  "prerequisite": "knowledge of music notation or consent of instructor; MUS 4, 8-10, or 120 recommended."
 },
 {
  "code": "MUS 113",
  "title": "Topics in Classic, Romantic, and Modern Music",
  "unit": "4",
  "description": "This course will focus on Western music between 1750 and the early twentieth century; topics will vary from year to year. May be repeated five times for credit.",
  "prerequisite": "knowledge of music notation or consent of instructor; MUS 4, 8-10, or 120 recommended."
 },
 {
  "code": "MUS 114",
  "title": "Music of the Twentieth Century",
  "unit": "4",
  "description": "An exploration of materials and methods used in the music of our time. There will be an extra discussion group for music majors. May be repeated once for credit.",
  "prerequisite": "none."
 },
 {
  "code": "MUS 115",
  "title": "Women in Music",
  "unit": "4",
  "description": "A survey of the biographical, historical, sociological, and political issues affecting woman musicians, their creativity, their opportunities, and their perception by others. It compares and contrasts the work of women composers, performers, patrons, teachers, and writers on music from the Middle Ages through the present.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 116",
  "title": "Popular Music Studies Seminar",
  "unit": "4",
  "description": "This course examines special topics in popular music from various sociopolitical, aesthetic, and performance perspectives. Readings include recent literature in cultural studies, musicology, and/or performance practice. Topics vary. May be taken three times for credit.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MUS 120A",
  "title": "History of Music in Western Culture I",
  "unit": "4",
  "description": "First part of intensive historical, analytical, and cultural-aesthetic examination of music in Western culture from the ninth through the twenty- first centuries. Considers both sacred and secular repertories, from Gregorian chant through early opera, c. 800-1600.",
  "prerequisite": "MUS 1C or 2C or passing grade on proficiency exam. Music majors should be enrolled concurrently in MUS 101A. Department stamp required for nonmajors."
 },
 {
  "code": "MUS 120B",
  "title": "History of Music in Western Culture II",
  "unit": "4",
  "description": "Second part of intensive historical, analytical, and cultural-aesthetic examination of music in Western culture from the ninth through the twenty- first centuries. Considers both instrumental and vocal repertories, from the Baroque to the Romantic, c. 1600-1830.",
  "prerequisite": "MUS 120A. Music majors should be enrolled concurrently in MUS 101B. Department stamp required for nonmajors."
 },
 {
  "code": "MUS 120C",
  "title": "History of Music in Western Culture III",
  "unit": "4",
  "description": "Third part of intensive historical, analytical, and cultural-aesthetic examination of music in Western culture from the ninth through the twenty- first centuries. Considers both established traditions and new trends, from Romanticism through Modernism and Postmodernism, c. 1890-present.",
  "prerequisite": "MUS 120B. Music majors should be enrolled concurrently in MUS 101C. Department stamp required for nonmajors."
 },
 {
  "code": "MUS 126",
  "title": "Blues: An Oral Tradition",
  "unit": "4",
  "description": "This course will examine the development of the Blues from its roots in work- songs and the minstrel show to its flowering in the Mississippi Delta to the development of Urban Blues and the close relationship of the Blues with Jazz, Rhythm and Blues, and Rock and Roll. (Cross-listed with ETHN 178.)",
  "prerequisite": "none."
 },
 {
  "code": "MUS 127",
  "title": "Discover Jazz",
  "unit": "4",
  "description": "Offers an introduction to jazz, including important performers and their associated styles and techniques. Explores the often-provocative role jazz has played in American and global society, the diverse perceptions and arguments that have surrounded its production and reception, and how these have been inflected by issues of race, class, gender, and sexuality. Specific topics vary from year to year. (Cross-listed with ETHN 179.)",
  "prerequisite": "none."
 },
 {
  "code": "MUS 128",
  "title": "Principles and Practice of Conducting",
  "unit": "4",
  "description": "The theory and practice of instrumental and/or choral conducting as they have to do with basic baton techniques, score reading, interpretation, orchestration, program building, and functional analysis. Members of the class will be expected to demonstrate their knowledge in the conducting of a small ensemble performing literature from the eighteenth, nineteenth, and twentieth centuries.",
  "prerequisite": "MUS 2A-B-C and 101A-B-C. Department stamp required."
 },
 {
  "code": "MUS 130",
  "title": "Chamber Music Performance",
  "unit": "2-4/0",
  "description": "Instruction in the preparation of small group performances of representative instrumental and vocal chamber music literature. May be taken for credit six times, after which students must enroll for zero units.",
  "prerequisite": "consent of instructor through audition."
 },
 {
  "code": "MUS 131",
  "title": "Advanced Improvisation Performance",
  "unit": "4/0",
  "description": "Master class instruction in advanced improvisation performance for declared majors and minors only or consent of instructor. Audition required at first class meeting. May be repeated six times for credit.",
  "prerequisite": "consent of instructor through audition. Department stamp required."
 },
 {
  "code": "MUS 132",
  "title": "Proseminar in Music Performance",
  "unit": "4",
  "description": "Individual or master class instruction in advanced instrumental performance. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course. May be taken six times for credit.",
  "prerequisite": "audition and department stamp."
 },
 {
  "code": "MUS 132C",
  "title": "Vocal Coaching",
  "unit": "4",
  "description": "Individual instruction in advanced vocal coaching. Emphasis placed on diction and musical issues. For declared music majors and minors. Students must be simultaneously enrolled in the Vocal Master Class, MUS 32VM. May be taken six times for credit.",
  "prerequisite": "at least one quarter of MUS 132V and consent of instructor. Department stamp required."
 },
 {
  "code": "MUS 132R",
  "title": "Recital Preparation",
  "unit": "4",
  "description": "Advanced instrumental/vocal preparation for senior music majors pursuing honors in performance. Repertoire for a solo recital will be developed under the direction of the appropriate instrumental/vocal faculty member. Special audition required during Welcome Week preceding fall quarter.",
  "prerequisite": "by audition only; MUS 132. Department stamp required."
 },
 {
  "code": "MUS 132V",
  "title": "Proseminar in Vocal Instruction",
  "unit": "4",
  "description": "Individual instruction in advanced vocal performance. For declared music majors and minors. Students must be simultaneously enrolled in a performance ensemble or nonperformance music course and in the Vocal Master Class, MUS 32VM. May be taken six times for credit.",
  "prerequisite": "audition and department stamp."
 },
 {
  "code": "MUS 133",
  "title": "Projects in New Music Performance",
  "unit": "4",
  "description": "Performance of new music of the twentieth century. Normally offered winter quarter only. Required a minimum of one time for all music majors. May be taken two times for credit.",
  "prerequisite": "consent of instructor through audition."
 },
 {
  "code": "MUS 134",
  "title": "Symphonic Orchestra",
  "unit": "4",
  "description": "Repertoire is drawn from the classic symphonic literature of the eighteenth, nineteenth, and twentieth centuries with a strong emphasis on recently composed and new music. Distinguished soloists, as well as The La Jolla Symphony Chorus, frequently appear with the orchestra. The La Jolla Symphony Orchestra performs two full-length programs each quarter, each program being performed twice. May be repeated six times for credit.",
  "prerequisite": "audition and department stamp required."
 },
 {
  "code": "MUS 137A",
  "title": "Jazz Theory and Improvisation",
  "unit": "4",
  "description": "Study of jazz theory and improvisation, focused on fundamental rhythmic, harmonic, melodic, and formal aspects of modern jazz style. Application of theoretical knowledge to instruments and concepts will be reinforced through listening, transcription work, and composition and improvisation exercises. First course of a yearlong sequence.",
  "prerequisite": "MUS 2A-B-C, proficiency exam, or consent of instructor."
 },
 {
  "code": "MUS 137B",
  "title": "Jazz Theory and Improvisation",
  "unit": "4",
  "description": "Study of jazz theory and improvisation, focused on fundamental rhythmic, harmonic, melodic, and formal aspects of modern jazz style. Application of theoretical knowledge to instruments and concepts will be reinforced through listening, transcription work, and composition and improvisation exercises. Second course of a yearlong sequence; continuation of MUS 137A.",
  "prerequisite": "MUS 137A or consent of instructor."
 },
 {
  "code": "MUS 137C",
  "title": "Jazz Theory and Improvisation",
  "unit": "4",
  "description": "Study of jazz theory and improvisation, focused on fundamental rhythmic, harmonic, melodic, and formal aspects of modern jazz style. Application of theoretical knowledge to instruments and concepts will be reinforced through listening, transcription work, and composition and improvisation exercises. Third course of a yearlong sequence; continuation of MUS 137B.",
  "prerequisite": "MUS 137B or consent of instructor."
 },
 {
  "code": "MUS 137D",
  "title": "Seminar in Jazz Studies I",
  "unit": "4",
  "description": "Advanced individual projects for senior music majors pursuing honors in jazz and music of the African diaspora. Projects will be critically reviewed in seminar with fellow students and jazz faculty. First course of a yearlong sequence.",
  "prerequisite": "MUS 137A-B-C and admission into the Music Department Honors Program in jazz. Department stamp required."
 },
 {
  "code": "MUS 137E",
  "title": "Seminar in Jazz Studies II",
  "unit": "4",
  "description": "Advanced individual projects for senior music majors pursuing honors in jazz and music of the African diaspora. Projects will be critically reviewed in seminar with fellow students and jazz faculty. Second course of a yearlong sequence; continuation of 137D.",
  "prerequisite": "MUS 137D and department stamp."
 },
 {
  "code": "MUS 137F",
  "title": "Seminar in Jazz Studies III",
  "unit": "4",
  "description": "Advanced individual projects for senior music majors pursuing honors in jazz and music of the African diaspora. Projects will be critically reviewed in seminar with fellow students and jazz faculty. Third course of a yearlong sequence; continuation of 137E.",
  "prerequisite": "MUS 137E and department stamp."
 },
 {
  "code": "MUS 143",
  "title": "Department Seminar",
  "unit": "1",
  "description": "The department seminar serves both as a general department meeting and as a forum for the presentation of research and performances by visitors, faculty, and students. Required of all undergraduate music majors every quarter.",
  "prerequisite": null
 },
 {
  "code": "MUS 151",
  "title": "Race, Culture, and Social Change",
  "unit": "4",
  "description": "Aggrieved groups generate distinctive cultural expressions by turning negative ascription into positive affirmation and by transforming segregation into congregation. This course examines the role of cultural expressions in struggles for social change by these communities inside and outside the United States. (Cross-listed with ETHN 108.)",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MUS 152",
  "title": "Hip Hop: The Politics of Culture",
  "unit": "4",
  "description": "Examination of hip-hop's music, technology, lyrics, and its influence in graffiti, film, music video, fiction, advertising, gender, corporate investment, government and censorship with a critical focus on race, gender, popular culture, and the politics of creative expression. (Cross-listed with ETHN 128.)",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MUS 153",
  "title": "African Americans and the Mass Media",
  "unit": "4",
  "description": "Examination of media representations of African Americans from slavery to the present focusing on emergence and transmission of enduring stereotypes, their relationship to changing social, political, and economic frameworks, and African Americans' responses to and interpretations of these mediated images. (Cross-listed with ETHN 164.)",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "MUS 160A",
  "title": "Senior Project in Computing Arts I",
  "unit": "4",
  "description": "Students pursue projects of their own design over two quarters with support from faculty in a seminar environment. Project proposals are developed, informed by project development guidelines from real world examples. Collaborations are possible. Two production-course limitation. Renumber from ICAM 160A. Students may receive credit for only one of the following: MUS 160A, VIS 160A, ICAM 160A.",
  "prerequisite": "VIS 141B or VIS 145B or VIS 147B or MUS 172. Open to music and ICAM majors only. Department stamp required."
 },
 {
  "code": "MUS 160B",
  "title": "Senior Project in Computing Arts II",
  "unit": "4",
  "description": "Continuation of MUS 160A or VIS 160A. Completion and presentation of independent projects along with documentation. Two production-course limitation. Renumbered from ICAM 160B. Students may receive credit for only one of the following: MUS 160B, VIS 160B, ICAM 160B.",
  "prerequisite": "MUS 160A or VIS 160A. Open to music and ICAM majors only. Department stamp required."
 },
 {
  "code": "MUS 170",
  "title": "Musical Acoustics",
  "unit": "4",
  "description": "(Formerly MUS 160A.) An introduction to the acoustics of music with particular emphasis on contemporary digital techniques for understanding and manipulating sound.",
  "prerequisite": "MUS 1A, 2A, or 4."
 },
 {
  "code": "MUS 171",
  "title": "Computer Music I",
  "unit": "4",
  "description": "(Formerly MUS 160C.) A practical introduction to computer techniques for desktop audio editing, MIDI control, and real-time music algorithms using the MAX programming environment. Recommended preparation: completion of MUS 170.",
  "prerequisite": "none; restricted to music majors, ICAM-music and ICAM- visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 172",
  "title": "Computer Music II",
  "unit": "4",
  "description": "(Formerly MUS 161.) Computer synthesis techniques including wavetable and additive synthesis, waveshaping, and sampling. Transformation of musical sounds using filters, modulation, and delay effects. Fourier analysis of sounds.",
  "prerequisite": "MUS 171 (formerly MUS 160C); music majors, ICAM- music and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 173",
  "title": "Electronic Music Production and Composition",
  "unit": "4",
  "description": "(Formerly MUS 162.) Creative music production using digital audio workstations (DAWs), emphasizing hands-on composition projects including tempo warping, beat and tonality matching, virtual drum kits, chord progressions, sound processing and effects, arrangement, and remixing in the context of both popular and experimental genres. Existing works are analyzed and dissected for aesthetic value and production technique.",
  "prerequisite": "none; restricted to music, ICAM-music, and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 174A",
  "title": "Audio/MlDI Studio Techniques I",
  "unit": "4",
  "description": "First class in a yearlong sequence. Surveys hardware and software resources in an advanced analog/digital and media studio. Required course for use of the studio. Topics include: electronic and computer music, digital and analog audio signal mixing and manipulation, studio devices, interfacing, compositional applications, MIDI synchronization, performance and student projects. 174A focuses on signals, mics, device-based recording, mixing, monitoring.",
  "prerequisite": "MUS 170; restricted to music, ICAM-music, and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 174B",
  "title": "Audio/MlDI Studio Techniques II",
  "unit": "4",
  "description": "Second class in a yearlong sequence. Surveys hardware and software resources in an advanced analog/digital and media studio. Required course for use of the studio. Topics include: electronic and computer music, digital and analog audio signal mixing and manipulation, studio devices, interfacing, compositional applications, MIDI synchronization, performance and studio techniques, and student projects. 174B focuses on digital audio workstations, computer-based mixing and editing, sound file transformation.",
  "prerequisite": "MUS 170, MUS 174A; restricted to music, ICAM-music, and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 174C",
  "title": "Audio/MlDI Studio Techniques III",
  "unit": "4",
  "description": "Third class in a yearlong sequence. Surveys hardware and software resources in an advanced analog/digital and media studio. Required course for use of the studio. Topics include: electronic and computer music, digital and analog audio signal mixing and manipulation, studio devices, interfacing, compositional applications, MIDI synchronization, performance and studio techniques, and student projects. 174C focuses on MIDI, synchronization, and sound-for-picture.",
  "prerequisite": "MUS 170, MUS 174B; restricted to music, ICAM-music, and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 175",
  "title": "Musical Psychoacoustics",
  "unit": "4",
  "description": "Survey of psychoacoustical phenomena, theories of hearing, and their relation to musical perception and cognition. Techniques of psychoacoustical experimentation.",
  "prerequisite": "MUS 170 recommended."
 },
 {
  "code": "MUS 176",
  "title": "Music Technology Seminar",
  "unit": "4",
  "description": "(Formerly MUS 163.) Selected topics in music technology and its application to composition and/or performance. Offerings vary according to faculty availability and interest. May be repeated for credit.",
  "prerequisite": "MUS 172 (formerly MUS 161) and consent of instructor."
 },
 {
  "code": "MUS 177",
  "title": "Music Programming",
  "unit": "4",
  "description": "Fundamentals of programming music software in C and C++. DSP implementation of oscillators, filters, delay, reverb and spectral processing; programming techniques specific to audio and MIDI and simple GUI design for parameter control and signal display. Implementation using a plug-in or external programming interface such as for VST, Audio Unit, PD, or Max/MSP. May be taken for credit two times.",
  "prerequisite": "MUS 172 (formerly MUS 161); restricted to music, ICAM-music, and ICAM-visual arts majors and minors, or consent of instructor."
 },
 {
  "code": "MUS 192",
  "title": "Senior Seminar in Music",
  "unit": "1",
  "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in music (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequisite": "upper- division standing; department stamp and/or consent of instructor required."
 },
 {
  "code": "MUS 195",
  "title": "Instructional Assistance",
  "unit": "2",
  "description": "Assisting in the instruction of an undergraduate music class under the direct and constant supervision of a faculty member. May be taken for credit three times.",
  "prerequisite": "consent of instructor and department approval."
 },
 {
  "code": "MUS 198",
  "title": "Directed Group Study",
  "unit": "1-4",
  "description": "Concentrated inquiry into various problems not covered in the usual undergraduate courses.",
  "prerequisite": "consent of instructor and department chair approval. Pass/Not Pass grade only."
 },
 {
  "code": "MUS 199",
  "title": "Independent Study",
  "unit": "1-4",
  "description": "Independent reading, research, or creative work under the direction of a faculty member, provided no course covering the material to be studied already exists, and the study area derives from previous course work.",
  "prerequisite": "consent of instructor and department chair approval. Department stamp required. Pass/Not Pass grade only. May be taken for credit two times."
 },
 {
  "code": "MUS 200",
  "title": "Contemporary Chamber Opera Performance",
  "unit": "4",
  "description": "Students will collaborate with faculty and guest artists in the preparation and performance of a fully staged contemporary chamber opera. The opera will be presented in multiple public performances.",
  "prerequisite": "graduate standing in music, MU75/MU76, or consent of instructor."
 },
 {
  "code": "MUS 202",
  "title": "Advanced Projects in Performance",
  "unit": "1-4",
  "description": "Advanced performance of new music with members of the performance faculty (SONOR). Students taking this course do not need to take MUS 201 that quarter. Enrollment by consent of instructor/director of SONOR.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp."
 },
 {
  "code": "MUS 203A",
  "title": "Advanced Projects in Composition",
  "unit": "6",
  "description": "Meetings and laboratory sessions devoted to the study of composition in small groups. Consent of instructor required.",
  "prerequisite": null
 },
 {
  "code": "MUS 203B",
  "title": "Advanced Projects in Composition",
  "unit": "6",
  "description": "Meetings and laboratory sessions devoted to the study of composition in small groups. Consent of instructor required.",
  "prerequisite": null
 },
 {
  "code": "MUS 203C",
  "title": "Advanced Projects in Composition",
  "unit": "6",
  "description": "Meetings and laboratory sessions devoted to the study of composition in small groups. Consent of instructor required.",
  "prerequisite": null
 },
 {
  "code": "MUS 203D",
  "title": "Advanced Projects in Composition",
  "unit": "1-4",
  "description": "Meetings on group basis with faculty composer in sessions devoted to the study of composition.",
  "prerequisite": "203A-B-C and consent of instructor."
 },
 {
  "code": "MUS 204",
  "title": "Focus on Composition",
  "unit": "2",
  "description": "The purpose of this seminar is to bring in the entire population of the graduate composition program (all students and faculty) for in-depth discussion of critical issues in music theory and composition. Each meeting will feature a formal presentation by either a student, faculty member, or visitor, followed by lively and challenging debate on relevant issues.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 205",
  "title": "Focus on Integrative Studies",
  "unit": "2",
  "description": "Meets on a biweekly basis to facilitate presentations by advanced students and invited guests and to encourage in-depth discussion between students, faculty, and visitors about theoretical and artistic issues of interest. Participation is required of all enrolled IS students until advanced to candidacy. Others are welcome to participate.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 206",
  "title": "Experimental Studies Seminar",
  "unit": "4",
  "description": "Seminars growing out of current faculty interests. The approach tends to be speculative and includes individual projects or papers as well as assigned readings. In the past, such areas as new instrumental and vocal resources, mixed media, and compositional linguistics have been offered.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp."
 },
 {
  "code": "MUS 207",
  "title": "Theoretical Studies Seminar",
  "unit": "4",
  "description": "Seminars on subject areas relating to the established dimensions of music and in which theoreticians have produced a substantial body of work. These include studies in analysis, timbre, rhythm, notation, and psychoacoustics. Offerings vary depending on faculty availability and interest. Analytical paper required.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp."
 },
 {
  "code": "MUS 209",
  "title": "Advanced Music Theory and Practice",
  "unit": "4",
  "description": "Advanced integrated studies in music theory; composition and styles study through analysis and performance. This course is intended primarily for doctoral students and may be taken by MA students only with special approval of MA adviser and course instructor. A major research or analytical publishable paper required.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp."
 },
 {
  "code": "MUS 210",
  "title": "Musical Analysis",
  "unit": "4",
  "description": "The analysis of complex music. The course will assume that the student has a background in traditional music analysis. The goal of the course is to investigate and develop analytical procedures that yield significant information about specific works of music, old and new. Reading, projects, and analytical papers.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp."
 },
 {
  "code": "MUS 211",
  "title": "Introduction to Ethnomusicology",
  "unit": "2",
  "description": "Introduces the field of ethnomusicology by highlighting important thinkers, concepts, and issues and by orienting students toward work of an anthropological, ethnographic, or comparative nature. Students who have taken and passed MUS 208A may not get credit for MUS 211.",
  "prerequisite": "graduate standing in music"
 },
 {
  "code": "MUS 212",
  "title": "Introduction to System Inquiry",
  "unit": "2",
  "description": "Introduces the network of concepts and approaches that comprise systems inquiry and explores the theoretical, philosophical, and methodological implications of systems thinking for musical research and practice. Students who have taken MUS 208B for credit may not take MUS 212 for credit.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 213",
  "title": "Introduction to Critical Studies",
  "unit": "2",
  "description": "Introduces important themes and thinkers from the fields of critical theory and cultural studies and explores how musical behaviors and phenomena relate to matters of ideology, nationality, ethnicity, social class, race, and gender. Students who have taken MUS 208C for credit may not take MUS 213 for credit.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 214",
  "title": "Introduction to Creative Practices",
  "unit": "2",
  "description": "Surveys the terrain of contemporary creative music and investigates the social, cultural, historical, and technological dimensions of its manifestations and practice. Students who have taken MUS 208D for credit may not take MUS 214 for credit.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 228",
  "title": "Conducting",
  "unit": "4",
  "description": "This course will give practical experience in conducting a variety of works from various eras of instrumental and/or vocal music. Students will study problems of instrumental or vocal techniques, formal and expressive analysis of the music, and manners of rehearsal. Required of all graduate students.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp. (Offered in selected years.)"
 },
 {
  "code": "MUS 229",
  "title": "Seminar in Orchestration",
  "unit": "4",
  "description": "A seminar to give practical experience in orchestration. Students will study works from various eras of instrumental music and will demonstrate their knowledge by orchestrating works in the styles of these various eras, learning the capabilities, timbre, and articulation of all the instruments in the orchestra.",
  "prerequisite": "graduate standing. (Offered in selected years.)"
 },
 {
  "code": "MUS 230",
  "title": "Chamber Music Performance",
  "unit": "4",
  "description": "Performance of representative chamber music literature, instrumental and/or vocal, through coached rehearsal and seminar studies. Course may be repeated for credit since the literature studied varies from quarter to quarter.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 232",
  "title": "Proseminar in Music Performance",
  "unit": "1-4",
  "description": "Individual or master class instruction in advanced instrumental/vocal performance.",
  "prerequisite": "consent of instructor through audition."
 },
 {
  "code": "MUS 234",
  "title": "Symphonic Orchestra",
  "unit": "4",
  "description": "Repertoire is drawn from the classic symphonic literature of the eighteenth, nineteenth, and twentieth centuries with a strong emphasis on recently composed and new music. Distinguished soloists, as well as The La Jolla Symphony Chorus, frequently appear with the orchestra. The La Jolla Symphony Orchestra performs two full-length programs each quarter, each program being performed twice. May be repeated six times for credit.",
  "prerequisite": "audition required."
 },
 {
  "code": "MUS 245",
  "title": "Focus on Performance",
  "unit": "2",
  "description": "The purpose of this seminar is to bring together performance students, faculty, and guests for discussion, presentation of student and faculty projects, performances by guest artists, and master classes with different members of the performance faculty.",
  "prerequisite": "consent of instructor. (S/U grade option only.)"
 },
 {
  "code": "MUS 251",
  "title": "Integrative Studies Seminar in Ethnomusicology",
  "unit": "4",
  "description": "Provides an in-depth look at the shifting definitions, methods, and scope of ethnomusicology and explores contemporary writings and issues that are shaping the field today.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 252",
  "title": "Integrative Studies Seminar in Systems Inquiry",
  "unit": "4",
  "description": "Traces the development of systems thinking and encourages work of a transdisciplinary nature, integrating models, strategies, methods, and tools from natural, human, social, and technological realms.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 253",
  "title": "Integrative Studies Seminar in Critical Studies",
  "unit": "4",
  "description": "Develops critical thinking and self-reflexive inquiry through in-depth study of a diverse range of critical and scholarly traditions as they relate to music. Students are encouraged to investigate their own sense of identity and voice, as embodied in their creative and/or scholarly work.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 254",
  "title": "Integrative Studies Seminar in Creative Practice",
  "unit": "4",
  "description": "Students will explore a variety of approaches to collaborative work and will be challenged to develop a personal aesthetic in experimental art and new media and design original work for presentation at faculty juries.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 267",
  "title": "Advanced Music Technology Seminar",
  "unit": "4",
  "description": "Advanced topics in music technology and its application to composition and/or performance. Offerings vary according to faculty availability and interest. May be repeated for credit.",
  "prerequisite": "MUS 173 or equivalent and consent of instructor."
 },
 {
  "code": "MUS 270A",
  "title": "Digital Audio Processing",
  "unit": "4",
  "description": "Digital techniques for analysis, synthesis, and processing of musical sounds. Sampling theory. Software synthesis techniques. Digital filter design. The short-time Fourier transform. Numerical accuracy considerations.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 270B",
  "title": "Musical Cognitive Science",
  "unit": "4",
  "description": "Theoretical bases for analyzing musical sound. Approaches to perception and cognition, including psychoacoustics and information processing, both ecological and computational. Models of audition including Helmholtz's consonance/dissonance theory and Bregman's streaming model. Musical cognition theories of Lerdahl and Narmour. Neural network models of music perception and cognition. Models of rhythm. The problem of timbre and timbre perception.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 270C",
  "title": "Compositional Algorithms",
  "unit": "4",
  "description": "Transformations in musical composition; series and intervallic structures; serial approaches to rhythm and dynamic. The stochastic music of Xenakis and Cage. Hiller's automatic composition. Improvisational models. Computer analysis of musical style. Neurally inspired and other quasiparallel algorithms.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "MUS 270D",
  "title": "Advanced Projects in Computer Music",
  "unit": "4",
  "description": "Meetings on group basis with computer music faculty in support of individual student research projects.",
  "prerequisite": "consent of instructor and completion of MUS 270A-B-C."
 },
 {
  "code": "MUS 271A",
  "title": "Survey of Electronic Music Techniques I",
  "unit": "4",
  "description": "A hands-on encounter with several important works from the classic electronic repertory, showing a representative subset of the electronic techniques available to musicians. Students who have taken MUS 271 for credit may not take MUS 271A for credit.",
  "prerequisite": "graduate standing in music."
 },
 {
  "code": "MUS 271B",
  "title": "Survey of Electronic Music Techniques II",
  "unit": "4",
  "description": "A continuation of 271A, with emphasis on live interactive techniques (e.g., audio processing; analysis/resynthesis; score following).",
  "prerequisite": "MUS 271A and graduate standing in music."
 },
 {
  "code": "MUS 271C",
  "title": "Survey of Electronic Music Techniques III",
  "unit": "4",
  "description": "A continuation of 271A and B, with emphasis on compositional techniques (e.g., computer-aided composition, production, spatialization).",
  "prerequisite": "MUS 271B and graduate standing in music."
 },
 {
  "code": "MUS 272",
  "title": "Seminar in Live Computer Music",
  "unit": "4",
  "description": "Group projects to create new pieces of live electronic music involving research in electronic music and/or instrumental techniques. May be repeated for credit.",
  "prerequisite": null
 },
 {
  "code": "MUS 296",
  "title": "Directed Group Research in Performance",
  "unit": "4",
  "description": "This group research seminar involves the investigation and exploration of new and experimental performance concerns. Areas could include: improvisation, graphic notation, performance electronics, and working with combined media (such as dance, poetry, and theatre).",
  "prerequisite": "graduate standing. (S/U grade option only.)"
 },
 {
  "code": "MUS 298",
  "title": "Directed Research",
  "unit": "1-4",
  "description": "Individual research. (S/U grades permitted.) May be repeated for credit. Enrollment by consent of instructor only.",
  "prerequisite": null
 },
 {
  "code": "MUS 299",
  "title": "Advanced Research Projects and Independent Study",
  "unit": "1-12",
  "description": "Individual research projects relevant to the student's selected area of graduate interest conducted in continuing relationship with a faculty adviser in preparation of the master's thesis or doctoral dissertation.",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp. (S/U grades permitted.)"
 },
 {
  "code": "MUS 500",
  "title": "Apprentice Teaching",
  "unit": "1-4",
  "description": "Participation in the undergraduate teaching program is required of all graduate students at the equivalent of twenty-five percent time for three quarters (six units is required for all graduate students).",
  "prerequisite": "graduate standing in music; others by written consent of instructor and department stamp. (S/U grade option only.)"
 },
 {
  "code": "MUS 501",
  "title": "Apprentice Teaching—Nondepartmental",
  "unit": "4",
  "description": "Consideration and development of pedagogical methods appropriate to undergraduate teaching.",
  "prerequisite": "graduate standing and consent of instructor. (S/U grade option only.)"
 }
]