[
 {
  "code": "NANO 4",
  "title": "Experience NanoEngineering",
  "unit": "1",
  "discription": "Introduction to NanoEngineering lab-based skills. Hands-on training and experimentation with nanofabrication techniques, integration, and analytical tools. This class is for NANO majors who are incoming first-year students, to be taken their first year. This class is for NanoEngineering majors who are incoming first-year students, to be taken their first year. P/NP grades only.",
  "prerequsite": "department approval required."
 },
 {
  "code": "NANO 11",
  "title": "Introduction to NanoEngineering",
  "unit": "4",
  "discription": "Introduction to NanoEngineering, including fundamental scaling laws, and an overview of nanomaterials synthesis, properties, and relevant technological applications with focus in the area of nanomedicine, energy, and advanced materials.",
  "prerequsite": "NANO 4."
 },
 {
  "code": "NANO 15",
  "title": "Engineering Computation Using Matlab",
  "unit": "4",
  "discription": "Introduction to the solution of engineering problems using computational methods. Formulating problem statements, selecting algorithms, writing computer programs, and analyzing output using Matlab. Computational problems from NanoEngineering, chemical engineering, and materials science are introduced. The course requires no prior programming skills. Cross-listed with CENG 15.",
  "prerequsite": null
 },
 {
  "code": "NANO 15R",
  "title": "Engineering Computation Using Matlab Online",
  "unit": "4",
  "discription": "Introduction to solution of engineering problems using computational methods. Formulating problem statements, selecting algorithms, writing computer programs, and analyzing output using Matlab. Computational problems from NanoEngineering, chemical engineering, and materials science are introduced. This is a fully online, self-paced course that utilizes multi-platform instructional techniques (video, text, and instructional coding environments). The course requires no prior programming skills. Cross-listed with CENG 15R.",
  "prerequsite": null
 },
 {
  "code": "NANO 20L",
  "title": "Introduction to Nanomaterials Synthesis Lab",
  "unit": "1",
  "discription": "Lab-based course to introduce the chemical synthesis of nanomaterials. Hands- on training in chemical synthesis and basic characterization tools. Program or materials fees may apply.",
  "prerequsite": "NANO 4."
 },
 {
  "code": "NANO 100L",
  "title": "Physical Properties of Materials Lab",
  "unit": "4",
  "discription": "Experimental investigation of physical properties of materials such as: thermal expansion coefficient, thermal conductivity, glass transitions in polymers, resonant vibrational response, longitudinal and shear acoustic wave speeds, Curie temperatures, UV-VIS absorption and reflection.",
  "prerequsite": "NANO 108."
 },
 {
  "code": "NANO 101",
  "title": "Introduction to NanoEngineering",
  "unit": "4",
  "discription": "Introduction to NanoEngineering; nanoscale fabrication: nanolithography and self-assembly; characterization tools; nanomaterials and nanostructures: nanotubes, nanowires, nanoparticles, and nanocomposites; nanoscale and molecular electronics; nanotechnology in magnetic systems; nanotechnology in integrative systems; nanoscale optoelectronics; nanobiotechnology: biomimetic systems, nanomotors, nanofluidics, and nanomedicine. Priority enrollment given to NanoEngineering majors.",
  "prerequsite": "NANO 1 or NANO 4, CHEM 6B, PHYS 2B, MATH 20C, and CENG 15 or CENG 15R or NANO 15 or NANO 15R or MAE 8. Restricted to major code NA25."
 },
 {
  "code": "NANO 102",
  "title": "Foundations in NanoEngineering: Chemical Principles",
  "unit": "4",
  "discription": "Chemical principles involved in synthesis, assembly, and performance of nanostructured materials and devices. Chemical interactions, classical and statistical thermodynamics of small systems, diffusion, carbon-based nanomaterials, supramolecular chemistry, liquid crystals, colloid and polymer chemistry, lipid vesicles, surface modification, surface functionalization, catalysis. Priority enrollment given to NanoEngineering majors.",
  "prerequsite": "CHEM 6C, MATH 20D, NANO 101, PHYS 2D, and NANO 106. Restricted to NanoEngineering majors or by department approval."
 },
 {
  "code": "NANO 104",
  "title": "Foundations in NanoEngineering: Physical Principles",
  "unit": "4",
  "discription": "Introduction to quantum mechanics and nanoelectronics. Wave mechanics, the Schrödinger equation, free and confined electrons, band theory of solids. Nanosolids in 0D, 1D, and 2D. Application to nanoelectronic devices. Priority enrollment given to NanoEngineering majors",
  "prerequsite": "MATH 20D, NANO 101. Department approval required."
 },
 {
  "code": "NANO 106",
  "title": "Crystallography of Materials",
  "unit": "4",
  "discription": "Fundamentals of crystallography, and practice of methods to study material structure and symmetry. Curie symmetries. Tensors as mathematical description of material properties and symmetry restrictions. Introduction to diffraction methods, including X-ray, neutron, and electron diffraction. Close-packed and other common structures of real-world materials. Derivative and superlattice structures.",
  "prerequsite": "MATH 20F or MATH 18."
 },
 {
  "code": "NANO 107",
  "title": "Electronic Devices and Circuits for Nanoengineers",
  "unit": "4",
  "discription": "Overview of electrical devices and CMOS integrated circuits emphasizing fabrication processes, and scaling behavior. Design, and simulation of submicron CMOS circuits including amplifiers active filters digital logic, and memory circuits. Limitations of current technologies and possible impact of nanoelectronic technologies. ",
  "prerequsite": "NANO 15, NANO 101, MATH 20B or MATH 20D, and PHYS 2B."
 },
 {
  "code": "NANO 108",
  "title": "Materials Science and Engineering",
  "unit": "4",
  "discription": "Structure and control of materials: metals, ceramics, glasses, semiconductors, polymers to produce useful properties. Atomic structures. Defects in materials, phase diagrams, micro structural control. Mechanical, rheological, electrical, optical and magnetic properties discussed. Time temperature transformation diagrams. Diffusion. Scale dependent material properties.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "NANO 110",
  "title": "Molecular Modeling of Nanoscale Systems",
  "unit": "4",
  "discription": "Principles and applications of molecular modeling and simulations toward NanoEngineering. Topics covered include molecular mechanics, energy minimization, statistical mechanics, molecular dynamics simulations, and Monte Carlo simulations. Students will get hands-on training in running simulations and analyzing simulation results.",
  "prerequsite": "MATH 20F or MATH 18, NANO 102, NANO 104, and NANO 15 or CENG 15 or MAE 8. Restricted to NanoEngineering majors or by department approval."
 },
 {
  "code": "NANO 111",
  "title": "Characterization of NanoEngineering Systems",
  "unit": "4",
  "discription": "Fundamentals and hands-on practice of methods to image, measure, and analyze materials and devices that are structured on the nanometer scale. Optical and electron microscopy; scanning probe methods; photon, ion, and electron probe methods; spectroscopic, magnetic, electrochemical, and thermal methods.",
  "prerequsite": "NANO 102."
 },
 {
  "code": "NANO 112",
  "title": "Synthesis and Fabrication of NanoEngineering Systems",
  "unit": "4",
  "discription": "Introduction to methods for fabricating materials and devices in NanoEngineering. Nano-particle, -vesicle, -tube, and -wire synthesis. Top-down methods including chemical vapor deposition, conventional and advanced lithography, doping, and etching. Bottom-up methods including self-assembly. Integration of heterogeneous structures into functioning devices.",
  "prerequsite": "NANO 102 and NANO 104."
 },
 {
  "code": "NANO 114",
  "title": "Probability and Statistical Methods for Engineers",
  "unit": "4",
  "discription": "Probability theory, conditional probability, Bayes theorem, discrete random variables, continuous random variables, expectation and variance, central limit theorem, graphical and numerical presentation of data, least squares estimation and regression, confidence intervals, testing hypotheses. Cross- listed with CENG 114. Students may not receive credit for both NANO 114 and CENG 114.",
  "prerequsite": "MATH 20F or MATH 18 and NANO 15 or CENG 15 or MAE 8."
 },
 {
  "code": "NANO 115L",
  "title": "Nanoengineering Laboratory",
  "unit": "4",
  "discription": "Laboratory experiments in the design, production, and integration of nanoscale components. Emphasis will be on solution phase synthesis, microfabrication tools, analytical characterization, and nanodevice fabrication.",
  "prerequsite": "NANO 111."
 },
 {
  "code": "NANO 117",
  "title": "Multiscale Transport",
  "unit": "4",
  "discription": "Introduction to basic transport phenomena relevant to nanoscale and general materials systems, including engineering units and pressure, heat conduction and convection, momentum transport and laminar flow, and diffusion in solids and fluids.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "NANO 120A",
  "title": "NanoEngineering System Design I",
  "unit": "4",
  "discription": "Principles of product design and the design process. Application and integration of technologies in the design and production of nanoscale components. Engineering economics. Initiation of team design projects to be completed in NANO 120B.",
  "prerequsite": "NANO 110."
 },
 {
  "code": "NANO 120B",
  "title": "NanoEngineering System Design II",
  "unit": "4",
  "discription": "Principles of product quality assurance in design and production. Professional ethics. Safety and design for the environment. Culmination of team design projects initiated in NANO 120A with a working prototype designed for a real engineering application.",
  "prerequsite": "NANO 120A."
 },
 {
  "code": "NANO 134",
  "title": "Polymeric Materials",
  "unit": "4",
  "discription": "Foundations of polymeric materials. Topics: structure of polymers; mechanisms of polymer synthesis; characterization methods using calorimetric, mechanical, rheological, and X-ray-based techniques; and electronic, mechanical, and thermodynamic properties. Special classes of polymers: engineering plastics, semiconducting polymers, photoresists, and polymers for medicine. Cross-listed with CENG 134. Students may not receive credit for both CENG 134 and NANO 134\\.",
  "prerequsite": "CHEM 6C and PHYS 2C."
 },
 {
  "code": "NANO 141A",
  "title": "Engineering Mechanics I: Analysis of Equilibrium",
  "unit": "4",
  "discription": "Newton’s laws. Concepts of force and moment vector. Free body diagrams. Internal and external forces. Equilibrium of concurrent, coplanar, and three- dimensional system of forces. Equilibrium analysis of structural systems, including beams, trusses, and frames. Equilibrium problems with friction.",
  "prerequsite": "MATH 20C and PHYS 2A."
 },
 {
  "code": "NANO 141B",
  "title": "Engineering Mechanics II: Analysis of Motion",
  "unit": "4",
  "discription": "Newton’s laws of motion. Kinematic and kinetic ​description of particle motion. Angular momentum. Energy and work principles. Motion of the system of interconnected particles. Mass center. Degrees of freedom. Equations of planar motion of rigid bodies. Energy methods. Lagrange’s equations of motion. Introduction to vibration. Free and forced vibrations of a single degree of freedom system. Undamped and damped vibrations. Application to NanoEngineering problems. ",
  "prerequsite": "MATH 20D and NANO 141A."
 },
 {
  "code": "NANO 146",
  "title": "Nanoscale Optical Microscopy and Spectroscopy",
  "unit": "4",
  "discription": "Fundamentals in optical imaging and spectroscopy at the nanometer scale. Diffraction-limited techniques, near-field methods, multi-photon imaging and spectroscopy, Raman techniques, Plasmon-enhanced methods, scan-probe techniques, novel sub-diffraction-limit imaging techniques, and energy transfer methods.",
  "prerequsite": "NANO 103 and 104."
 },
 {
  "code": "NANO 148",
  "title": "Thermodynamics of Materials",
  "unit": "4",
  "discription": "Fundamental laws of thermodynamics for simple substances; application to flow processes and to nonreacting mixtures; statistical thermodynamics of ideal gases and crystalline solids; chemical and materials thermodynamics; multiphase and multicomponent equilibria in reacting systems; electrochemistry.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "NANO 150",
  "title": "Mechanics of Nanomaterials",
  "unit": "4",
  "discription": "Introduction to mechanics of rigid and deformable bodies. Continuum and atomistic models, interatomic forces and intermolecular interactions. Nanomechanics, material defects, elasticity, plasticity, creep, and fracture. Composite materials, nanomaterials, biological materials.",
  "prerequsite": "NANO 108."
 },
 {
  "code": "NANO 156",
  "title": "Nanomaterials",
  "unit": "4",
  "discription": "Basic principles of synthesis techniques, processing, microstructural control, and unique physical properties of materials in nanodimensions. Nanowires, quantum dots, thin films, electrical transport, optical behavior, mechanical behavior, and technical applications of nanomaterials. Cross-listed with MAE 166.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "NANO 158",
  "title": "Phase Transformations and Kinetics",
  "unit": "4",
  "discription": "Materials and microstructures changes. Understanding of diffusion to enable changes in the chemical distribution and microstructure of materials, rates of diffusion. Phase transformations, effects of temperature and driving force on transformations and microstructure.",
  "prerequsite": "NANO 108 and NANO 148."
 },
 {
  "code": "NANO 158L",
  "title": "Materials Processing Laboratory",
  "unit": "4",
  "discription": "Metal casting processes, solidification, deformation processing, thermal processing: solutionizing, aging, and tempering, joining processes such as welding and brazing. The effect of processing route on microstructure and its effect on mechanical and physical properties will be explored. NanoEngineering majors have priority enrollment.",
  "prerequsite": "NANO 158."
 },
 {
  "code": "NANO 159",
  "title": "Electrochemistry: Fundamentals and Applications",
  "unit": "4",
  "discription": "Introduce fundamentals of electrochemical processes and electrode reactions to the principles of electrochemical techniques, instrumental requirements, and their diverse real-life applications in the energy, environmental, and diagnostics areas.",
  "prerequsite": "CHEM 6A or 6AH, CHEM 6B or 6BH, CHEM 6C or 6CH, CHEM 7L or 7LM."
 },
 {
  "code": "NANO 161",
  "title": "Material Selection in Engineering",
  "unit": "4",
  "discription": "Selection of materials for engineering systems, based on constitutive analyses of functional requirements and material properties. The role and implications of processing on material selection. Optimizing material selection in a quantitative methodology. NanoEngineering majors receive priority enrollment.",
  "prerequsite": "NANO 108. Department approval required. Restricted to major code NA25."
 },
 {
  "code": "NANO 174",
  "title": "Mechanical Behavior of Materials",
  "unit": "4",
  "discription": "Microscopic and macroscopic aspects of the mechanical behavior of engineering materials, with emphasis on recent development in materials characterization by mechanical methods. The fundamental aspects of plasticity in engineering materials, strengthening mechanisms, and mechanical failure modes of materials systems.",
  "prerequsite": "NANO 108."
 },
 {
  "code": "NANO 174L",
  "title": "Mechanical Behavior Laboratory",
  "unit": "4",
  "discription": "Experimental investigation of mechanical behavior of engineering materials. Laboratory exercises emphasize the fundamental relationship between microstructure and mechanical properties, and the evolution of the microstructure as a consequence of rate process.",
  "prerequsite": "NANO 174."
 },
 {
  "code": "NANO 175",
  "title": "NanoEngineering in Medicine",
  "unit": "4",
  "discription": "Introduction to nanomedicine. Topics include nanoscale material, biological systems vs. synthetic vs. bio-inspired systems, drug and gene delivery, molecular imaging, vaccines, immunoengineering, pharmacology, clinical application in cancer, cardiovascular disease, infectious disease, immune diseases, genetic disorders, skin diseases, and regenerative medicine. Students will not receive credit for both NANO 175 and CENG 175.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "NANO 199",
  "title": "Independent Study for Undergraduates",
  "unit": "4",
  "discription": "Independent reading or research on a problem by special arrangement with a faculty member. P/NP grades only.",
  "prerequsite": "upper division and department stamp."
 },
 {
  "code": "NANO 200",
  "title": "Graduate Seminar in Chemical Engineering",
  "unit": "1",
  "discription": "Each graduate student in NANO is expected to attend three seminars per quarter, of his or her choice, dealing with current topics in chemical engineering. Topics will vary. Cross-listed with CENG 205. S/U grades only. May be taken for credit four times.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "NANO 201",
  "title": "Introduction to NanoEngineering",
  "unit": "4",
  "discription": "Understanding nanotechnology, broad implications, miniaturization: scaling laws; nanoscale physics; types and properties of nanomaterials; nanomechanical oscillators, nano(bio)electronics, nanoscale heat transfer; fluids at the nanoscale; machinery cell; applications of nanotechnology and nanobiotechnology. Students may not receive credit for both NANO 201 and CENG 211.",
  "prerequsite": "graduate standing.  "
 },
 {
  "code": "NANO 202",
  "title": "Intermolecular and Surface Forces",
  "unit": "4",
  "discription": "Development of quantitative understanding of the different intermolecular forces between atoms and molecules and how these forces give rise to interesting phenomena at the nanoscale, such as flocculation, wetting, self- assembly in biological (natural) and synthetic systems. Cross-listed with CENG 212. Students may not receive credit for both NANO 202 and CENG 212.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 203",
  "title": "Nanoscale Characterization",
  "unit": "4",
  "discription": "Examination of nanoscale characterization approaches including imaging, scattering, and spectroscopic techniques and their physical operating mechanisms. Microscopy (optical and electron: SEM, TEM); scattering and diffraction; spectroscopies (EDX, SIMS, mass spec, Raman, XPS, XAS); scanning probe microscopes (SPM, AFM); particle size analysis.",
  "prerequsite": null
 },
 {
  "code": "NANO 204",
  "title": "Nanoscale Physics and Modeling",
  "unit": "4",
  "discription": "This course will introduce students to analytical and numerical methods such as statistical mechanisms, molecular simulations, and finite differences and finite element modeling through their application to NanoEngineering problems involving polymer and colloid self-assembly, absorption, phase separation, and diffusion. Cross-listed with CENG 214. Students may not receive credit for both NANO 204 and CENG 214.",
  "prerequsite": "NANO 202 or consent of instructor."
 },
 {
  "code": "NANO 205",
  "title": "Nanosystems Integration",
  "unit": "4",
  "discription": "Scaling issues and hierarchical assembly of nanoscale components into higher order structures which retain desired properties at microscale and macroscale levels. Novel ways to combine top-down and bottom-up processes for integration of heterogeneous components into higher order structures. Cross-listed with CENG 215. Students may not receive credit for both NANO 205 and CENG 215.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 208",
  "title": "Nanofabrication",
  "unit": "4",
  "discription": "Basic engineering principles of nanofabrication. Topics include photo- electronbeam and nanoimprint lithography, block copolymers and self-assembled monolayers, colloidal assembly, biological nanofabrication. Cross-listed with CENG 208. Students may not receive credit for both NANO 208 and CENG 208.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 210",
  "title": "Molecular Modeling and Simulations of Nanoscale Systems",
  "unit": "4",
  "discription": "Molecular and modeling and simulation techniques like molecular dynamics, Monte Carlo, and Brownian dynamics to model nanoscale systems and phenomena like molecular motors, self-assembly, protein-ligand binding, RNA, folding. Valuable hands-on experience with different simulators.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 212",
  "title": "Computational Modeling of Nanosystems",
  "unit": "4",
  "discription": "Various modeling techniques like finite elements, finite differences, and simulation techniques like molecular dynamics and Monte Carlo to model fluid flow, mechanical properties, self-assembly at the nanoscale, and protein, RNA and DNA folding.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 227",
  "title": "Structure and Analysis of Solids",
  "unit": "4",
  "discription": "Key concepts in the atomic structure and bonding of solids such as metals, ceramics, and semiconductors. Symmetry operations, point groups, lattice types, space groups, simple and complex inorganic compounds, structure/property comparisons, structure determination with X-ray diffraction. Ionic, covalent, metallic bonding compared with physical properties. Atomic and molecular orbitals, bands verses bonds, free electron theory. Cross-listed with MATS 227, MAE 251 and CHEM 222.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 230",
  "title": "Synchrotron Characterization of Nanomaterials",
  "unit": "4",
  "discription": "Advanced topics in characterizing nanomaterials using synchrotron X-ray sources. Introduction to synchrotron sources, X-ray interaction with matter, spectroscopic determination of electronic properties of nanomagnetic, structural determination using scattering techniques and X-ray imaging techniques. Cross-listed with CENG 230. Students may not receive credit for both NANO 230 and CENG 230.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 234",
  "title": "Advanced Nanoscale Fabrication",
  "unit": "4",
  "discription": "Engineering principles of nanofabrication. Topics include photo-, electron beam, and nanoimprint lithography, block copolymers and self-assembled monolayers, colloidal assembly, biological nanofabrication. Relevance to applications in energy, electronics, and medicine will be discussed.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 238",
  "title": "Scanning Probe Microscopy",
  "unit": "4",
  "discription": "Scanning electron microscopy (SEM) detectors, imaging, image interpretation, and artifacts, introduction to lenses, electron beam-specimen interactions. Operating principles and capabilities for atomic force microscopy and scanning tunneling microscopy, scanning optical microscopy and scanning transmission electron microscopy.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 241",
  "title": "Organic Nanomaterials",
  "unit": "4",
  "discription": "This course will provide an introduction to the physics and chemistry of soft matter, followed by a literature-based critical examination of several ubiquitous classes of organic nano materials and their technological applications. Topics include self-assembled monolayers, block copolymers, liquid crystals, photoresists, organic electronic materials, micelles and vesicles, soft lithography, organic colloids, organic nano composites, and applications in biomedicine and food science. Cross-listed with CHEM 241.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 242",
  "title": "Biochemistry and Molecular Biology",
  "unit": "4",
  "discription": "Course is designed to give NanoEngineering students from a variety of backgrounds a working knowledge of biochemistry and molecular biology. While the course offers biochemistry basics and key themes in molecular biology, it will emphasize the role of engineering innovations.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 243",
  "title": "Nanomedicine",
  "unit": "4",
  "discription": "Introduction to nanomedicine; diffusion and drug dispersion; diffusion in biological systems; drug permeation through biological barriers; drug transport by fluid motion; pharmacokinetics of drug distribution; drug delivery systems; nanomedicine in practice: cancers, cardiovascular diseases, immune diseases, and skin diseases. Cross-listed with CENG 207. Students may not receive credit for both NANO 243 and CENG 207.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 244",
  "title": "Nanomachines and Nanorobots",
  "unit": "4",
  "discription": "The structure and operational principles of different nature biomotors will be discussed. Related bio-inspired efforts aimed at developing artificial nanomotors will also be covered, along with the prospects of using biomotors and synthetic nanomotors in engineering environments.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 245",
  "title": "Nanoelectronics",
  "unit": "4",
  "discription": "An introduction to the nano electronics and nanospintronics; fundamentals of semiconductors; electronic band structure theory, electron transport in semiconductors and nano structures, nano devices.",
  "prerequsite": "NANO 201 and ****consent of instructor."
 },
 {
  "code": "NANO 247A",
  "title": "Advanced BioPhotonics",
  "unit": "4",
  "discription": "Basic physics and chemistry of interaction of photons with matter; photonic radiation pressure; advanced optoelectronic detection systems, devices, methods, time-resolved fluorescent, chemiluminescent methods, fluorescent energy transfer techniques, quantum dots, near-field optical techniques, mechanisms of light sensitive biological systems including chloroplasts for photosynthetic energy conversion and basis of vision processes. Cross-listed with BENG 247A and ECE 247A.",
  "prerequsite": "consent of instructor and graduate standing."
 },
 {
  "code": "NANO 247B",
  "title": "BioElectronics",
  "unit": "4",
  "discription": "Topics include photolithographic techniques for high-density DNA microarray production, incorporation of CMOS control into electronic DNA microarrays, direct electronic detection technology, bio-fuel cells, highly integrated devices (lab-on-a-chip, in vivo biosensors, etc.) Form heterogeneous materials and components. Cross-listed with BENG 247B and ECE 247B.",
  "prerequsite": "consent of instructor and graduate standing."
 },
 {
  "code": "NANO 247C",
  "title": "BioNanotechnology",
  "unit": "4",
  "discription": "Nanosensors, nanodevices for clinical diagnostics, biowarfare agent detection; nanostructures for drug delivery; nanoarrays, nanodevices, nanoanalytical devices and systems, methods for modification or functionalization of nanoparticles, nanostructures with biological molecules; nanostructural aspects of fuel cells; biofuel cells; potential use of DNA, other biomolecules. Cross-listed with BENG 247C and ECE 247C.",
  "prerequsite": "consent of instructor and graduate standing."
 },
 {
  "code": "NANO 250",
  "title": "Mechanics of Nanomaterials",
  "unit": "4",
  "discription": "Elements of continuum mechanics; quantum and statistical mechanics; interatomic forces and intermolecular interactions; thermodynamics and diffusion materials; nanomechanics of self-assembly, pattern formation, and hierarchical ordering, defects, thin films, surfaces, and interfaces; plasticity, creep, fracture, and fatigue, nanomechanics, nanorheology, and nanotribology.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 251A",
  "title": "Magnetic Materials: Principles and Applications",
  "unit": "4",
  "discription": "The basis of magnetism: classical and quantum mechanical points of view. Different kinds of magnetic materials. Magnetic phenomena including anisotropy, magnetostriction, domains, and magnetization dynamics. Current frontiers of nanomagnetics research, including thin films and particles. Optical, data storage, and biomedical engineering applications of soft and hard magnetic materials. Cross-listed with ECE 221, MAE 265B, and MATS 251B. Students may not receive credit for ECE 221 and MAE 265B and MATS 251B and NANO 251A.",
  "prerequsite": "consent of instructor_."
 },
 {
  "code": "NANO 252",
  "title": "Biomaterials and Biomimetics",
  "unit": "4",
  "discription": "Fundamentals of materials science as applied to bioengineering design. Hierarchical structures. Cells and tissues. Natural and synthetic polymeric materials. Biomineralized materials. Biological composites. Cellular materials (foams). Functional biological materials. Biomaterials and implants. Bioinspired design and materials. Cross-listed with CENG 256. Students may not receive credit for both NANO 252 and CENG 256.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 253",
  "title": "Nanomaterials and Properties",
  "unit": "4",
  "discription": "This course discusses synthesis techniques, processes, microstructural control, and unique physical properties of materials in nanodimensions. Topics include nanowires, quantum dots, thin films, electrical transport, electron emission properties, optical behavior, mechanical behavior, and technical applications of nanomaterials. Cross-listed with MAE 267.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 255",
  "title": "Electrochemistry",
  "unit": "4",
  "discription": "Application of electrochemical techniques to chemistry research. Basic electrochemical theory and instrumentation: the diffusion equations, controlled potential, and current methods. Electrochemical kinetics, Butler- Volmer, Marcus-Hush theories, preparative electrochemistry, analytical electrochemistry, solid and polymer electrolytes, semiconductor photoelectrochemistry. Cross-listed with CHEM 240.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 256",
  "title": "Microfluids",
  "unit": "4",
  "discription": "This course covers the design, microfabrication, operational principles, basic transport processes and diverse applications of microfluidic and nanofluidic (lab-on-a-chip) systems.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "NANO 257",
  "title": "Polymer Science and Engineering",
  "unit": "4",
  "discription": "Quantitative basic understanding of different branches of polymer science varying from polymer chemistry, characterization, thermodynamics, rheological properties, smart materials, self-assembly in biopolymers (natural) and synthetic polymers, and applications of polymers ranging from medicine to structure. Cross-listed with MATS 257 and BENG 242. Restricted to BE 75, MS 76, CE 75, and NA 75 majors.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 258",
  "title": "Nanoscale Transport Phenomenon",
  "unit": "4",
  "discription": "Various nanoscale systems where macroscopic laws of mass, heat, and momentum transfer break down; nonequilibrium statistical mechanics concepts such as transition state and Green-Kubo theories, and molecular simulations for modeling nanoscale transport issues will be introduced.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 259",
  "title": "Heterogeneous Catalysis",
  "unit": "4",
  "discription": "Physics and chemistry of heterogeneous catalysis; adsorption-desorption kinetics, chemical bonding, isotherms, kinetic models, selection of catalysts, poisoning, experimental techniques. Cross-listed with CENG 253. Students may not receive credit for both NANO 259 and CENG 253.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 260",
  "title": "Nanofabrication Reaction Engineering",
  "unit": "4",
  "discription": "Chemical reaction kinetics coupled with material and energy transport processes for fabrication of nanostructured materials and devices. Chemical vapor deposition, etching, and patterning of films. Nanoparticle, nanofiber, and nanotube growth. Theory, simulation, and reactor design.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 261",
  "title": "Nanoscale Energy Technology",
  "unit": "4",
  "discription": "Examines the role nanotechnology will play in addressing the many scientific and engineering challenges for new energy production. Topics include nanotechnology’s role in improving photovoltaics, fuel-cells, batteries, energy transmission, and conversion of renewable (green) and nonrenewable sources.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 262",
  "title": "Nanosensors",
  "unit": "4",
  "discription": "This course illustrates how the ability to tailor the properties of nanomaterials can be used for designing powerful sensing and biosensing devices. Nanosensors based on metal nanoparticles, semiconductor nanowires and nanocrystals, and carbon nanotubes will be covered.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 263",
  "title": "Magnetic Nanodevices",
  "unit": "4",
  "discription": "The basis of magnetism: classical and quantum mechanical points of view. Introduction to thin film and nanomagnetism, including interfacial magnetism, coupling and magneto-transport. Application of nanomagnetism in devices including magnetic recording, MRAM, magnetic processing, and biomedical engineering.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 264",
  "title": "Solid-State and Nanochemistry",
  "unit": "4",
  "discription": "Course covers concept in nano and solid-state chemistry for graduate students, with the objective of understanding nanomaterials from a chemical perspective. Topics include descriptive crystal chemistry, structure determination, free electron gas and dimensional solids, tight-binding approximation, band structure. Recommended preparation: Background equivalent to NANO 203.",
  "prerequsite": null
 },
 {
  "code": "NANO 265",
  "title": "Thermodynamics of Solids",
  "unit": "4",
  "discription": "The thermodynamics and statistical mechanics of solids. Basic concepts, equilibrium properties of alloy systems, thermodynamic information from phase diagrams, surfaces and interfaces, crystalline defects. Cross-listed with MATS 201A, MAE 271A, and ECE 238A.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 266",
  "title": "Quantum Mechanical Modeling of Materials and Nanostructures",
  "unit": "4",
  "discription": "Application of quantum mechanical modeling methods (both solid state and computational chemistry) in the study of materials and nanostructures; density functional theory (DFT) and approximations; Hartree-Fock and beyond HF approximations; hybrid density functional theory; beyond DFT (GW, TDDFT); ab initio molecular dynamics; materials properties (mechanical, electrochemical, electronic, transport, nano-scale effects on properties) from quantum mechanical simulations; high-throughput computation.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 268",
  "title": "DNA Nanotechnology",
  "unit": "4",
  "discription": "Introduction to DNA nanotechnology. Topics include basic design principles for DNA nano structures and DNA origami, DNA nano motors, computing, and the use of DNA nanotechnology in organizing other materials, nano fabrication, biosensing, and drug delivery.",
  "prerequsite": null
 },
 {
  "code": "NANO 269",
  "title": "Engineering Solar Cells at the Nanoscale",
  "unit": "4",
  "discription": "Fundamentals of photovoltaic energy conversion; limiting efficiencies, loss mechanisms. Nanoscale effects in semiconductor, thin film, and organic photovoltaics. Emphasis on emerging nanotechnologies including nanowires, heterostructures, hybrid materials, quantum dots, transparent conducting materials, and plasmonics.",
  "prerequsite": null
 },
 {
  "code": "NANO 271",
  "title": "Nanophotonics",
  "unit": "4",
  "discription": "This course will introduce a background in optics and photonics for nanoscale materials and devices and explore light-matter interactions on the nanoscale. Fundamentals of light absorption, emission, lasing, and waveguiding in nanoscale structures, optical resonances in metallic (plasmonic) and semiconductor (excitonic) nanomaterials.",
  "prerequsite": null
 },
 {
  "code": "NANO 272",
  "title": "Soft Electronics",
  "unit": "4",
  "discription": "General overview of flexible/stretchable electronic devices, with a focus on the enabling nanomaterials and structures that lead to the tolerance to extreme physical deformations. Relevant nanofabrication techniques and manufacturing approaches will also be included.",
  "prerequsite": null
 },
 {
  "code": "NANO 273",
  "title": "Principles of Immune Engineering",
  "unit": "4",
  "discription": "The course will emphasize the principles underlying the development of engineering tools to quantitatively measure complex information about the immune system that has fueled or inspired strategies for manufacturing immune cells, developing analytical methods for measuring immunity, and developing immunotherapies.",
  "prerequsite": null
 },
 {
  "code": "NANO 279",
  "title": "Advanced Electrochemical Energy Engineering",
  "unit": "4",
  "discription": "Electrochemistry and electrochemical engineering for energy applications. Thermodynamics and kinetics of electrochemical reactions; fundamental principles of batteries, super capacitors, fuel cells, and electrochemical synthesis systems; electrochemical analysis of these systems, engineering design considerations, and modeling. Practical device design and fabrication will be covered in greater detail.",
  "prerequsite": null
 },
 {
  "code": "NANO 280",
  "title": "Colloids and Nanoparticles",
  "unit": "4",
  "discription": "This course will cover fundamental concepts and laboratory techniques to study the chemical and physical properties of colloids and nanoparticles. Topics covered include colloid and surface forces, Brownian motion, aggregation, steric stabilization, optical characterization techniques, and self-assembly. Recent developments in colloids and nanotechnology will be discussed throughout the course.",
  "prerequsite": null
 },
 {
  "code": "NANO 281",
  "title": "Data Science in Materials Science",
  "unit": "4",
  "discription": "Comprehensive introduction into the application of data science to materials science. Introduction to broad array of machine learning techniques (e.g., supervised, unsupervised) and applications (e.g., regression, dimensionality reduction, classification), with a focus on practical examples in materials science.",
  "prerequsite": null
 },
 {
  "code": "NANO 282",
  "title": "Professional Development",
  "unit": "4",
  "discription": "Professional development topics include navigating the virtual library, scientific writing, individual development plan, time and project management, responsible conduct of research, grant writing (NSF fellowships, NIH F grants), plagiarism, prepping a CV ((résumé, biosketch), networking, and communication skills.",
  "prerequsite": null
 },
 {
  "code": "NANO 296",
  "title": "Independent Study in NanoEngineering",
  "unit": "4",
  "discription": "Independent reading or research on a problem as arranged by a faculty member. Must be taken for a letter grade only. ",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "NANO 299",
  "title": "Graduate Research in NanoEngineering",
  "unit": "1–12",
  "discription": "Graduate research in NanoEngineering. S/U grades only. May be taken for credit four times for a maximum of twelve units.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 4",
  "title": "Experience Chemical Engineering",
  "unit": "1",
  "discription": "Hands-on, team-based laboratory activities to demonstrate modern applications of chemical engineering, and the role of the chemical engineer in academia and industry. Emphasis on teamwork, safe laboratory practices, and student- directed problem solving.",
  "prerequsite": null
 },
 {
  "code": "CENG 15",
  "title": "Engineering Computation Using Matlab",
  "unit": "4",
  "discription": "Introduction to solution of engineering problems using computational methods. Formulating problem statements, selecting algorithms, writing computer programs, and analyzing output using Matlab. Computational problems from NanoEngineering, chemical engineering, and materials science are introduced. The course requires no prior programming skills. Cross-listed with NANO 15. Students may not receive credit for both CENG 15 and NANO 15.",
  "prerequsite": null
 },
 {
  "code": "CENG 15R",
  "title": "Engineering Computation Using Matlab Online",
  "unit": "4",
  "discription": "(Cross-listed with NANO 15R.) Introduction to solution of engineering problems using computational methods. Formulating problem statements, selecting algorithms, writing computer programs, and analyzing output using Matlab. Computational problems from NanoEngineering, chemical engineering, and materials science are introduced. This is a fully online, self-paced course that utilizes multi-platform instructional techniques (video, text, and instructional coding environments). The course requires no prior programming skills. Students may only receive credit for one of the following: CENG 15R, CENG 15, NANO 15R, or NANO 15.",
  "prerequsite": null
 },
 {
  "code": "CENG 100",
  "title": "Material and Energy Balances",
  "unit": "4",
  "discription": "Introduction to steady and time-dependent material and energy balances using a variety of problem-solving strategies. Concepts include degrees-of-freedom analysis, unit operations, multiunit systems, chemical reaction kinetics and equilibrium, and phase equilibrium.",
  "prerequsite": "CENG 4 and CHEM 6B or consent of instructor."
 },
 {
  "code": "CENG 101A",
  "title": "Introductory Fluid Mechanics",
  "unit": "4",
  "discription": "Kinematics and equation of motion; hydrostatics; Bernoulli’s equation; viscous flows; turbulence, pipe flow; boundary layers and drag in external flows; applications to chemical, structural, and bioengineering. Students may not receive credit for both MAE 101A and CENG 101A.",
  "prerequsite": "admission to the major and grades of C– or better in PHYS 2A, MATH 20D, and 20E, or consent of instructor."
 },
 {
  "code": "CENG 101B",
  "title": "Heat Transfer",
  "unit": "4",
  "discription": "Conduction, convection, radiation heat transfer; design of heat exchangers. Students may not receive credit for both MAE 101C and CENG 101B",
  "prerequsite": "admission to the major and a grade of C– or better in CENG 101A."
 },
 {
  "code": "CENG 101C",
  "title": "Mass Transfer",
  "unit": "4",
  "discription": "Diffusive and convective mass transfer in solids, liquids, and gases; steady and unsteady state; mass transfer coefficients; applications to chemical engineering and bioengineering.",
  "prerequsite": "admission to the major and grade of C– or better in CENG 101A."
 },
 {
  "code": "CENG 102",
  "title": "Chemical Engineering Thermodynamics",
  "unit": "4",
  "discription": "Thermodynamic behavior of pure substances and mixtures. Properties of solutions, phase equilibria. Thermodynamic cycles. Chemical equilibria for homogeneous and heterogeneous systems.",
  "prerequsite": "CENG 100, CHEM 6C, and MATH 20C, or consent of instructor."
 },
 {
  "code": "CENG 113",
  "title": "Chemical Reaction Engineering",
  "unit": "4",
  "discription": "Principles of chemical reactor analysis and design. Experimental determination of rate equations, design of batch and continuous reactors, optimization of selectivity in multiple reactions, consideration of thermal effects and residence time distribution. Introduction to multi-phase reactors.",
  "prerequsite": "CENG 15, CENG 100 and MATH 20D, or consent of instructor."
 },
 {
  "code": "CENG 114",
  "title": "Probability and Statistical Methods for Engineers",
  "unit": "4",
  "discription": "Probability theory, conditional probability, Bayes theorem, discrete random variables, continuous random variables, expectation and variance, central limit theorem, graphical and numerical presentation of data, least squares estimation and regression, confidence intervals, testing hypotheses. Cross- listed with NANO 114\\. Students may not receive credit for both CENG 114 and NANO 114.",
  "prerequsite": "MATH 20F or MATH 18 and CENG 15 or MAE 8 or NANO 15."
 },
 {
  "code": "CENG 120",
  "title": "Chemical Process Dynamics and Control",
  "unit": "4",
  "discription": "Examination of dynamic linear and linearized models of chemical processes. Stability analysis. Design of PID controllers. Selection of control and manipulated variables. Root locus, Bode, and Nyquist plots. Cascade, feed- forward and ratio controls.",
  "prerequsite": "admission to the major; CENG 15 or MAE 8 or NANO 15 and CENG 100, CENG 101B, CENG 113, and MATH 20D."
 },
 {
  "code": "CENG 122",
  "title": "Separation Processes",
  "unit": "4",
  "discription": "Principles of analysis and design of systems for separation of components from a mixture. Topics will include staged operations (distillation, liquid-liquid extraction), and continuous operations (gas absorption, membrane separation) under equilibrium and nonequilibrium conditions.",
  "prerequsite": "admission to the major and grades of C– or better in CENG 100, CENG 102, and CENG 101C."
 },
 {
  "code": "CENG 124A",
  "title": "Chemical Plant and Process Design I",
  "unit": "4",
  "discription": "Principles of chemical process design and economics. Process flow diagrams and cost estimation. Computer-aided design and analysis. Representation of the structure of complex, interconnected chemical processes with recycle streams. Ethics and professionalism. Health, safety, and the environmental issues.",
  "prerequsite": "admission to chemical engineering major and grades of C– or better in CENG 113 and CENG 122, or consent of instructor."
 },
 {
  "code": "CENG 124B",
  "title": "Chemical Plant and Process Design II",
  "unit": "4",
  "discription": "Engineering and economic analysis of integrated chemical processes, equipment, and systems. Cost estimation, heat and mass transfer equipment design and costs. Comprehensive integrated plant design. Optimal design. Profitability.",
  "prerequsite": "admission to chemical engineering major and grade of C– or better in CENG 124A."
 },
 {
  "code": "CENG 134",
  "title": "Polymeric Materials",
  "unit": "4",
  "discription": "Foundations of polymeric materials. Topics: structure of polymers; mechanisms of polymer synthesis; characterization methods using calorimetric, mechanical, rheological, and X-ray-based techniques; and electronic, mechanical, and thermodynamic properties. Special classes of polymers: engineering plastics, semiconducting polymers, photoresists, and polymers for medicine. Cross-listed with NANO 134\\. Students may not receive credit for both CENG 134 and NANO 134.",
  "prerequsite": "CHEM 6C and PHYS 2C."
 },
 {
  "code": "CENG 157",
  "title": "Process Technology in the Semiconductor Industry",
  "unit": "4",
  "discription": "Brief introduction to solid-state materials and devices. Crystal growth and purification. Thin film technology. Application of chemical processing to the manufacture of semiconductor devices. Topics to be covered: physics of solids, unit operations of solid state materials (bulk crystal growth, oxidation, vacuum science, chemical and physical vapor deposition, epitaxy, doping, etching). ",
  "prerequsite": "CENG 101A, CENG 101B, and CENG 101C."
 },
 {
  "code": "CENG 176A",
  "title": "Chemical Engineering Process Laboratory I",
  "unit": "4",
  "discription": "Laboratory projects in the areas of applied chemical research and unit operations. Emphasis on applications of engineering concepts and fundamentals to solution of practical and research problems.",
  "prerequsite": "CENG 113, CENG 122, and MAE 170, or consent of instructor."
 },
 {
  "code": "CENG 176B",
  "title": "Chemical Engineering Process Laboratory II",
  "unit": "4",
  "discription": "Training in planning research projects, execution of experimental work, and articulation (both oral and written) of the research plan and results in the areas of applied chemical technology and engineering operations related to mass, momentum, and heat transfer.",
  "prerequsite": "CENG 176A."
 },
 {
  "code": "CENG 199",
  "title": "Independent Study for Undergraduates",
  "unit": "4-4",
  "discription": "Independent reading or research on a problem by special arrangement with a faculty member. P/NP grades only.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 205",
  "title": "Graduate Seminar in Chemical Engineering",
  "unit": "1",
  "discription": "Each graduate student in chemical engineering is expected to attend one seminar per quarter, of his or her choice, dealing with current topics in chemical engineering. Topics will vary. P/NP grades only. May be taken for credit four times.",
  "prerequsite": null
 },
 {
  "code": "CENG 207",
  "title": "Nanomedicine",
  "unit": "4",
  "discription": "Introduction to nanomedicine; diffusion and drug dispersion; diffusion in biological systems; drug permeation through biological barriers; drug transport by fluid motion; pharmacokinetics of drug distribution; drug delivery systems; nanomedicine in practice: cancers, cardiovascular diseases, immune diseases, and skin diseases. Cross-listed with NANO 243. Students may not receive credit for both CENG 207 and NANO 243.",
  "prerequsite": null
 },
 {
  "code": "CENG 208",
  "title": "Nanofabrication",
  "unit": "4",
  "discription": "Basic engineering principles of nanofabrication. Topics include photo, electron beam, and nanoimprint lithography, block copolymers and self- assembled monolayers, colloidal assembly, biological nanofabrication. Cross- listed with NANO 208. Students may not receive credit for both CENG 208 and NANO 208.",
  "prerequsite": null
 },
 {
  "code": "CENG 210A",
  "title": "Fluid Mechanics I",
  "unit": "4",
  "discription": "Basic conservation laws, flow kinematics. The Navier-Stokes equations and some of its exact solutions, nondimensional parameters and different flow regimes, vorticity dynamics. Cross-listed with MAE 210A.",
  "prerequsite": "MAE 101A-B and MAE 110A or consent of instructor."
 },
 {
  "code": "CENG 211",
  "title": "Introduction to NanoEngineering",
  "unit": "4",
  "discription": "Understanding nanotechnology, broad implications; miniaturization: scaling laws; nanoscale physics; types and properties of nanomaterials; nanomechanical oscillators, nano(bio)electronics, nanoscale heat transfer; fluids at nanoscale; machinery cell; applications of nanobiotechnology and nanobiotechnology. Cross-listed with NANO 201. Students may not receive credit for both CENG 211 and NANO 201.",
  "prerequsite": null
 },
 {
  "code": "CENG 212",
  "title": "Intermolecular and Surface Forces",
  "unit": "4",
  "discription": "Development of quantitative understanding of the different intermolecular forces between atoms and molecules and how these forces give rise to interesting phenomena at the nanoscale, such as flocculation, wetting, and self-assembly in biological (natural) and synthetic systems. Cross-listed with NANO 202. Students may not receive credit for both CENG 212 and NANO 202.",
  "prerequsite": null
 },
 {
  "code": "CENG 213",
  "title": "Nanoscale Synthesis and Characterization",
  "unit": "4",
  "discription": "Examination of nanoscale synthesis—top-down and bottom-up; physical deposition; chemical vapor deposition; plasma processes; sol-gel processing; soft-lithography; self-assembly and layer-by-layer; molecular synthesis. Nanoscale characterization; microscopy (optical and electron: SEM, TEM); scanning probe microscopes (SEM, AFM); profilometry; reflectometry, and ellipsometry; X-ray diffraction; spectroscopies (EDX, SIMS, Mass spec, Raman, XPS); particle size analysis; electrical, optical, magnetic, mechanical, thermal. Cross-listed with NANO 203. Students may not receive credit for both CENG 213 and NANO 203.",
  "prerequsite": null
 },
 {
  "code": "CENG 214",
  "title": "Nanoscale Physics and Modeling",
  "unit": "4",
  "discription": "Expanded mathematical analysis of topics introduced in CENG 212\\. Introduction of both analytical and numerical methods through application to problems in NanoEngineering. Nanoscale systems of interest include colloidal systems, block-copolymer based self-assembled materials, molecular motors made out of DNA, RNA, or proteins, etc. Nanoscale phenomena including self-assembly at the nanoscale, phase separation within confined spaces, diffusion through nanopores and nanoslits, etc. Modeling techniques include quantum mechanics, diffusion and kinetics theories, molecular dynamics, etc. Cross-listed with NANO 204. Students may not receive credit for both CENG 214 and NANO 204.",
  "prerequsite": "CENG 212 or consent of instructor."
 },
 {
  "code": "CENG 215",
  "title": "Nanosystems Integration",
  "unit": "4",
  "discription": "Discussion of scaling issues and how to carry out the effective hierarchical assembly of diverse molecular and nanoscale components into higher order structures that retain the desired electronic/photonic, structural, mechanical, or catalytic properties at the microscale and macroscale levels. Novel ways to combine the best aspects of both top-down and bottom-up processes to create a totally unique paradigm change for the integration of heterogeneous molecules and nanocomponents into higher order structures. Cross-listed with NANO 205. Students may not receive credit for both CENG 215 and NANO 205.",
  "prerequsite": null
 },
 {
  "code": "CENG 221A",
  "title": "Heat Transfer",
  "unit": "4",
  "discription": "Conduction, convection, and radiation heat transfer development of energy conservation equations. Analytical and numerical solutions to heat transport problems. Specific topics and applications vary. Cross-listed with MAE 221A.",
  "prerequsite": "MAE 101A-B-C or CENG 101A-B-C or consent of instructor."
 },
 {
  "code": "CENG 221B",
  "title": "Mass Transfer",
  "unit": "4",
  "discription": "Fundamentals of diffusive and convective mass transfer and mass transfer with chemical reaction. Development of mass conservation equations. Analytical and numerical solutions to mass transport problems. Specific topics and applications will vary. Cross-listed with MAE 221B.",
  "prerequsite": "MAE 101A-B-C or CENG 101A-B-C or consent of instructor."
 },
 {
  "code": "CENG 230",
  "title": "Synchrotron Characterization of Nanomaterials",
  "unit": "4",
  "discription": "Advanced topics in characterizing nanomaterials using synchrotron X-ray sources. Introduction to synchrotron sources, X-ray interaction with matter, spectroscopic determination of electronic properties of nanomagnetic, structural determination using scattering techniques and X-ray imaging techniques. Cross-listed with NANO 230. Students may not receive credit for both CENG 230 and NANO 230.",
  "prerequsite": null
 },
 {
  "code": "CENG 251",
  "title": "Thermodynamics",
  "unit": "4",
  "discription": "Principles of thermodynamics of single and multicomponent systems. Phase equilibria. Estimation, calculation, and correlation of properties of liquids and gases.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 252",
  "title": "Chemical Reaction Engineering",
  "unit": "4",
  "discription": "Analysis of chemical rate processes; complex kinetic systems. Chemical reactor properties in steady state and transient operations; optimal design policies. The interaction of chemical and physical transport processes in affecting reactor design and operating characteristics. Uniqueness/multiplicity and stability in reactor systems. Applications of the heterogeneous reactor systems.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 253",
  "title": "Heterogeneous Catalysis",
  "unit": "4",
  "discription": "Physics and chemistry of heterogeneous catalysis. Adsorption/desorption kinetics, chemical bonding, isotherms, kinetic models, selection of catalysts, poisoning, experimental techniques. Cross-listed with NANO 259. Students may not receive credit for both CENG 253 and NANO 259.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 254",
  "title": "Biochemical Engineering Fundamentals",
  "unit": "4",
  "discription": "Introduction to microbiology as relevant to the main topic, biological reactor analysis. Fermentation and enzyme technology.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 255",
  "title": "Electrochemical Engineering",
  "unit": "4",
  "discription": "Fundamentals of electrochemistry and electrochemical engineering. Structure of the double layer, cell potential and electrochemical thermodynamics, charge transfer kinetics, electrochemical transport phenomena, and introduction to colloidal chemistry. Applications such as corrosion prevention, electroplating, reactor design, batteries, and fuel cells.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 256",
  "title": "Biomaterials and Biomimetics",
  "unit": "4",
  "discription": "Fundamentals of materials science as applied to bioengineering design. Hierarchical structures. Cells and tissues. Natural and synthetic polymeric materials. Biomineralized materials. Biological composites. Cellular materials (foams). Functional biological materials. Biomaterials and implants. Bioinspired design and materials. Cross-listed with NANO 252. Students may not receive credit for both CENG 256 and NANO 252. ",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 257",
  "title": "Process Technology in the Semiconductor Industry",
  "unit": "4",
  "discription": "Brief introduction to solid-state materials and devices. Crystal growth and purification. Thin film technology. Application of chemical processing to the manufacture of semiconductor devices. Topics to be covered: physics of solids, unit operations of solid-state materials (bulk crystal growth, oxidation, vacuum science, chemical and physical vapor deposition, epitaxy, doping, etching). ",
  "prerequsite": "consent of instructor. Open to chemical engineering and NanoEngineering majors."
 },
 {
  "code": "CENG 296",
  "title": "Independent Study in Chemical Engineering",
  "unit": "4",
  "discription": "Independent reading or research on a problem as arranged by a faculty member. Must be taken for a letter grade only. ",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "CENG 299",
  "title": "Graduate Research in Chemical Engineering",
  "unit": "1–12",
  "discription": "S/U grades only.",
  "prerequsite": "consent of instructor."
 }
]