[
 {
  "code": "NEU 199",
  "title": "Independent Research",
  "unit": "2 or 4",
  "description": "Laboratory research under the supervision of individual members of the faculty of the neurosciences department in one or a combination of neurosciences disciplines, e.g., neuroanatomy, neurophysiology, neurochemistry, neuropharmacology. (P/NP grades only.) (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "NEU 200A-B-C",
  "title": "Basic Neuroscience",
  "unit": "4-4-4",
  "description": "These courses are designed for graduate students in the neurosciences and other departments that are part of the interdisciplinary program (i.e., biology, cognitive science, psychology). These courses have been designed to cover as much basic neuroscience as possible in three quarters of study. It will combine two three-hour meetings each week with a 1.5 hour lecture and a 1.5 hour discussion of papers. These will be required courses for all first- year neurosciences graduate students. Biology will cross-list courses under biology headings, making it a requirement of first-year biology graduate students.",
  "prerequisite": "graduate student or consent of instructor. (F,W,S)"
 },
 {
  "code": "NEU 210",
  "title": "Neurobiology Boot Camp",
  "unit": "4",
  "description": "For incoming doctoral students in neurobiology, computational neurosciences, and neurosciences. During the first two weeks in September, students commit to ten to fifteen hours per day in lectures and laboratories in electrophysiology, cellular anatomy, molecular biology, optical imaging, and computational neurobiology. Students also attend weekly seminars during fall quarter.",
  "prerequisite": "graduate standing only. For students in the following major codes: BI77, BI79, NE75, NE78."
 },
 {
  "code": "NEU 241",
  "title": "Ethics and Survival Skills in Academia",
  "unit": "3",
  "description": "This course will cover “ethical” issues in academia, including dishonesty, plagiarism, attribution, sexual misconduct, etc. We will also discuss “survival” issues, including job hunting, grant preparation, journal reviews, writing letters of recommendation, mentoring, etc. (W)",
  "prerequisite": null
 },
 {
  "code": "NEU 243",
  "title": "Physiological Basis of Human Information",
  "unit": "2",
  "description": "Psychological processes including attention, perception, and memory will be studied in connection with event-related potentials of the human brain. The interrelations among psychological and physiological events will be explored in order to arrive at unified concepts of human information processing.",
  "prerequisite": "NEU 238 or PSYC 231, and consent of instructor. (S/U grades only.) (F)"
 },
 {
  "code": "NEU 266",
  "title": "Development of Neural Circuits",
  "unit": "4",
  "description": "Course focuses on developmental processes during formation of neural circuits. Molecular, genetic, cellular mechanisms controlling neurogenesis, neuronal differentiation, positioning (migration), axon/dendrite patterning, and synapse formation will be discussed. Role of neural activity shaping circuit formation will be explored.",
  "prerequisite": "graduate standing only. For students in the following major codes: NE75, NE78, BI77, BI79, or consent of instructor."
 },
 {
  "code": "NEU 268",
  "title": "Molecular and Cellular Neurobiology",
  "unit": "4",
  "description": "Molecular and cellular approaches to the study of the nervous system are advancing neurobiology at an increasingly rapid pace. This graduate-level course will address the latest molecular advances in the areas of: 1) synapse formation, neurotransmitter release, and neurotransmitter receptors; 2) nerve growth factors, their receptors, and neuronal apoptosis; 3) transcriptional regulation in the brain and peripheral nervous system; 4) cell culture, transgenic, and knock-out mouse model systems; 5) the molecular bases of genetic, psychiatric, and degenerative diseases of the nervous system; and 6) the current molecular knowledge of vision, sensory transduction, circadian rhythms, learning, memory, and behavior.",
  "prerequisite": null
 },
 {
  "code": "NEU 270A",
  "title": "Neurobiology of Disease: Mechanisms of Neurodegeneration",
  "unit": "4",
  "description": "This course will blend research and clinical perspectives to allow comprehensive learning of CNS diseases. For each two-week disease block, students will read, present, and discuss current research publications which will be paired with a lecture by a research scientist who will describe the major features of each disorder, hypothesis being explored, and the state of therapeutics. The following session will involve a physician presenting an adult patient with the condition, and students will have the opportunity to ask questions of both the physician and the patient. Priority enrollment given to PhD and MD students. MS and undergraduate enrollment permission to be granted by the instructor.",
  "prerequisite": null
 },
 {
  "code": "NEU 270B",
  "title": "Neurobiology of Disease: Neurodevelopmental Disorders",
  "unit": "4",
  "description": "This course will blend research and clinical perspectives to allow comprehensive learning of CNS neurodevelopmental disorders. For each two-week block, students will read, present, and discuss current research publications which will be paired with a lecture by a research scientist who will describe the major features of each disorder, hypothesis being explored, and the state of therapeutics. The following session will involve a physician presenting an adult patient with the condition, and students will have the opportunity to ask questions of both the physician and the patient. Priority enrollment given to PhD and MD students. MS and undergraduate enrollment permission to be granted by the instructor.",
  "prerequisite": null
 },
 {
  "code": "NEU 276",
  "title": "Neuroscience Research Rounds",
  "unit": "1",
  "description": "Neurosciences group faculty members and graduate students will present and discuss ongoing research. Attendance will be mandatory for first- and second- year graduate students. Faculty, advanced graduate students, medical students, postdoctoral trainees, and other interested parties are encouraged to attend. (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "NEU 277",
  "title": "Neuropsychopharmacology",
  "unit": "4",
  "description": "An examination of the molecular and biochemical bases of drug and transmitter action. The course is devoted to receptor mechanisms, neuropharmacology, and drug action on excitable tissues.",
  "prerequisite": "graduate standing. (S)"
 },
 {
  "code": "NEU 285",
  "title": "Clinical Trails: Issues and Dilemmas in Clinical Trials",
  "unit": "2",
  "description": "This course provides a methodological perspective on clinical trials. Topics will include ethics, design of Phase I-IV trials, randomization/blinding, bias, and sample-size power. Lectures will also cover “application” with eminent UC San Diego trialists describing conduct, design, and statistical issues of specific studies.",
  "prerequisite": "medical or graduate student standing."
 },
 {
  "code": "NEU 298",
  "title": "Neurosciences Independent Study Project (ISP)",
  "unit": "1-12",
  "description": "",
  "prerequisite": "approved ISP proposal. (F,W,S)"
 },
 {
  "code": "NEU 401",
  "title": "Neurology General Clinical Selective Clerkship",
  "unit": "7",
  "description": "Provides opportunities for practical application of neurological skills to the understanding and treatment of a variety of clinical disorders of the nervous system.",
  "prerequisite": "successful completion of first two years of medical school. (F,W,S)"
 },
 {
  "code": "NEU 426",
  "title": "Subintern Pediatric Neurology",
  "unit": "7",
  "description": "Subinterns are responsible for the primary care of hospitalized pediatric neurology patients under direct resident and attending physician supervision. Students will perform procedures such as lumbar puncture and participate in night call, daily teaching round, neurology grand rounds, and journal clubs.",
  "prerequisite": "Neurology 401 or consent of instructor. (F,W,S)"
 },
 {
  "code": "NEU 427",
  "title": "Neurology Outpatient",
  "unit": "7",
  "description": "The student will rotate through the general and subspecialty (stroke, epilepsy, headache, nerve, and muscle) neurology clinics based at UC San Diego Medical Center, Perlman, VAMC, and Children's Hospital. There are lectures and clinical conferences.",
  "prerequisite": "Neurosciences 401 or equivalent. (F,W,S)"
 },
 {
  "code": "NEU 496",
  "title": "Clinical Independent Study",
  "unit": "1-21",
  "description": "Independent clinical study for medical students (S/U grades only.) (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "NEUG 221",
  "title": "Advanced Topics in Neurosciences",
  "unit": "2",
  "description": "Specialized advanced topic areas in neurosciences will be addressed in an interactive seminar course format. A different specific topic will be considered each quarter as announced in advance. Students will each present an aspect of the topic area and participate in discussions.",
  "prerequisite": "priority given to neuroscience PhD students, or consent of instructor. (F,W,S)"
 },
 {
  "code": "NEUG 231",
  "title": "Tools for Experimental Data Analysis",
  "unit": "4",
  "description": "This course will cover a set of general data analysis methods that are broadly applicable in many different subdisciplines of psychology/neuroscience. Topics include model fitting, information theory, Fourier analysis, and machine learning. NEUG 231 is renumbered from NEU 231. Students may only receive credit for one of the following: PSYC 231, NEUG 231, NEU 231. Recommended preparation: Matlab, Python, C, Java, R, or any related language.",
  "prerequisite": null
 },
 {
  "code": "NEUG 240",
  "title": "Mathematical Foundations for Computational Neuroscience",
  "unit": "3",
  "description": "This course teaches mathematical concepts in neuroscience to students inexperienced in computation and mathematics. Topics from linear algebra, calculus, information theory, digital signal processing, graph theory, and machine learning will be covered. An optional weekly tutorial will teach computing basics. Priority enrollment is given to PhD students. MS students may enroll with instructor approval. Calculus AB is recommended but not required.",
  "prerequisite": null
 },
 {
  "code": "NEUG 257",
  "title": "Neuroanatomy",
  "unit": "4",
  "description": "Neuroanatomy with functional correlates, concentrating on mammals but also including other chordates and other phyla. Includes laboratory sessions with whole brains, gross sections, and histology. Labs are often simultaneous with lectures to permit interactive identification and contextualization of anatomical structures.",
  "prerequisite": "for neurosciences graduate students in major codes NE75 and NE78. Other disciplines may enroll with consent of instructor of record. (W)"
 },
 {
  "code": "NEUG 265",
  "title": "Mechanisms of Pain",
  "unit": "2",
  "description": "Anatomical and pharmacological substrates activated following tissue or nerve injury will be discussed. Changes in afferents and spinal cord, including increased expressions of channels and receptors during chronic pain states will be emphasized. Clinical relevance and treatment will be included. (S/U grades only.) (F)",
  "prerequisite": null
 },
 {
  "code": "NEUG 280",
  "title": "Minor Proposition",
  "unit": "4",
  "description": "This intensive writing course offers graduate students in the neurosciences the opportunity to propose and defend an original research project. Students are required to select a research problem in the neurosciences and propose an experimental approach for solving it.",
  "prerequisite": "neurosciences PhD majors only; NE75, NE78, and NE80. (S/U grades only.)"
 },
 {
  "code": "NEUG 296",
  "title": "Neurosciences Research Rotation",
  "unit": "1-12",
  "description": "Independent study. (S/U grades only.) (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "NEUG 299",
  "title": "Neurosciences Research",
  "unit": "1-12",
  "description": "Independent study. (S/U grades only.) (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "NEUG 500",
  "title": "Apprenticeship Teaching",
  "unit": "1-4",
  "description": "Participation in the department teaching program is required of all students working toward a PhD. In general, students are not expected to teach in the first year but are required to serve as teaching assistants or tutors for one quarter at any time during their subsequent years of training. The amount of teaching required is equivalent to the duties expected of a 50 percent assistant for one quarter.",
  "prerequisite": "neurosciences graduate students. (S/U grades only.) (F,W,S)"
 }
]