[
 {
  "code": "PHIL 1",
  "title": "Introduction to Philosophy",
  "unit": "4",
  "description": "A general introduction to some of the fundamental questions, texts, and methods of philosophy. Multiple topics will be covered, and may include the existence of God, the nature of mind and body, free will, ethics and political philosophy, knowledge and skepticism.",
  "prerequisite": null
 },
 {
  "code": "PHIL 10",
  "title": "Introduction to Logic",
  "unit": "4",
  "description": "Basic concepts and techniques in both informal and formal logic and reasoning, including a discussion of argument, inference, proof, and common fallacies, and an introduction to the syntax, semantics, and proof method in sentential (propositional) logic. May be used to fulfill general-education requirements for Warren and Eleanor Roosevelt Colleges.",
  "prerequisite": null
 },
 {
  "code": "PHIL 12",
  "title": "Scientific Reasoning",
  "unit": "4",
  "description": "Strategies of scientific inquiry: how elementary logic, statistical inference, and experimental design are integrated to evaluate hypotheses in the natural and social sciences. May be used to fulfill general-education requirements for Marshall, Warren, and Eleanor Roosevelt Colleges.",
  "prerequisite": null
 },
 {
  "code": "PHIL 13",
  "title": "Introduction to Philosophy: Ethics",
  "unit": "4",
  "description": "An inquiry into the nature of morality and its role in personal or social life by way of classical and/or contemporary works in ethics. May be used to fulfill general-education requirements for Muir and Marshall Colleges.",
  "prerequisite": null
 },
 {
  "code": "PHIL 14",
  "title": "Introduction to Philosophy: The Nature of Reality",
  "unit": "4",
  "description": "A survey of central issues and figures in the Western metaphysical tradition. Topics include the mind-body problem, freedom and determinism, personal identity, appearance and reality, and the existence of God.",
  "prerequisite": null
 },
 {
  "code": "PHIL 15",
  "title": "Introduction to Philosophy: Knowledge and Its Limits",
  "unit": "4",
  "description": "A study of the grounds and scope of human knowledge, both commonsense and scientific, as portrayed in the competing traditions of Continental rationalism, British empiricism, and contemporary cognitive science.",
  "prerequisite": null
 },
 {
  "code": "PHIL 16",
  "title": "Science Fiction and Philosophy",
  "unit": "4",
  "description": "An introduction to philosophy which uses science fiction to make abstract philosophical problems vivid. Science fiction themes may include time travel, teleportation, virtual reality, super-intelligent robots, futuristic utopias, and parallel universes. These scenarios raise philosophical questions about knowledge, reality, ethics, and the mind.",
  "prerequisite": null
 },
 {
  "code": "PHIL 24",
  "title": "Science and Pseudoscience",
  "unit": "4",
  "description": "The differences among good science, bad science, and pseudoscience. Topics include the philosophical and practical demarcation problems; science and values; probabilistic fallacies, cognitive biases, and perceptual illusions; causation versus correlation, the placebo effect; why and when science is trustworthy; and case studies ranging from ESP to homeopathy to climate change denialism.",
  "prerequisite": null
 },
 {
  "code": "PHIL 25",
  "title": "Science, Philosophy, and the Big Questions",
  "unit": "4",
  "description": "An inquiry into fundamental questions at the intersection of science and philosophy. Topics can include Einstein’s universe; scientific revolutions; the mind and the brain.",
  "prerequisite": null
 },
 {
  "code": "PHIL 26",
  "title": "Science, Society, and Values",
  "unit": "4",
  "description": "An exploration of the interaction between scientific theory and practice on the one hand, and society and values on the other. Topics can include the relationship between science and religion, global climate change, DNA, medicine, and ethics.",
  "prerequisite": null
 },
 {
  "code": "PHIL 27",
  "title": "Ethics and Society",
  "unit": "4",
  "description": "An examination of ethical principles (e.g., utilitarianism, individual rights, etc.) and their social and political applications to contemporary issues: abortion, environmental protection, and affirmative action. Ethical principles will also be applied to moral dilemmas in government, law, business, and the professions. Warren College students must take course for a letter grade in order to satisfy the Warren College general-education requirement.",
  "prerequisite": "CAT 2 and 3 or DOC 2 and 3 or MCWP 40 and 50 or HUM 1 and 2 or MMW 2 and 3 or WCWP 10A and B."
 },
 {
  "code": "PHIL 28",
  "title": "Ethics and Society II",
  "unit": "4",
  "description": "An examination of a single set of major contemporary social, political, or economic issues (e.g., environmental ethics, international ethics) in light of ethical and moral principles and values. Warren College students must take course for a letter grade in order to satisfy the Warren College general- education requirement.",
  "prerequisite": "PHIL 27 or POLI 27."
 },
 {
  "code": "PHIL 31",
  "title": "Introduction to Ancient Philosophy",
  "unit": "4",
  "description": "A survey of classical Greek philosophy with an emphasis on Socrates, Plato and Aristotle, though some consideration may be given to Pre-Socratic and/or Hellenistic philosophers.",
  "prerequisite": null
 },
 {
  "code": "PHIL 32",
  "title": "Philosophy and the Rise of Modern Science",
  "unit": "4",
  "description": "Beginning with the contrast between medieval and early modern thought, the course focuses on the relation of seventeenth-century philosophy and the emergence of modern natural science. Figures to be studied may include Bacon, Galileo, Descartes, Cavendish, Hobbes, Leibniz, and Newton.",
  "prerequisite": null
 },
 {
  "code": "PHIL 33",
  "title": "Philosophy between Reason and Despair",
  "unit": "4",
  "description": "Introduction to nineteenth-century philosophy, focusing on skepticism about the authority of reason to answer questions about the ultimate meaning and value of human life. Figures discussed may include Kant, Schopenhauer, Kierkegaard, Nietzsche, Goldman, and de Beauvoir.",
  "prerequisite": null
 },
 {
  "code": "PHIL 35",
  "title": "Philosophy in the Americas",
  "unit": "4",
  "description": "An exploration of central philosophical issues as they have been taken up in the diverse philosophical traditions of the Americas, such as indigenous philosophy, Latin American philosophy, American Pragmatism, and the Civil Rights movement, among others. Topics may include ethics, social and political philosophy, colonialism, philosophy of race and gender, environmentalism, and issues in philosophy of language.",
  "prerequisite": null
 },
 {
  "code": "PHIL 50",
  "title": "Law and Society",
  "unit": "4",
  "description": "A survey of philosophical issues concerning law and society, such as the rule of law, the moral limits of the law, individual rights, judicial review in a constitutional democracy, the justification of punishment, and responsibility.",
  "prerequisite": null
 },
 {
  "code": "PHIL 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "PHIL 90",
  "title": "Basic Problem in Philosophy",
  "unit": "4",
  "description": "An investigation of a selected philosophical topic through readings, discussions, and written assignments. May be taken for credit twice, when topics vary.",
  "prerequisite": null
 },
 {
  "code": "PHIL 100",
  "title": "Plato",
  "unit": "4",
  "description": "A study of Socrates and/or Plato through major dialogues of Plato. Possible topics include the virtues and happiness; weakness of the will; political authority and democracy; the theory of Forms and sensible flux; immortality; relativism, skepticism, and knowledge. May be repeated for credit with change of content and approval of instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 101",
  "title": "Aristotle",
  "unit": "4",
  "description": "A study of major issues in Aristotle's works, such as the categories; form and matter; substance, essence, and accident; the soul; virtue, happiness, and politics.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 102",
  "title": "Hellenistic Philosophy",
  "unit": "4",
  "description": "A study of selected texts from the main schools of Hellenistic philosophy—Stoicism, Epicureanism, and Skepticism.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 105",
  "title": "Topics in Early Modern Philosophy",
  "unit": "4",
  "description": "A study of one or more figures from seventeenth- and/or eighteenth-century philosophy, such as Bacon, Descartes, Hobbes, Cavendish, Conway, Spinoza, Locke, Malebranche, Leibniz, Astell, Berkeley, Du Chatelet, Hume, or Reid. The focus may be on particular texts or intellectual themes and traditions. May be taken for credit up to two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 106",
  "title": "Kant",
  "unit": "4",
  "description": "A study of selected portions of The Critique of Pure Reason and other theoretical writings and/or his major works in moral theory. May be repeated for credit with change in content and approval of the instructor.",
  "prerequisite": "PHIL 32 or 33 or 104 or 105 or 111 or 112 or consent of instructor."
 },
 {
  "code": "PHIL 107",
  "title": "Hegel",
  "unit": "4",
  "description": "A study of one or more of Hegel's major works, in particular, The Phenomenology of Spirit and The Philosophy of Right. Readings and discussion may also include other figures in the Idealist tradition—such as Fichte, Hölderlin, and Schelling—and critics of the Idealist tradition—such as Marx and Kierkegaard.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 108",
  "title": "Nineteenth-Century Philosophy",
  "unit": "4",
  "description": "A study of one or more figures in nineteenth-century philosophy, such as Schopenhauer, Nietzsche, Kierkegaard, Marx, Emerson, Thoreau, Goldman, Luxemburg, James, and Mill. The focus may be on particular figures or intellectual themes and traditions. May be repeated for credit with change of content and approval of instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 109",
  "title": "History of Analytic Philosophy",
  "unit": "4",
  "description": "Central texts, figures, and traditions in analytic philosophy. Figures may include Frege, Russell, Wittgenstein, Carnap, Moore, Austin, Quine, and Anscombe. May be repeated for credit with change of content and approval of the instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 110",
  "title": "History of Philosophy: Ancient",
  "unit": "4",
  "description": "An examination of ancient Greek philosophy, focusing on major works of Plato and Aristotle. PHIL 10, PHIL 111, and PHIL 112 should be taken in order.",
  "prerequisite": "upper-division standing and department stamp or consent of instructor."
 },
 {
  "code": "PHIL 111",
  "title": "History of Philosophy: Early Modern",
  "unit": "4",
  "description": "An examination of seventeenth- and eighteenth-century philosophy, focusing on major works of Descartes, Locke, and Hume. PHIL 110, PHIL 111, and PHIL 112 should be taken in order.",
  "prerequisite": "PHIL 110, upper-division standing and department stamp or consent of instructor."
 },
 {
  "code": "PHIL 112",
  "title": "History of Philosophy: Late Modern",
  "unit": "4",
  "description": "An examination of late eighteenth and nineteenth-century philosophy, focusing on major works of Kant and Hegel. PHIL 110, PHIL 111, and PHIL 112 should be taken in order.",
  "prerequisite": "PHIL 111, upper-division standing and department stamp or consent of instructor."
 },
 {
  "code": "PHIL 115",
  "title": "Philosophical Methods Seminar",
  "unit": "4",
  "description": "This course provides an introduction to the techniques of philosophical inquiry through detailed study of selected philosophical texts and through extensive training in philosophical writing based on those texts. Enrollment limited and restricted to majors; must be taken for letter grade. May not be repeated for credit.",
  "prerequisite": "open to philosophy majors only."
 },
 {
  "code": "PHIL 120",
  "title": "Symbolic Logic I",
  "unit": "4",
  "description": "The syntax, semantics, and proof-theory of first order monadic and polyadic predicate logic. In this course, we will learn how to determine whether arguments that can be represented in first order predicate logic are deductively valid, how to symbolize English arguments, the rules of a natural deduction system, how to apply those rules to determine the logical status of symbolized arguments, and how to use semantic methods for determining validity and invalidity.",
  "prerequisite": "PHIL 10 or consent of instructor."
 },
 {
  "code": "PHIL 122",
  "title": "Advanced Topics in Logic",
  "unit": "4",
  "description": "Topics vary from year to year. They include Metalogic (Mathematical Logic), Modal Logic, Foundations of Logic, Foundations of Set Theory, Gödel’s Incompleteness Theorems, and others.",
  "prerequisite": "PHIL 120 or consent of instructor."
 },
 {
  "code": "PHIL 123",
  "title": "Philosophy of Logic",
  "unit": "4",
  "description": "Philosophical issues underlying standard and nonstandard logics, the nature of logical knowledge, the relation between logic and mathematics, the revisability of logic, truth and logic, ontological commitment and ontological relativity, logical consequence, etc. May be repeated for credit with change in content and approval of instructor.",
  "prerequisite": "PHIL 120 or consent of instructor."
 },
 {
  "code": "PHIL 124",
  "title": "Philosophy of Mathematics",
  "unit": "4",
  "description": "The character of logical and mathematical truth and knowledge; the relations between logic and mathematics; the significance of Gödel's Incompleteness Theorem; Platonism, logicism, and more recent approaches.",
  "prerequisite": "PHIL 120 or consent of instructor."
 },
 {
  "code": "PHIL 125",
  "title": "Probability and Decision Theory",
  "unit": "4",
  "description": "A survey of theories of rational inference and rational choice, covering topics in probability and decision theory, formal epistemology, and statistics. This course provides an introduction to formal methods widely used in contemporary philosophy. May be taken for credit up to two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 130",
  "title": "Metaphysics",
  "unit": "4",
  "description": "Central problems in metaphysics, such as free will and determinism, the mind- body problem, personal identity, causation, primary and secondary qualities, the nature of universals, necessity, and identity.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 131",
  "title": "Topics in Metaphysics",
  "unit": "4",
  "description": "An in-depth study of some central problem, figure, or tradition in metaphysics. May be repeated for credit with change of content and approval of instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 132",
  "title": "Epistemology",
  "unit": "4",
  "description": "Central problems in epistemology such as skepticism; a priori knowledge; knowledge of other minds; self-knowledge; the problem of induction; foundationalist, coherence, and causal theories of knowledge.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 134",
  "title": "Philosophy of Language",
  "unit": "4",
  "description": "Examination of contemporary debates about meaning, reference, truth, and thought. Topics include descriptional theories of reference, sense and reference, compositionality, truth, theories of meaning, vagueness, metaphor, and natural and formal languages.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 136",
  "title": "Philosophy of Mind",
  "unit": "4",
  "description": "Different conceptions of the nature of mind and its relation to the physical world. Topics include identity theories, functionalism, eliminative materialism, internalism and externalism, subjectivity, other minds, consciousness, self-knowledge, perception, memory, and imagination.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 137",
  "title": "Moral Psychology",
  "unit": "4",
  "description": "The nature of action and psychological explanation. Topics include action individuation, reasons as causes, psychological laws, freedom and responsibility, weakness of will, self-deception, and the emotions.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 138",
  "title": "Responsibility",
  "unit": "4",
  "description": "A study of the nature and significance of responsibility. Possible topics include freedom, determinism, and responsibility; moral luck; responsibility and reactive attitudes such as blame and forgiveness; responsibility and situationism; moral and criminal responsibility; responsibility and excuse; insanity and psychopathy, immaturity, addiction, provocation, and duress.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 139",
  "title": "Global Justice",
  "unit": "4",
  "description": "Social justice issues as they arise across the borders of nation-states. Topics may include nationalism and cosmopolitanism, theories of just war and just warfare, issues of migration and immigration, global distributive justice and fair trade, and international cooperation in the face of global problems such as climate change and human rights violations.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 140",
  "title": "Free Will",
  "unit": "4",
  "description": "Investigation into the nature of free will, including arguments for and against its compatibility with a scientific picture of the world and competing accounts of the metaphysics of free will. Possible topics include disputes about the nature of free will; what it is for agents to cause actions; the nature of abilities or capacities to act; the relevance of neuroscience to accounts of free will; whether free will skepticism is a stable view; and experimental research on free will.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 141",
  "title": "The Meaning of Life",
  "unit": "4",
  "description": "This course considers whether human life has meaning, and, if so, what meaning it has and under what conditions such meaning may be secured. Negative proposals considered include that life is nothing but suffering, that it is absurd, that it has no meaning. Positive proposals considered include that meaning derives from free choices, from just being, from some passion, from something transcendent, or from human relationships or purposeless play or knowledge or achievement or morality. ",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 142",
  "title": "Philosophy of Emotion",
  "unit": "4",
  "description": "The nature, function, and value of emotion. Topics include theoretical approaches to defining (and distinguishing particular) emotions; the roles of emotions in structuring perception, cognition, and action; the rationality of emotion; morality and the emotions; emotions and mental/social well-being; and specific emotions such as fear or grief. May be taken for credit up to two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 145",
  "title": "Philosophy of Science",
  "unit": "4",
  "description": "Central problems in philosophy of science, such as the nature of confirmation and explanation, the nature of scientific revolutions and progress, the unity of science, and realism and antirealism.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 146",
  "title": "Philosophy of Physics",
  "unit": "4",
  "description": "Philosophical problems in the development of modern physics, such as the philosophy of space and time, the epistemology of geometry, the philosophical significance of Einstein's theory of relativity, the interpretation of quantum mechanics, and the significance of modern cosmology.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 147",
  "title": "Philosophy of Biology",
  "unit": "4",
  "description": "Philosophical problems in the biological sciences, such as the relation between biology and the physical sciences, the status and structure of evolutionary theory, and the role of biology in the social sciences.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 148",
  "title": "Philosophy and the Environment",
  "unit": "4",
  "description": "Investigation of ethical and epistemological questions concerning our relationship to the environment. Topics may include the value of nature, biodiversity, policy and science, and responsibility to future generations.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 149",
  "title": "Philosophy of Psychology",
  "unit": "4",
  "description": "Philosophical issues raised by psychology, including the nature of psychological explanation, the role of nature versus nurture, free will and determinism, and the unity of the person.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 150",
  "title": "Philosophy of the Cognitive Sciences",
  "unit": "4",
  "description": "Theoretical, empirical, methodological, and philosophical issues at work in the cognitive sciences (e.g., psychology, linguistics, neuroscience, artificial intelligence, and computer science), concerning things such as mental representation, consciousness, rationality, explanation, and nativism.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 151",
  "title": "Philosophy of Neuroscience",
  "unit": "4",
  "description": "An introduction to elementary neuroanatomy and neurophysiology and an examination of theoretical issues in cognitive neuroscience and their implications for traditional philosophical conceptions of the relation between mind and body, perception, consciousness, understanding, emotion, and the self.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 152",
  "title": "Philosophy of Social Science",
  "unit": "4",
  "description": "Philosophical issues of method and substance in the social sciences, such as causal and interpretive models of explanation, structuralism and methodological individualism, value neutrality, and relativism.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 155",
  "title": "Mexican Philosophy",
  "unit": "4",
  "description": "Introduction to Mexican philosophy with discussion of the work of such figures as Las Casas, Sor Juana Ines de la Cruz, Vasconcelos, Uranga, Zea, Villoro, Dussel, Hierro, Lara, and Hurtado. Topics may include historical movements, such as scholasticism, positivism, Mexican existentialism, and indigenous thought, as well as contemporary developments and the relationship to philosophy in the United States, Europe, and elsewhere.",
  "prerequisite": null
 },
 {
  "code": "PHIL 156",
  "title": "Latinx Philosophy",
  "unit": "4",
  "description": "Philosophical issues surrounding Latina/o/x peoples, which may include debates about the nature, function, and stability of this identity; social and political issues, such as immigration, economics, racial politics, and justice; phenomenological and existential accounts of latinidad; Latina feminism; and the relationship of these concerns to other philosophical traditions.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 158",
  "title": "Topics in Chinese Philosophy",
  "unit": "4",
  "description": "A study of one or more highly influential figures from Chinese philosophy, such as Confucius, Mozi, Mencius, Laozi, Zhuangzi, Xunzi, Han Feizi, and later Chinese thinkers. The focus may be on particular texts or intellectual themes and traditions. May be taken for credit up to two times. ",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 159",
  "title": "Metaethics",
  "unit": "4",
  "description": "An examination of foundational questions about morality, including issues such as ethical objectivity; the relation between science and ethics; metaphysical, epistemological, and semantic issues about ethics; moral expertise; moral conflict; moral motivation; morality and practical reason; and the rational authority of morality. May be taken for credit up to two times. ",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 160",
  "title": "Ethical Theory",
  "unit": "4",
  "description": "Systematic and/or historical perspectives on central issues in ethical theory such as deontic, contractualist, and consequentialist conceptions of morality; rights and special obligations; the role of happiness and virtue in morality; moral conflict; ethical objectivity and relativism; and the rational authority of morality.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 161",
  "title": "Topics in the History of Ethics",
  "unit": "4",
  "description": "Central issues and texts in the history of ethics. Subject matter can vary, ranging from one philosopher (e.g., Confucius, Aristotle, Kant, or Mill) to a historical tradition (e.g., Greek ethics or the British moralists). May be repeated for credit with change in content and approval of instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 162",
  "title": "Contemporary Moral Issues",
  "unit": "4",
  "description": "An examination of contemporary moral issues, such as abortion, euthanasia, war, affirmative action, and freedom of speech.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 163",
  "title": "Biomedical Ethics",
  "unit": "4",
  "description": "Moral issues in medicine and the biological sciences, such as patient's rights and physician's responsibilities, abortion and euthanasia, the distribution of health care, experimentation, and genetic intervention.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 164",
  "title": "Technology and Human Values",
  "unit": "4",
  "description": "Philosophical issues involved in the development of modern science, the growth of technology, and control of the natural environment. The interaction of science and technology with human nature and political and moral ideals.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 165",
  "title": "Freedom, Equality, and the Law",
  "unit": "4",
  "description": "Examination of freedom and equality under the US Constitution, focusing on Supreme Court cases concerning discrimination on grounds of race, ethnic background, gender, undocumented status, wealth, and sexual orientation, and cases regarding contraceptives, abortion, interracial marriage, polygamy, and same-sex marriage.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 166",
  "title": "Classics in Political Philosophy",
  "unit": "4",
  "description": "Central issues about the justification, proper functions, and limits of the state through classic texts in the history of political philosophy by figures such as Plato, Aristotle, Hobbes, Locke, Rousseau, Marx, and Arendt.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 167",
  "title": "Contemporary Political Philosophy",
  "unit": "4",
  "description": "Different perspectives on central issues in contemporary political philosophy, such as the nature of state authority and political obligation, the limits of government and individual liberty, liberalism and its critics, equality and distributive justice.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 168",
  "title": "Philosophy of Law",
  "unit": "4",
  "description": "A study of issues in analytical jurisprudence such as the nature of law, the relation between law and morality, and the nature of legal interpretation and issues in normative jurisprudence such as the justification of punishment, paternalism and privacy, freedom of expression, and affirmative action.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 169",
  "title": "Feminism and Philosophy",
  "unit": "4",
  "description": "Philosophical examination of core concepts and theses in feminism, feminist philosophy, and critiques of traditional philosophical approaches to morality, politics, and science, from a feminist perspective. May also treat the historical development of feminist philosophy and its critiques. May be taken for credit two times with permission of instructor.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 170",
  "title": "Philosophy and Race",
  "unit": "4",
  "description": "A philosophical investigation of the topics of race and racism. The role of “race” in ordinary speech. The ethics of racial discourse. Anthropological and biological conceptions of race. The social and political significance of racial categories. Post-racialist conceptions of race.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 171",
  "title": "Topics in Philosophy of Law",
  "unit": "4",
  "description": "An in-depth analysis of one or more issues in philosophy of law. Topics might include legal positivism and natural law, legal and constitutional interpretation, judicial review within a constitutional democracy, First Amendment jurisprudence, substantive due process and equal protection, the limits of the criminal law, responsibility and punishment, psychiatry and the law, and the moral foundations of civil law. May be taken for credit up to two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 172",
  "title": "Topics in Political Philosophy",
  "unit": "4",
  "description": "An in-depth analysis of a central problem, figure, or tradition in political philosophy. Topics may include minority rights, war and peace, political philosophy as it pertains to animals or the environment, immigration, ideal vs. non-ideal theory, or a detailed examination of a contemporary thinker or school of political thought. Content may vary. May be taken for credit up to two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 173",
  "title": "Topics in Bioethics",
  "unit": "4",
  "description": "An in-depth exploration of an issue in bioethics. Topics will vary, and may include the ethics of genetic engineering, mental capacity and genuinely informed consent, the just distribution of health care, the ethics of geo- engineering, and the ethics of climate change and health. May be taken for credit two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 174",
  "title": "Data Ethics",
  "unit": "4",
  "description": "A survey of ethical issues arising in the collection, storage, analysis, consolidation, and application of data. Topics may include data as property and public resource, privacy and surveillance, data and discrimination, algorithms and fairness, and data regulation.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "PHIL 175",
  "title": "Aesthetics",
  "unit": "4",
  "description": "Central issues in philosophical aesthetics such as the nature of art and aesthetic experience, the grounds of artistic interpretation and evaluation, artistic representation, and the role of the arts in education, culture, and politics. May be taken for credit two times.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 177",
  "title": "Philosophy and Literature",
  "unit": "4",
  "description": "A study of philosophical themes contained in selected fiction, drama, or poetry, and the philosophical issues that arise in the interpretation, appreciation, and criticism of literature.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 178",
  "title": "Topics in German Philosophy Translation—Intermediate",
  "unit": "2",
  "description": "Careful, line-by-line translation of passages of intermediate difficulty from German philosophical texts, both classic (Kant, Fichte, Hegel, Schopenhauer) and contemporary (Heidegger, Wittgenstein, Habermas). P/NP grades only. May be taken for credit six times as topics vary. LIGM 1D or equivalent level of study recommended.",
  "prerequisite": "consent of instructor and preauthorization."
 },
 {
  "code": "PHIL 179",
  "title": "Topics in German Philosophy Translation—Advanced",
  "unit": "2",
  "description": "Continuation of PHIL 178 in the careful, line-by-line translation of passages of advanced difficulty from German philosophical texts, both classic (Kant, Fichte, Hegel, Schopenhauer) and contemporary (Heidegger, Wittgenstein, Habermas). May be repeated for credit as topics vary",
  "prerequisite": "consent of instructor or completion of PHIL 178."
 },
 {
  "code": "PHIL 180",
  "title": "Phenomenology",
  "unit": "4",
  "description": "An examination of the phenomenological tradition through the works of its major classical and/or contemporary representatives. Authors studied will vary and may include Brentano, Husserl, Heidegger, Stein, Merleau-Ponty, Levinas, and Irigaray.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 181",
  "title": "Existentialism",
  "unit": "4",
  "description": "Classical texts and issues of existentialism. Authors studied will vary and may include Nietzsche, Kierkegaard, Heidegger, Sartre, de Beauvoir, and Fanon.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 183",
  "title": "Topics in Continental Philosophy",
  "unit": "4",
  "description": "The focus will be on a leading movement in continental philosophy (e.g., the critical theory of the Frankfurt school, structuralism and deconstruction, postmodernism) or some particular issue that has figured in these traditions (e.g., freedom, subjectivity, historicity, authenticity). May be repeated for credit with change in content and approval of instructor.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 185",
  "title": "Philosophy of Religion",
  "unit": "4",
  "description": "A general introduction to the philosophy of religion through the study of classical and/or contemporary texts. Among the issues to be discussed are the existence and nature of God, the problem of evil, the existence of miracles, the relation between reason and revelation, and the nature of religious language.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "PHIL 191A",
  "title": "Philosophy Honors",
  "unit": "4",
  "description": "Independent study by special arrangement with and under the supervision of a faculty member, including a proposal for the honors essay. An IP grade will be awarded at the end of this quarter; a final grade will be given for both quarters at the end of 191B.",
  "prerequisite": "department stamp; consent of instructor."
 },
 {
  "code": "PHIL 191B",
  "title": "The Honors Essay",
  "unit": "4",
  "description": "Continuation of 191A: independent study by special arrangement with and under the supervision of a faculty member, leading to the completion of the honors essay. A letter grade for both 191A and 191B will be given at the end of this quarter.",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "PHIL 195",
  "title": "Introduction to Teaching Philosophy",
  "unit": "4",
  "description": "Under the supervision of the instructor, student will lead one discussion section of a lower-division philosophy class. The student must attend the lecture for the class and meet regularly with the instructor. Applications are available in the Department of Philosophy.",
  "prerequisite": "consent of instructor and department chair, GPA of 3.0 or higher, over ninety units."
 },
 {
  "code": "PHIL 199",
  "title": "Directed Individual Study",
  "unit": "4",
  "description": "Directed individual study by special arrangement with and under the supervision of a faculty member. (P/NP grades only.)",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "PHIL 200",
  "title": "Proseminar",
  "unit": "4",
  "description": "Introduction to philosophical methods of analysis through study of classic historical or contemporary texts. Writing intensive. Enrollment limited to philosophy entering graduate students.",
  "prerequisite": null
 },
 {
  "code": "PHIL 201A",
  "title": "Core Course in History",
  "unit": "4",
  "description": "A study of selected texts or topics in the history of philosophy. Usually the focus will be on a single major text. May be taken for credit nine times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 202",
  "title": "Core Course in Ethics",
  "unit": "4",
  "description": "An introduction to some central issues in ethical theory with emphasis on classic texts or contemporary authors. May be taken for credit three times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 204A",
  "title": "Core Course in Philosophy of Science",
  "unit": "4",
  "description": "An introduction to one or more central problems in the philosophy of science, or in the philosophy of one of the particular sciences, such as the nature of confirmation and explanation, the nature of scientific knowledge, reductionism, the unity of science, or realism and antirealism. May be taken for credit three times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 205A",
  "title": "Core Course in Metaphysics",
  "unit": "4",
  "description": "An introduction to central topics in metaphysics with emphasis on classic texts or contemporary authors. May be taken for credit three times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 206A",
  "title": "Core Course in Epistemology",
  "unit": "4",
  "description": "An introduction to central topics in epistemology with emphasis on classic texts or contemporary authors. May be taken for credit three times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 207",
  "title": "Core Course in Philosophy of Mind",
  "unit": "4",
  "description": "An introduction to central topics in philosophy of mind with emphasis on classic texts or contemporary authors. May be taken for credit three times with changed content.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PHIL 208",
  "title": "Core Course in Philosophy of Language",
  "unit": "4",
  "description": "An introduction to central topics in philosophy of language with emphasis on classic texts or contemporary authors. May be taken for credit three times with changed content.",
  "prerequisite": "graduate status or consent of instructor."
 },
 {
  "code": "PHIL 209A",
  "title": "Introduction to Science Studies: Part I",
  "unit": "4",
  "description": "Study and discussion of classic themes and texts in history of science, sociology of science, and philosophy of science, and of work that attempts to develop an interdisciplinary science studies approach. Required of all students in the Science Studies Program. Students may receive credit for one of the following: ANTH 268, COGR 225A, HIGR 238, PHIL 209A, or SOCG 255A.",
  "prerequisite": null
 },
 {
  "code": "PHIL 209B",
  "title": "Seminar in Science Studies",
  "unit": "4",
  "description": "Study and discussion of a selected topic in the science studies field with an emphasis on the development of research and writing skills. Required of all students in the Science Studies Program. The topic varies from year to year. ANTH 272, COGR 225B, HIGR 239, PHIL 209B, SOCG 255B may be repeated and taken for credit in any combination for a combined total of six times.",
  "prerequisite": null
 },
 {
  "code": "PHIL 209C",
  "title": "Colloquium in Science Studies",
  "unit": "4",
  "description": "A forum for the presentation and discussion of research in progress in science studies by graduate students, faculty, and visitors. Students must attend the colloquium series for their entire first and second years. May be taken for credit two times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 209D",
  "title": "Introduction to Science Studies Part II",
  "unit": "4",
  "description": "Continuing the introduction developed in Part I, this course examines recent key topics and problem situations in science studies. Emphasis is on recent theoretical perspectives and empirical studies in communication, history, philosophy, and sociology of science and technology, and the interplay between them. Students may receive credit for one of the following: ANTH 269, COGR 225D, HIGR 241, PHIL 209D, or SOCG 255D.",
  "prerequisite": null
 },
 {
  "code": "PHIL 210",
  "title": "Greek Philosophy",
  "unit": "4",
  "description": "A study of selected texts or topics from the history of Greek philosophy. Usually centers on works by Plato or Aristotle. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 214",
  "title": "Early Modern Philosophy",
  "unit": "4",
  "description": "A study of selected texts or topics from philosophers of the sixteenth and seventeenth centuries: Descartes, Spinoza, Leibniz, or Locke. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 215",
  "title": "Eighteenth-Century Philosophy",
  "unit": "4",
  "description": "A study of selected texts or topics from philosophers of the eighteenth century: for example, Kant or Hume. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 218",
  "title": "Contemporary Analytical Philosophy",
  "unit": "4",
  "description": "A study of the historical development of the analytical movement, with emphasis on major texts. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 230",
  "title": "Metaphysics",
  "unit": "4",
  "description": "Topics may include identity, personal identity, universals and particulars, modality and possible worlds, causation, reduction, supervenience, freedom and determinism, space and time, and realism versus antirealism. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 232",
  "title": "Epistemology",
  "unit": "4",
  "description": "This seminar will cover issues such as rival accounts of knowledge, justification, and warrant, traditional and contemporary perspectives on empiricism, rationalism, and pragmatism, and skepticism. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 234",
  "title": "Philosophy of Language",
  "unit": "4",
  "description": "Central issues in contemporary philosophy of language, such as the nature of linguistic meaning, truth, content, reference, the syntax and semantics of various linguistic constructions, presupposition, speech acts, the epistemology of language understanding and language learning, the mental/psychological basis of linguistic understanding and use. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 236",
  "title": "Philosophy of Mind",
  "unit": "4",
  "description": "Contemporary debates on the nature, function, and operation of the mental. May include questions about the mind-body relation, mental causation, perception, consciousness, and mental representation. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 245",
  "title": "Philosophy of Science",
  "unit": "4",
  "description": "This seminar will cover current books and theoretical issues in the philosophy of science. May be taken for credit seven times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 250A",
  "title": "Philosophy of the Cognitive Sciences",
  "unit": "4",
  "description": "Contemporary debates about the study of the mind-brain as studied in one or more of the empirical cognitive sciences. May include questions about the different strategies of explanation invoked, the conceptions of representation employed, the connections between theoretical models developed. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 260",
  "title": "Ethics",
  "unit": "4",
  "description": "Topics may include metaethics (e.g., the semantics, metaphysics, epistemology, and normativity of ethics), consequentialism and deontology, moral psychology (e.g., freedom, responsibility, and weaknesses of will), or substantive moral problems. The approach may be systematic, historical, or both. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 267",
  "title": "Political Philosophy",
  "unit": "4",
  "description": "Topics may include the nature and limits of state authority, liberty and equality, distributive justice, liberalism and its critics (e.g., feminists, libertarians, and others), or issues in jurisprudence. The focus may be on classic texts or contemporary authors. May be taken for credit six times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 271",
  "title": "Agency and Responsibility Reading Group",
  "unit": "1-2",
  "description": "This course is designed for students to gain feedback from students and faculty on works in progress on the topics of agency and responsibility. The course is suitable for those specializing in moral psychology, ethics, agency and responsibility, and for those with special interests in the topics. May be taken for credit up to nine times for a maximum of nine units.",
  "prerequisite": null
 },
 {
  "code": "PHIL 275",
  "title": "German Philosophy Reading Group",
  "unit": "1-2",
  "description": "This course meets regularly to discuss primary or secondary literature in the area of German philosophy (including Kant, Fichte, Hegel, etc.). The reading is designed both for students doing active research in the field and for those seeking to gain some familiarity with it. Nongraduate students may enroll with consent of instructor. S/U grades only. May be taken for credit nine times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 276",
  "title": "German Translation Workshop",
  "unit": "1-2",
  "description": "This course meets weekly to provide training in reading and translating philosophical German. Students prepare in advance written translations of assigned passages. The course helps train graduate students preparing to take the Departmental German Exam. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 277",
  "title": "Phenomenology Reading Group",
  "unit": "1-2",
  "description": "This course meets biweekly with students reading and presenting material from the phenomenological literature. The course is designed both for students doing active research in phenomenology and for those seeking to gain some familiarity with that tradition. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 278",
  "title": "Topics and Methods in Contemporary Philosophy",
  "unit": "1-2",
  "description": "Investigation of central issues in contemporary philosophy. Content varies but typically will center on a recent and important philosophical book. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 280",
  "title": "Philosophy of Science Topics and Methods",
  "unit": "1-2",
  "description": "This course meets weekly to discuss recent books or articles in philosophy of science. The reading is designed both for students doing active research in the field and for those seeking to gain some familiarity with it. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 281",
  "title": "History of Philosophy Research and Methods",
  "unit": "1-2",
  "description": "This course meets to discuss work in progress in the history of philosophy. Its aim is to introduce understanding of the methods and standards of research in the field through constructive criticism of each other's work. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 282",
  "title": "Topics and Methods in Ethics",
  "unit": "1-2",
  "description": "Weekly or biweekly meetings to discuss recent literature in ethics, broadly construed so as to include ethical theory, normative ethics, jurisprudence, and historical traditions in these fields. The course is suitable for those specializing in ethics and for those seeking some familiarity with the field. Can be taken nine times for credit with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 284",
  "title": "Philosophy of Biology Research Group",
  "unit": "1-2",
  "description": "A research group for graduate students engaged in philosophy or history of the biological sciences. The group discusses biological, historical, and philosophical articles and books and ongoing research projects. Can be taken nine times for credit with change of content.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PHIL 285",
  "title": "Seminar on Special Topics",
  "unit": "4",
  "description": "Focused examination of specific problems or themes in some area of philosophy. May be taken for credit nine times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 286",
  "title": "Philosophy of Physics Reading Group",
  "unit": "1-2",
  "description": "A research group for graduate students engaged in philosophy or history of the physical sciences. The group discusses physical, historical, and philosophical articles and books and ongoing research projects. Can be taken nine times for credit with change of content.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PHIL 287",
  "title": "Greek Reading Group",
  "unit": "1-2",
  "description": "This group provides training in reading and translating philosophical Greek by having students prepare translations of passages and lead discussions. The group helps train graduate students preparing for Departmental Greek Exam. Can be taken nine times for credit with change of content.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PHIL 288",
  "title": "Latin Reading Group",
  "unit": "1-2",
  "description": "This group provides training in reading and translating philosophical Latin by having students prepare translations of passages and lead discussions. The group helps train graduate students preparing for departmental Latin exam.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PHIL 290",
  "title": "Directed Independent Study",
  "unit": "4",
  "description": "Supervised study of individually selected philosophical topics. S/U grades permitted.",
  "prerequisite": null
 },
 {
  "code": "PHIL 292",
  "title": "Writing Workshop",
  "unit": "1-3",
  "description": "Each enrolled student produces a research essay ready for publication, presents it to students and faculty, and offers critiques of other students' presentations. Units will vary according to enrollment in course. To be taken in fall quarter of third year of philosophy graduate study.",
  "prerequisite": null
 },
 {
  "code": "PHIL 295",
  "title": "Research Topics",
  "unit": "1-12",
  "description": "Advanced individual research studies under the direction of a member of the staff. Hours of outside preparation will vary with number of units taken. May be taken for credit nine times with changed content.",
  "prerequisite": null
 },
 {
  "code": "PHIL 299",
  "title": "Thesis Research",
  "unit": "1-12",
  "description": "S/U grades permitted.",
  "prerequisite": null
 },
 {
  "code": "PHIL 500",
  "title": "Apprentice Teaching",
  "unit": "1-4",
  "description": "A course designed to satisfy the requirement that graduate students should serve as teaching assistants, either in the Department of Philosophy or in one of the writing programs offered by the various colleges. Each PhD candidate must teach the equivalent of quarter time for three academic quarters. Students are permitted to sign up as TAs for a maximum of eighteen quarters.",
  "prerequisite": null
 }
]