[
 {
  "code": "POLI 5 or 5D",
  "title": "Data Analytics for the Social Sciences",
  "unit": "4",
  "discription": "Introduction to probability and analysis for understanding data in the social world. Students engage in hands-on learning with applied social science problems. Basics of probability, visual display of data, data collection and management, hypothesis testing, and computation. Students may receive credit for only one of the following courses: ECON 5, POLI 5, or POLI 5D.",
  "prerequsite": null
 },
 {
  "code": "POLI 10 or 10D",
  "title": "Introduction to Political Science: American Politics",
  "unit": "4",
  "discription": "This course surveys the processes and institutions of American politics. Among the topics discussed are individual political attitudes and values, political participation, voting, parties, interest groups, Congress, presidency, Supreme Court, the federal bureaucracy, and domestic and foreign policy making. POLI 10 is Lecture only, and POLI 10D is Lecture plus Discussion section. These courses are equivalents of each other in regards to major requirements, and students may not receive credit for both 10 and 10D.",
  "prerequsite": null
 },
 {
  "code": "POLI 11 or 11D",
  "title": "Introduction to Political Science: Comparative Politics",
  "unit": "4",
  "discription": "The nature of political authority, the experience of a social revolution, and the achievement of an economic transformation will be explored in the context of politics and government in a number of different countries. POLI 11 is Lecture only, and POLI 11D is Lecture plus Discussion section. These courses are equivalents of each other in regards to major requirements, and students may not receive credit for both 11 and 11D.",
  "prerequsite": null
 },
 {
  "code": "POLI 12 or 12D",
  "title": "Introduction to Political Science: International Relations",
  "unit": "4",
  "discription": "The issues of war/peace, nationalism/internationalism, and economic growth/redistribution will be examined in both historical and theoretical perspectives. POLI 12 is Lecture only, and POLI 12D is Lecture plus Discussion section. These courses are equivalents of each other in regards to major requirements, and students may not receive credit for both 12 and 12D.",
  "prerequsite": null
 },
 {
  "code": "POLI 13 or 13D",
  "title": "Power and Justice",
  "unit": "4",
  "discription": "An exploration of the relationship between power and justice in modern society. Materials include classic and contemporary texts, films, and literature. POLI 13 is Lecture only, and POLI 13D is Lecture plus Discussion section. These courses are equivalents of each other in regards to major requirements, and students may not receive credit for both 13 and 13D.",
  "prerequsite": null
 },
 {
  "code": "POLI 27",
  "title": "Ethics and Society",
  "unit": "4",
  "discription": "An examination of ethical principles (e.g., utilitarianism, individual rights, etc.) and their social and political applications to contemporary issues such as abortion, environmental protection, and affirmative action. Ethical principles will also be applied to moral dilemmas familiar in government, law, business, and the professions. Satisfies the Warren College ethics and society requirement.",
  "prerequsite": "CAT 2 and 3, DOC 2 and 3, MCWP 40 and 50, HUM 1 and 2, MMW 2 and 3, WCWP 10A–B, or WARR 11A–B."
 },
 {
  "code": "POLI 28",
  "title": "Ethics and Society II",
  "unit": "4",
  "discription": "An examination of a single set of major contemporary social, political, or economic issues (e.g., environmental ethics, international ethics) in light of ethical and moral principles and values. Warren College students must take course for a letter grade in order to satisfy the Warren College general- education requirement.",
  "prerequsite": "PHIL/POLI 27."
 },
 {
  "code": "POLI 30 or 30D",
  "title": "Political Inquiry",
  "unit": "4",
  "discription": "Introduction to the logic of inference in social science and to quantitative analysis in political science and public policy including research design, data collection, data description and computer graphics, and the logic of statistical inference (including linear regression). POLI 30 is Lecture only, and POLI 30D is Lecture plus Discussion section. These courses are equivalents of each other in regards to major requirements, and students may not receive credit for both 30 and 30D.",
  "prerequsite": null
 },
 {
  "code": "POLI 40",
  "title": "Introduction to Law and Society",
  "unit": "4",
  "discription": "This course is designed as a broad introduction to the study of law as a social institution and its relations to other institutions in society. The focus will be less on the substance of law (legal doctrine and judicial opinions) than on the process of law–how legal rules both reflect and shape basic social values and their relation to social, political, and economic conflicts within society.",
  "prerequsite": null
 },
 {
  "code": "POLI 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "discription": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. May not be used to fulfill any major or minor requirements in political science.",
  "prerequsite": null
 },
 {
  "code": "POLI 90",
  "title": "Undergraduate Seminar",
  "unit": "4",
  "discription": "Selected topics to introduce students to current issues and trends in political science. May not be used to fulfill any major or minor requirements in political science. P/NP grades only. May be taken for credit four times.",
  "prerequsite": null
 },
 {
  "code": "POLI 99H",
  "title": "Independent Study",
  "unit": "1",
  "discription": "Independent study or research under direction of a member of the faculty.",
  "prerequsite": "student must be of first-year class standing, and a Regents Scholar; approved Special Studies form."
 },
 {
  "code": "POLI 100A",
  "title": "The Presidency",
  "unit": "4",
  "discription": "The role of the presidency in American politics. Topics will include nomination and election politics, relations with Congress, party leadership, presidential control of the bureaucracy, international political role, and presidential psychology.",
  "prerequsite": null
 },
 {
  "code": "POLI 100B",
  "title": "The US Congress",
  "unit": "4",
  "discription": "This course will examine the nomination and election of congressmen, constituent relationships, the development of the institution, formal and informal structures, leadership, comparisons of House with Senate, lobbying, and relationship with the executive branch.",
  "prerequsite": null
 },
 {
  "code": "POLI 100C",
  "title": "American Political Parties",
  "unit": "4",
  "discription": "This course examines the development of the two major parties from 1789 to the present. Considers the nature of party coalitions, the role of leaders, activists, organizers, and voters, and the performance of parties in government.",
  "prerequsite": null
 },
 {
  "code": "POLI 100DA",
  "title": "Voting, Campaigning, and Elections",
  "unit": "4",
  "discription": "A consideration of the nature of public opinion and voting in American government. Studies of voting behavior are examined from the viewpoints of both citizens and candidates, and attention is devoted to recent efforts to develop models of electoral behavior for the study of campaigns. The role of mass media and money also will be examined.",
  "prerequsite": null
 },
 {
  "code": "POLI 100E",
  "title": "Interest Group Politics",
  "unit": "4",
  "discription": "The theory and practice of interest group politics in the United States. Theories of pluralism and collective action, the behavior and influence of lobbies, the role of political action committees, and other important aspects of group action in politics are examined.",
  "prerequsite": "sophomore standing."
 },
 {
  "code": "POLI 100F",
  "title": "Social Networks",
  "unit": "4",
  "discription": "This class explores the many ways in which face-to-face social networks have a powerful effect on a wide range of human behaviors. With a foundation in understanding real-world networks, we can then consider how these networks function online.",
  "prerequsite": null
 },
 {
  "code": "POLI 100G",
  "title": "How to Win or Lose an Election",
  "unit": "4",
  "discription": "This course explores the various aspects of a political campaign including campaign organization, vote targeting, political parties, social media, fundraising, polling, media interactions, and more. These areas are examined citing specific examples from federal, state, and local campaigns.",
  "prerequsite": null
 },
 {
  "code": "POLI 100H",
  "title": "Race and Ethnicity in American Politics",
  "unit": "4",
  "discription": "This course examines the processes by which racial and ethnic groups have/have not been incorporated into the American political system. The course focuses on the political experiences of European immigrant groups, blacks, Latinos, and Asians.",
  "prerequsite": null
 },
 {
  "code": "POLI 100I",
  "title": "Participation and Inequality",
  "unit": "4",
  "discription": "This course examines the causes and consequences of the unequal participation and representation of groups in US politics.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 100J",
  "title": "Race in American Political Development",
  "unit": "4",
  "discription": "Readings examine how the multiracial character of the United States has shaped the broad outlines of American politics. Cases include the founding/the Constitution, southern politics, social organization in formerly Mexican regions, the New Deal, consequences of limited suffrage.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100K",
  "title": "Railroads and American Politics",
  "unit": "4",
  "discription": "The railroads transformed the economy and politics of the United States in the nineteenth century. The railroads were the first big businesses, and their sheer size led inevitably to conflict with governments at all levels. This conflict shaped modern politics.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100M",
  "title": "Political Psychology",
  "unit": "4",
  "discription": "We begin with hypotheses about how people develop political attitudes, and methods to test those hypotheses. The second half focuses on emerging cognitive neuroscience insights, including brain imaging, and asks how these inform theories of political cognition, affect, and behavior.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100N",
  "title": "Politics in Washington",
  "unit": "4",
  "discription": "Examines Washington as a political community, its institutions, culture, and history. In addition to its elected officeholders and senior government officials, it examines Washington's subcommunities: the national news industry, diplomatic service, the representation of interests.",
  "prerequsite": "department approval is required."
 },
 {
  "code": "POLI 100O",
  "title": "Perspectives on Race",
  "unit": "4",
  "discription": "This course looks at race in American politics from a variety of perspectives. We may consider psychological, genetic, neuroscience, economic, political, sociological, and legal views of what drives powerful dynamics of race in our country.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100P",
  "title": "Economic Entrepreneurs and American Politics",
  "unit": "4",
  "discription": "This course is concerned with the interaction between representative democracy and capitalism in American political history. The key to understanding this interaction is the role of the entrepreneur in the economy and how unexpected economic change shapes politics.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100Q",
  "title": "Advanced Topics in Racial Politics",
  "unit": "4",
  "discription": "This course explores how race shapes outcomes in American democracy through in-depth exploration of key issues in American politics. Topics include race in the voting booth, immigration, discrimination, and inter-minority conflict.",
  "prerequsite": null
 },
 {
  "code": "POLI 100T",
  "title": "Business and Politics",
  "unit": "4",
  "discription": "This course uses the tools of political science and economics to study how corporations affect and are affected by politics. We will cover a broad range of issues, including regulation, lawmaking, mass media, interest group mobilization, and corporate social responsibility.",
  "prerequsite": null
 },
 {
  "code": "POLI 100U",
  "title": "Games, Strategy, and Politics",
  "unit": "4",
  "discription": "This course provides an introduction to game theory with an emphasis on applications in economics, political science, and business. Game theory uses simple mathematical models to understand social phenomena. The required mathematical background is minimal (high school algebra).",
  "prerequsite": null
 },
 {
  "code": "POLI 100V",
  "title": "Organized Interests",
  "unit": "4",
  "discription": "This course provides a theoretical and practical examination of political parties, interest groups, and social movements in the United States.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100W",
  "title": "Politics, Policy, and Educational Inequality",
  "unit": "4",
  "discription": "Education is often thought of as \"the great equalizer\" but in the U.S. and around the world, many governments fail to ensure that all citizens have access to high-quality educational opportunities. Why? This course will give students the conceptual tools to understand who shapes education policy decisions, through what channels, and how those policy decisions affect the quality and equity of education. Emphasis is on the U.S., but analyzed in comparative perspective.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 100Y",
  "title": "Asian American Politics in the United States",
  "unit": "4",
  "discription": "This class is a survey of historical and contemporary issues in Asian American politics in the U.S.; race and ethnicity in the context of US politics; comparisons of racial and ethnic group experiences in the U.S. with those experienced by racial and ethnic groups elsewhere; Asian American access to the political system through political participation.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 101E",
  "title": "The Politics of Race, Ethnicity, and Immigration",
  "unit": "4",
  "discription": "This course examines the interplay between racial/ethnic identity and politics. How do race and ethnicity become politicized? What role does ethnic or racial identity play in political behavior and decision-making processes? To what extent do political institutions and institutional design reinforce the salience of ethnic or racial identity in politics? We will be taking a comparative approach to this topic, and cover readings in both American politics and comparative politics literature.",
  "prerequsite": null
 },
 {
  "code": "POLI 102C",
  "title": "American Political Development",
  "unit": "4",
  "discription": "Examines selected issues and moments in the political history of the United States, comparing competing explanations and analyses of US politics. Likely topics include the founding, “American exceptionalism,” change in the party system, race in US politics, the “new institutionalism.”",
  "prerequsite": null
 },
 {
  "code": "POLI 102D",
  "title": "Voting Rights Act: Fifty Years Later",
  "unit": "4",
  "discription": "The Voting Rights Act (VRA) is one of the most significant and controversial acts in American history. We will examine the environment that led to its introduction, the legislative process, executive implementation, and the political ramifications and subsequent state government and court decisions.",
  "prerequsite": null
 },
 {
  "code": "POLI 102E",
  "title": "Urban Politics",
  "unit": "4",
  "discription": "(Same as USP107) This survey course focuses upon the following six topics: the evolution of urban politics since the mid-nineteenth century; the urban fiscal crisis; federal/urban relationships; the “new” ethnic politics; urban power structure and leadership; and selected contemporary policy issues such as downtown redevelopment, poverty, and race.",
  "prerequsite": null
 },
 {
  "code": "POLI 102F",
  "title": "Mass Media and Politics",
  "unit": "4",
  "discription": "This course will explore both the role played by mass media in political institutions, processes and behaviors, and reciprocally, the roles played by political systems in guiding communication processes.",
  "prerequsite": null
 },
 {
  "code": "POLI 102G",
  "title": "Special Topics in American Politics",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of American politics. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequsite": null
 },
 {
  "code": "POLI 102J",
  "title": "Advanced Topics in Urban Politics",
  "unit": "4",
  "discription": "(Same as USP 110) Building upon the introductory urban politics course, the advanced topics course explores issues such as community power, minority empowerment, and the politics of growth. A research paper is required. Students may not receive credit for both POLI 102J and USP 110.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 102K",
  "title": "The Urban Underclass",
  "unit": "4",
  "discription": "The lives of individuals living in ghetto poverty in the United States. Causes and consequences of ghetto poverty. Political debates surrounding the underclass and different possible solutions.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 102L",
  "title": "The Politics of Regulation",
  "unit": "4",
  "discription": "Politics and policy-making issues in regulation. Themes: regulation versus legislation; general versus specific grants of regulatory power; market versus command mechanisms; private property; and risk assessment. Emphasis on American regulatory policy, examples from current regulatory debates (e.g., health care and environment).",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 103A",
  "title": "California Government and Politics",
  "unit": "4",
  "discription": "(Same as USP 109) This survey course explores six topics: 1) the state's political history; 2) campaigning, the mass media, and elections; 3) actors and institutions in the making of state policy; 4) local government; 5) contemporary policy issues; e.g., Proposition 13, school desegregation, crime, housing and land use, transportation, water; 6) California's role in national politics.",
  "prerequsite": null
 },
 {
  "code": "POLI 103B",
  "title": "Politics and Policymaking in Los Angeles",
  "unit": "4",
  "discription": "(Same as USP 113) This course examines politics and policymaking in the five- county Los Angeles region. It explores the historical development of the city, suburbs, and region; politics, power, and governance; and major policy challenges facing the city and metropolitan area.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 103C",
  "title": "Politics and Policymaking in San Diego",
  "unit": "4",
  "discription": "(Same as USP 115) This course examines how major policy decisions are made in San Diego. It analyzes the region's power structure (including the roles of nongovernmental organizations and the media), governance systems and reform efforts, and the politics of major infrastructure projects.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "POLI 103D",
  "title": "California Local Government: Finance and Administration",
  "unit": "4",
  "discription": "(Same as USP 116) This course surveys public finance and administration. It focuses upon California local governments—cities, counties, and special districts—and also examines state and federal relationships. Topics explored include revenue, expenditure, indebtedness, policy responsibilities, and administrative organization and processes.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 104A",
  "title": "The Supreme Court and the Constitution",
  "unit": "4",
  "discription": "An introduction to the study of the Supreme Court and constitutional doctrine. Topics will include the nature of judicial review, federalism, race, and equal protection. The relation of judicial and legislative power will also be examined.",
  "prerequsite": null
 },
 {
  "code": "POLI 104B",
  "title": "Civil Liberties—Fundamental Rights",
  "unit": "4",
  "discription": "This course will examine issues of civil liberties from both legal and political perspectives. Topics will include the First Amendment rights of speech, press, assembly, and religion; other “fundamental” rights, such as the right to privacy; and some issues in equal protection. Conflicts between governmental powers and individual rights will be examined.",
  "prerequsite": null
 },
 {
  "code": "POLI 104C",
  "title": "Civil Liberties—The Rights of the Accused and Minorities",
  "unit": "4",
  "discription": "Examines the legal issues surrounding the rights of criminal suspects, as well as the rights of \"marginal\" groups such as aliens, illegal immigrants, and the mentally ill. Also includes a discussion of the nature of discrimination in American society.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 104D",
  "title": "Judicial Politics",
  "unit": "4",
  "discription": "Introduction to the study of law and courts as political institutions and judges as political actors, including the role of the judiciary in our constitutional system and decision making both within the Supreme Court and within the judicial hierarchy.",
  "prerequsite": null
 },
 {
  "code": "POLI 104E",
  "title": "Environmental Law and Policy",
  "unit": "4",
  "discription": "The course is an introduction to US environmental law at the federal level. It emphasizes issues and current controversies involving natural resources, such as wilderness, biodiversity, water, and climate change.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 104F",
  "title": "Constitutional Law",
  "unit": "4",
  "discription": "This course provides an intensive examination of a major issue in constitutional law. Students will be required to do legal research on a topic, write a legal brief, and argue a case to the class.",
  "prerequsite": "POLI 104A-B."
 },
 {
  "code": "POLI 104G",
  "title": "Election Law",
  "unit": "4",
  "discription": "A detailed analysis of the legislative and judicial history of election related topics including registration laws, election administration, candidate requirements, voting rights, party organizational rules, nomination procedures, redistricting, and campaign finance.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 104I",
  "title": "Law and Politics—Courts and Political Controversy",
  "unit": "4",
  "discription": "This course will examine the role of the courts in dealing with issues of great political controversy, with attention to the rights of speech and assembly during wartime, questions of internal security, and the expression of controversial views on race and religion. The conflict between opposing Supreme Court doctrines on these issues will be explored in the context of the case studies drawn from different historical periods.",
  "prerequsite": null
 },
 {
  "code": "POLI 104J",
  "title": "Introduction to Legal Reasoning",
  "unit": "4",
  "discription": "The ability to write and argue is one of the noted benefits of a legal education. Students will learn the basics of legal research and reasoning by learning to read and brief case law and write persuasive and objective memorandums.",
  "prerequsite": "POLI 104A or 104B, upper-division standing."
 },
 {
  "code": "POLI 104K",
  "title": "Legal Argument Formulation",
  "unit": "4",
  "discription": "This course examines the role that legal arguments have in the US court system. Students will utilize legal reasoning and research skills to craft arguments in both written and oral formats, and then participate in a moot court final.",
  "prerequsite": "POLI 104J."
 },
 {
  "code": "POLI 104L",
  "title": "Positive Political Theory of Law",
  "unit": "4",
  "discription": "We will discuss modern theories of the origins of law and legal behavior.",
  "prerequsite": null
 },
 {
  "code": "POLI 104M",
  "title": "Law and Sex",
  "unit": "4",
  "discription": "How law regulates and impacts sexuality and orientation with focus on constitutional law in areas of privacy, free speech, association, regulation of sexual conduct under criminal law pornography, procreation, reproductive rights, and regulation of family status.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 104N",
  "title": "Race and Law",
  "unit": "4",
  "discription": "Has the law helped end or contributed to racism in the United States? This course will explore the law of Slavery, Segregation, and Immigration, and study Equal Protection, Affirmative Action, and Criminal Justice (including hate crimes and First Amendment implications).",
  "prerequsite": null
 },
 {
  "code": "POLI 104P",
  "title": "Science, Technology, and the Law",
  "unit": "4",
  "discription": "Science advances exponentially. The law is slower to follow. This course examines legal issues created by today's scientific breakthroughs and explores what future legal challenges might await tomorrow's scientific discoveries, from privacy on the internet to the meaning of life.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 105A",
  "title": "Latino Politics in the U.S.",
  "unit": "4",
  "discription": "This course examines contemporary issues in Latino politics in the U.S.; comparisons of racial and ethnic group experiences in the U.S.; Latino access to the political system through political participation.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 108",
  "title": "Politics of Multiculturalism",
  "unit": "4",
  "discription": "This course will examine central issues in debates about race, ethnicity, and multiculturalism in the United States. It will look at relations not only between whites and minorities, but also at those among racial and ethnic communities.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 110A",
  "title": "Citizens and Saints: Political Thought from Plato to Augustine",
  "unit": "4",
  "discription": "This course focuses on the development of politics and political thought in ancient Greece, its evolution through Rome and the rise of Christianity. Readings from Plato, Aristotle, Augustine, Machiavelli, and others.",
  "prerequsite": null
 },
 {
  "code": "POLI 110EA",
  "title": "American Political Thought from Revolution to Civil War",
  "unit": "4",
  "discription": "The first quarter examines the origins and development of American political thought from the revolutionary period to the end of the nineteenth century with special emphasis on the formative role of eighteenth-century liberalism and the tensions between “progressive” and “conservative” wings of the liberal consensus.",
  "prerequsite": null
 },
 {
  "code": "POLI 110EB",
  "title": "American Political Thought from Civil War to Civil Rights",
  "unit": "4",
  "discription": "The second quarter examines some of the major themes of American political thought in the twentieth century including controversies over the meaning of democracy, equality, and distributive justice, the nature of “neoconservatism,” and America's role as a world power.",
  "prerequsite": null
 },
 {
  "code": "POLI 110EC",
  "title": "American Political Thought: Contemporary Debates",
  "unit": "4",
  "discription": "This course explores contemporary issues in American political thought. Topics may include liberalism and rights, gender and sexuality, race and ethnicity, cultural diversity, and the boundaries of modern citizenship. Readings include political pamphlets, philosophical treatises, court decisions, and works of literature.",
  "prerequsite": null
 },
 {
  "code": "POLI 110ED",
  "title": "Seminar in American Political Thought",
  "unit": "4",
  "discription": "This seminar explores debates over ideals, institutions, and identities in American political thought. Themes and topics will vary. Readings will include political pamphlets, philosophical treatises, court decisions, and works of literature.",
  "prerequsite": "upper-division standing; department stamp."
 },
 {
  "code": "POLI 110G",
  "title": "International Political Thought",
  "unit": "4",
  "discription": "This course explores theories of politics that are oriented beyond state borders. Key topics include international order, cosmopolitanism, human rights, just war, global justice, mitigation, citizenship, identity, and commercial society. The course examines thinkers from classical antiquity to contemporary times.",
  "prerequsite": null
 },
 {
  "code": "POLI 110H",
  "title": "Democracy and Its Critics",
  "unit": "4",
  "discription": "This course will examine the historical development of the ideal of democracy from Periclean Athens to the present in the light of criticism by such thinkers as Plato, Tocqueville, and Mosca and difficulties encountered in efforts to realize the ideal.",
  "prerequsite": null
 },
 {
  "code": "POLI 110J",
  "title": "Power in American Society",
  "unit": "4",
  "discription": "This course examines how power has been conceived and contested during the course of American history. The course explores the changes that have occurred in political rhetoric and strategies as America has moved from a relatively isolated agrarian and commercial republic to a military and industrial empire.",
  "prerequsite": null
 },
 {
  "code": "POLI 110K",
  "title": "Liberty and Equality",
  "unit": "4",
  "discription": "Leading political theories of liberal democracy since 1950. What is the meaning of political liberty? Political equality is the equality of what? Course will consider thinkers such as J.S. Mill, Berlin, Rawls, Dworkin, Taylor, Sen, Nussbaum, G. Cohen, Petit.",
  "prerequsite": null
 },
 {
  "code": "POLI 110M",
  "title": "Green Political Thought",
  "unit": "4",
  "discription": "Leading theories of environmental justice, ethics, and politics since 1960. Thinkers such as Dauvergne, Dobson, Dryzek, Eckersley, Latour, Plumwood, and Simon on ecosystems, climate change, sustainability, preservation, human welfare, nonhuman animals, place, feminism, state, market, and green political movements.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 110N",
  "title": "Theories of Nationalism",
  "unit": "4",
  "discription": "Nationalist ideologies. Examination of the rhetoric of nationalist mobilization. Theories about the relationship between nationalist movements and democracy, capitalism, warfare, and the state.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 110T",
  "title": "Modern Political Ideologies",
  "unit": "4",
  "discription": "An examination of some of the ideas and values associated with major social and political movements in Europe and the United States since the French Revolution. Topics will vary and may include liberalism, populism, democracy, communism, nationalism, fascism, and feminism.",
  "prerequsite": null
 },
 {
  "code": "POLI 111B",
  "title": "Global Justice in Theory and Action",
  "unit": "4",
  "discription": "Discuss the idea of justice from multiple perspectives: theory, philosophy, institutions, markets, social mobilization, politics, and environment. Examine the assets and capabilities of diverse justice-seeking organizations and movements aimed at improving quality of life and place locally, regionally, and globally.",
  "prerequsite": null
 },
 {
  "code": "POLI 111D",
  "title": "Changing Harmful Social Norms",
  "unit": "4",
  "discription": "Study of types of social norms and practices, and how to change them. Illustrated with development examples such as the end of footbinding, female genital cutting, urban violence in Colombia, Serbian student revolution, early marriage, and other adverse gender norms.",
  "prerequsite": null
 },
 {
  "code": "POLI 112A",
  "title": "Economic Theories of Political Behavior",
  "unit": "4",
  "discription": "An introduction to theories of political behavior developed with the assumptions and methods of economics. General emphasis will be upon theories linking individual behavior to institutional patterns. Specific topics to be covered will include collective action, leadership, voting, and bargaining.",
  "prerequsite": null
 },
 {
  "code": "POLI 112C",
  "title": "Political Theory and Artistic Vision",
  "unit": "4",
  "discription": "The course explores the modes of political thinking found in arts, especially in drama and literature. It may include ends and means, political leadership, and political economy. Students may not receive credit for both POLI 112CS and POLI 112C.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 113A",
  "title": "East Asian Thought in Comparative Perspective",
  "unit": "4",
  "discription": "This course examines the major traditions of East Asian thought in comparative perspective. Topics include Confucianism, Taoism, Buddhism, and contemporary nationalist and East Asian political thought. Throughout, focused comparisons and contrasts will be made between western and eastern thought.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 113B",
  "title": "Chinese and Japanese Political Thought I",
  "unit": "4",
  "discription": "Examines philosophical traditions of ancient and modern China and Japan, to understand how these have been reflected in Chinese and Japanese development. Course will be in English; however, students with Chinese or Japanese language skills will have opportunity to use these. Graduate students will be required to complete a seminar-length research paper; undergraduate students will write a paper.",
  "prerequsite": "upper-division standing for 113B."
 },
 {
  "code": "POLI 113C",
  "title": "Chinese and Japanese Political Thought II",
  "unit": "4",
  "discription": "A continuation of 113B, which follows political philosophical themes in China and Japan through the twentieth century. Important topics include Buddhism and Confucianism as they changed in each context in response to internal and external stimuli.",
  "prerequsite": "113B."
 },
 {
  "code": "POLI 114B",
  "title": "Marxist Political Thought",
  "unit": "4",
  "discription": "An introduction to Marxist thought from its roots in the Western tradition through its development in non-Western contexts. Emphasis is placed on how adaptations were made in Marxism to accommodate the specific challenges of each environment.",
  "prerequsite": null
 },
 {
  "code": "POLI 115A",
  "title": "Gender and Politics",
  "unit": "4",
  "discription": "Our understanding of politics, power, conflict, and quality continue to be challenged and transformed by considering gender as it intersects with nationality, race, class, and ethnicity. We will consider the importance of gender in each of the subfields of political science.",
  "prerequsite": null
 },
 {
  "code": "POLI 116A",
  "title": "Feminist Theory",
  "unit": "4",
  "discription": "Readings in historical and contemporary feminist theory; development of gender as a category of political analysis; alternative perspectives on core concepts and categories in feminist thought.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 117",
  "title": "Bending the Curve: Solutions to Climate Change",
  "unit": "4",
  "discription": "(Same as SIO 109.) Climate change is an urgent global problem affecting the lives of hundreds of millions of people, now and for the foreseeable future. This course will empower students to confront climate change as critical actors to innovate creative cross-disciplinary solutions. Students may not receive credit for POLI 117 and SIO 109.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 118",
  "title": "Game Theory in Political Science",
  "unit": "4",
  "discription": "This course introduces students to game theory and its uses in political science. Topics covered include the concepts of Nash equilibrium, dominant strategies, subgame perfection and backwards induction, and the applications of those concepts to the study of voting, electoral competition, public goods provision, legislatures, and collective action. An emphasis is placed on developing students' analytical reasoning and problem-solving skills through weekly problem sets and in-class exercises.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 119A",
  "title": "Special Topics in Political Theory",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of political theory. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequsite": null
 },
 {
  "code": "POLI 120A",
  "title": "Political Development of Western Europe",
  "unit": "4",
  "discription": "An examination of various paths of European political development through consideration of the conflicts that shaped these political systems: the commercialization of agriculture; religion and the role of the church; the army and the state bureaucracy; and industrialization. Stress will be on alternative paradigms and on theorists.",
  "prerequsite": null
 },
 {
  "code": "POLI 120B",
  "title": "The German Political System",
  "unit": "4",
  "discription": "An analysis of the political system of the Federal Republic of Germany with an emphasis on the party system, elections, executive-legislative relations, and federalism. Comparisons will be made with other West European democracies and the Weimar Republic.",
  "prerequsite": null
 },
 {
  "code": "POLI 120C",
  "title": "Politics in France",
  "unit": "4",
  "discription": "This course will examine the consequences of social and economic change in France. Specific topics will include institutional development under a semi- presidential system, parties, and elections.",
  "prerequsite": null
 },
 {
  "code": "POLI 120D",
  "title": "Germany: Before, During, and After Division",
  "unit": "4",
  "discription": "Consideration of political, economic, and security factors that have kept Germany at the center of European developments for more than a century.",
  "prerequsite": null
 },
 {
  "code": "POLI 120E",
  "title": "Scandinavian Politics",
  "unit": "4",
  "discription": "Introduction to the politics and societies of the Scandinavian states (Denmark, Finland, Norway, and Sweden). Focuses on historical development, political culture, constitutional arrangements, political institutions, parties and interest groups, the Scandinavian welfare states, and foreign policy.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 120G",
  "title": "British Politics",
  "unit": "4",
  "discription": "Emphasis will be placed on the interaction between British political institutions and processes and contemporary policy problems: the economy, social policy, foreign affairs. The course assumes no prior knowledge of British politics and comparisons with the United States will be drawn.",
  "prerequsite": null
 },
 {
  "code": "POLI 120H",
  "title": "European Integration",
  "unit": "4",
  "discription": "This course reviews the origins and development of the European Community/European Union and its institutions, theories of integration and the challenges inherent in the creation of a supranational political regime.",
  "prerequsite": null
 },
 {
  "code": "POLI 120I",
  "title": "Politics in Italy",
  "unit": "4",
  "discription": "This course will provide a comparative perspective on the development and functioning of the Italian political system. It includes analysis of political institutions, ideological traditions, parties and elections, political elites in the policy process, and the evolving importance of Italy within European integration.",
  "prerequsite": null
 },
 {
  "code": "POLI 120N",
  "title": "Contention and Conflict in Africa",
  "unit": "4",
  "discription": "This course offers a systematic study of civil wars, electoral violence, anti- immigrant violence, genocides, coups, riots, and rebel groups in sub-Saharan Africa. It will explore why some regions experience certain types of violence and others do not.",
  "prerequsite": null
 },
 {
  "code": "POLI 120P",
  "title": "Africa’s Success Stories",
  "unit": "4",
  "discription": "This course examines reasons why we can be cautiously optimistic about development, growth, peace and democratization in Africa. Sample cases include Botswana’s resource blessing, postconflict reconstruction in Uganda, and democratization in Ghana, Benin, and Niger.",
  "prerequsite": null
 },
 {
  "code": "POLI 120Q",
  "title": "Ethnic Politics",
  "unit": "4",
  "discription": "This course introduces students to the comparative study of ethnic politics. It examines the relationships between ethnicity on one hand, and mobilization, political contestation, violence, trust, and pork on the other. It draws from analysis from a variety of contexts and regions, such as sub-Saharan Africa, Eastern Europe, North America, South Asia, and Western Europe.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 121",
  "title": "Government and Politics of the Middle East",
  "unit": "4",
  "discription": "This course examines general themes affecting the region (social structure and regime type, religion and modernization, bonds and tensions), the character of major states, and efforts to resolve the conflict between Israel and its Arab and Islamic neighbors.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 121B",
  "title": "Politics in Israel",
  "unit": "4",
  "discription": "An interdisciplinary study of Israel as both a unique and yet a common example of a modern democratic nation-state. We will examine Israel's history, its political, economic, and legal systems, social structure and multicultural tensions, the relation between state and religion, national security, and international relations.",
  "prerequsite": null
 },
 {
  "code": "POLI 122",
  "title": "Politics of Human Rights",
  "unit": "4",
  "discription": "What do we mean by “international human rights”? Are they universal? This course examines human rights abuse and redress over time, and across different regions of the world. From this empirically grounded perspective, we critically evaluate contemporary human rights debates.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 122D",
  "title": "Abuse of Power",
  "unit": "4",
  "discription": "Power, a crucial part of politics, can be, and often is, abused. This course discusses the nature of power and surveys a variety of abuses, including agenda manipulation, rent extraction, fraud, extortion, corruption, exploitation, and gross political oppression.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 123",
  "title": "Politics of Empire in Comparative Perspective",
  "unit": "4",
  "discription": "In between “rises” and “declines,” empires are political entities with highly heterogeneous populations that must be governed. The course examines the similarities and differences in imperial governance, comparing the internal and external political dynamics of traditional (Roman, Ottoman), modernizing (Habsburg), and modern (British) empires.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 124",
  "title": "Israeli-Palestinian Conflict",
  "unit": "4",
  "discription": "(Same as SOCI 188I.) In this course, we will examine the national and colonial dimensions of this long-lasting conflict and then turn our attention to the legal, governmental/political, and everyday aspects of the Israeli occupation of the West Bank and Gaza following the 1967 war.",
  "prerequsite": null
 },
 {
  "code": "POLI 124A",
  "title": "Political Consequences of Electoral Systems",
  "unit": "4",
  "discription": "A comparative survey of the major dimensions of the electoral systems used in contemporary democracies (including plurality and majority systems, proportional representation, and districting methods) and of their effects on party competition.",
  "prerequsite": null
 },
 {
  "code": "POLI 125",
  "title": "Gender, Politics, and Globalization",
  "unit": "4",
  "discription": "What have been the effects of globalization on gender, and how has gender shaped conceptions and processes of globalization? Through case studies drawn from the global north and south, this course critically assesses contemporary theoretical debates on global gender justice.",
  "prerequsite": null
 },
 {
  "code": "POLI 125A",
  "title": "Communities and the Environment",
  "unit": "4",
  "discription": "A popular new idea in environmental protection is to include local communities in conservation efforts. But what are these communities? What challenges do they face in governing their own resources? This course uses both theory and case studies to explore the political economy of community-based conservations.",
  "prerequsite": null
 },
 {
  "code": "POLI 125B",
  "title": "The Politics of Food in a Global Economy",
  "unit": "4",
  "discription": "This course explores emerging issues in production and consumption of food in a global economy. On production side, we discuss issues such as famine, overproduction of commercial crops, and sustainability. On consumption side, we explore issues such as fair trade, ethical consumption, and public health consequences (such as obesity). Then we discuss the roles of governments, international organizations, and communities to address these issues.",
  "prerequsite": null
 },
 {
  "code": "POLI 125E",
  "title": "The Politics of Conservation in Developing Countries",
  "unit": "4",
  "discription": "Conservation in developing countries concerns resources that are extremely important to policymakers, militaries, environmental organizations, communities, and individuals. This course examines these groups' struggle for control over wildlife and forests—from the capital to the village—on several continents.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 126",
  "title": "Political Economy of Development",
  "unit": "4",
  "discription": "Why are some countries rich and others poor? This course examines how political and economic factors shape development trajectories, focusing on Africa, Asia, and Latin America. Topics include the impact of democracy, corruption, oil, and foreign aid on economic development.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 126AA",
  "title": "Fundamentals of Political Economy: Modern Capitalism",
  "unit": "4",
  "discription": "This course explores how economic factors affect political institutions and how political action affects economic behavior in the United States and Western Europe. Particular attention is given to relations between business and labor, economic policy choices, and the impact of international trade.",
  "prerequsite": "POLI 11 or consent of instructor."
 },
 {
  "code": "POLI 126AB",
  "title": "Politics and Economics in Eastern Europe",
  "unit": "4",
  "discription": "This course explores the interrelationship of politics and economics in Eastern Europe, analyzing the historic evolution of the area, the socialist period, and contemporary political and economic change there.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 127",
  "title": "Politics of Developing Countries",
  "unit": "4",
  "discription": "This course critically examines central concepts and theories of development, and assesses their utility in understanding political, economic, and social change in the developing world. Central case studies are drawn from three regions: Latin America, Sub-Saharan Africa, and Southeast Asia.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 128",
  "title": "Autocracy, Democracy, and Prosperity",
  "unit": "4",
  "discription": "This course considers the interplay between factor endowments, political institutions, and economic performance. It focuses on the connection between representative political institutions and the emergence and expansion of markets.",
  "prerequsite": null
 },
 {
  "code": "POLI 129",
  "title": "How to Steal an Election",
  "unit": "4",
  "discription": "Examine the role of elections in new and fragile democracies, explore how politicians construct elections to suppress increased levels of democracy, the techniques used to undermine free and fair elections, and the strategic responses to these actions by domestic/international actors.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 130AD",
  "title": "The Politics of the Russian Revolution",
  "unit": "4",
  "discription": "An examination of the dynamics of the Russian Revolution from 1905 through the Stalinist period and recent years in light of theories of revolutionary change. Emphasis is placed on the significance of political thought, socioeconomic stratification, and culturo-historical conditions.",
  "prerequsite": null
 },
 {
  "code": "POLI 130B",
  "title": "Politics in the People's Republic of China",
  "unit": "4",
  "discription": "This course analyzes the political system of China since 1949, including political institutions, the policy-making process, and the relationship between politics and economics. The main focus is on the post-Mao era of reform beginning in 1978.",
  "prerequsite": null
 },
 {
  "code": "POLI 130G",
  "title": "Politics of Modern India",
  "unit": "4",
  "discription": "The course gives an overview of Indian politics since 1947. It addresses the following: (1) To what extent is India a full-fledged democracy in which all citizens enjoy political equality? (2) Why has political violence occurred in some parts of India, and at certain times, but not others? (3) How well have the country's institutions fared in alleviating poverty?",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 131",
  "title": "Muslim Integration and Exclusion",
  "unit": "4",
  "discription": "Is there a Muslim challenge to immigrant integration in Christian-heritage societies? This course asks if and why Muslim immigrants integrate into their host societies, and evaluates the various solutions put forth by politicians and scholars.",
  "prerequsite": null
 },
 {
  "code": "POLI 131C",
  "title": "The Chinese Revolution",
  "unit": "4",
  "discription": "An analysis of the dynamics of the Chinese Revolution from the fall of the Qing Dynasty (1644–1911) to the present. Emphasis is placed on the relationship between political thought and the dynamics of the revolutionary process.",
  "prerequsite": null
 },
 {
  "code": "POLI 132",
  "title": "Political Development and Modern China",
  "unit": "4",
  "discription": "Political development has dominated the study of comparative politics among US academicians since the revival of the Cold War in 1947. This course examines critically this paradigm and its Western philosophical roots in the context of the experience of modern China.",
  "prerequsite": null
 },
 {
  "code": "POLI 133A",
  "title": "Japanese Politics: A Developmental Perspective",
  "unit": "4",
  "discription": "This course will analyze the political systems of modern Japan in comparative- historical perspective.",
  "prerequsite": null
 },
 {
  "code": "POLI 133D",
  "title": "Political Institutions of East Asian Countries",
  "unit": "4",
  "discription": "This course discusses the following major topics in three East Asian countries (Japan, South Korea, and the Philippines) from a comparative perspective: (a) economic and political development; (b) political institutions; and (c) policies.",
  "prerequsite": null
 },
 {
  "code": "POLI 133G",
  "title": "Postwar US-Japan Relations",
  "unit": "4",
  "discription": "The relationship between the United States and Japan has been described as \"the most important in the world, bar none.\" This course will examine US-Japan security and economic relations in the postwar period from the Occupation and Cold War alliance through the severe bilateral trade friction of the 1980s and 1990s to the present relationship and how it is being transformed by the forces of globalization, regionalization, and multilateralism.",
  "prerequsite": null
 },
 {
  "code": "POLI 133J",
  "title": "Korean Politics",
  "unit": "4",
  "discription": "This course is primarily about the politics and political economy of South Korea, but will also briefly look at politics and political economy of North Korea as well as foreign and unification policies of the two Koreas.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 134AA",
  "title": "Comparative Politics of Latin America",
  "unit": "4",
  "discription": "Comparative analysis of contemporary political systems and developmental profiles of selected Latin American countries, with special reference to the ways in which revolutionary and counter-revolutionary movements have affected the political, economic, and social structures observable in these countries today. Analyzes the performance of “revolutionary” governments in dealing with problems of domestic political management, reducing external economic dependency, redistributing wealth, creating employment, and extending social services. Introduction to general theoretical works on Latin American politics and development.",
  "prerequsite": "POLI 11 or consent of instructor."
 },
 {
  "code": "POLI 134B",
  "title": "Politics in Mexico",
  "unit": "4",
  "discription": "General survey of the Mexican political system as it operates today. Emphasis on factors promoting the breakdown of Mexico's authoritarian regime and the transition to a more democratic political system. Changing relationship between the state and various segments of Mexico society (economic elites, peasants, urban labor, and the Church). New patterns of civil-military relations.",
  "prerequsite": null
 },
 {
  "code": "POLI 134D",
  "title": "Selected Topics in Latin American Politics",
  "unit": "4",
  "discription": "A comparative analysis of contemporary political issues in Latin America. Material to be drawn from two or three countries. Among the topics: development, nationalism, neoimperialism, political change. May be taken for credit two times.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 134I",
  "title": "Politics in the Southern Cone of Latin America",
  "unit": "4",
  "discription": "This course is a comparative analysis of twentieth-century political developments and issues in the southern cone of Latin America: Argentina, Chile, and Uruguay. The course will also examine the social and economic content and results of contrasting political experiments.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 134J",
  "title": "Cuba: Revolution and Reform",
  "unit": "4",
  "discription": "Students will study the origins and direction of the Cuban revolution and the actions and personality of Castro. Additional topics will include the Cuban economy today, Cuban political organizations and public opinion, important social issues including health care and public education, and Cuban foreign policy and relations between the U.S. and Cuba. The class will instruct students on Cuban contemporary social media and conclude with an examination of alternative scenarios for Cuba's future.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 135",
  "title": "Comparative LGBT Politics",
  "unit": "4",
  "discription": "This course is designed to expose students to the study of LGBT politics, focusing specifically on the formation of LGBT movements, the presence (or absence) of political opportunities to advance their desired goals, as well as their political success (or lack thereof). Although the course will initially examine the US LGBT movement, the course will also examine the formation (and political success/failure) of LGBT movements in other democratic political systems.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 136",
  "title": "Religion and Politics",
  "unit": "4",
  "discription": "The political impact of major religious traditions—including Christianity, Islam, Hinduism, and Confucianism—around the world.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "POLI 136A",
  "title": "Nationalism and Politics",
  "unit": "4",
  "discription": "An examination of nationalist politics as practiced by opposition movements and governments in power. Appropriate case studies from around the world will be selected.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 137",
  "title": "A Sports Analytics Approach to the Social Sciences",
  "unit": "4",
  "discription": "Sports analytics is a fast-growing field. It uses data and statistical methods to measure performance in competitive sports. The approach's popularity has generated a wealth of data that can be used to shed light on social science questions in interesting ways. We will focus on topics such as violent behavior, discrimination, cultural/ethnic diversity, corruption, and cognitive biases using examples from baseball, basketball, figure skating, football, hockey, soccer, and sumo wrestling.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 137A",
  "title": "Comparative Political Parties and Interest Groups",
  "unit": "4",
  "discription": "This course serves as an introduction to the comparative study of political parties and interest groups as well as an analytical introduction to parties, interest groups, and their role in democratic representation.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 138D",
  "title": "Special Topics in Comparative Politics",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of comparative politics. May be repeated for credit three times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequsite": null
 },
 {
  "code": "POLI 140A",
  "title": "International Law",
  "unit": "4",
  "discription": "International law is central to the efforts to create a world order to limit armed conflict, regulate world economy, and set minimum standards for human rights. This course introduces international law and explains theories advanced by academic analysts and practitioners to explain its role.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 140B",
  "title": "Concepts and Aspects of Revolution",
  "unit": "4",
  "discription": "Introduction to the analytical and comparative study of revolutionary movements and related forms of political violence. Topics include the classical paradigm, types of revolutionary episodes, psychological theories, ideology and belief systems, coups, insurgencies, civil wars, and terrorism and revolutionary outcomes.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 140C",
  "title": "International Crisis Diplomacy",
  "unit": "4",
  "discription": "A survey of international peacekeeping and peace enforcement in civil conflicts with a simulation of international diplomacy.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 140D",
  "title": "International Human Rights Law: Migrant Populations",
  "unit": "4",
  "discription": "International migration creates a distinct set of human rights challenges. This course examines the conflict between international legal obligations and domestic politics of citizenship, human rights, asylum, and human trafficking.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 142A",
  "title": "United States Foreign Policy",
  "unit": "4",
  "discription": "United States foreign policy from the colonial period to the present era. Systematic analysis of competing explanations for US policies—strategic interests, economic requirements, or the vicissitudes of domestic politics. Interaction between the U.S., foreign states (particularly allies), and transnational actors are examined.",
  "prerequsite": "POLI 12 or consent of instructor."
 },
 {
  "code": "POLI 142D",
  "title": "Weapons of Mass Destruction",
  "unit": "4",
  "discription": "This course provides an overview of the challenges posed by chemical, biological, radiological, and nuclear weapons. Students will learn about how these weapons work, why states seek them, and attempts to prevent proliferation. We will delve into technical and policy challenges related to these weapons, and address how CBRN weapons shape national and regional security dynamics. Efforts to restrict the proliferation of these weapons will be discussed. We will also analyze CBRN terrorism.",
  "prerequsite": null
 },
 {
  "code": "POLI 142I",
  "title": "National and International Security",
  "unit": "4",
  "discription": "A survey of theories of defense policies and international security.",
  "prerequsite": null
 },
 {
  "code": "POLI 142J",
  "title": "National Security Strategy",
  "unit": "4",
  "discription": "A survey of American strategies for national defense. Topics may include deterrence, coercive diplomacy, limited war, and unconventional warfare.",
  "prerequsite": null
 },
 {
  "code": "POLI 142K",
  "title": "Politics and Warfare",
  "unit": "4",
  "discription": "This course offers an exploration of general theories of the origins of warfare; the impact of the state on war in the modern world; and the microfoundations of combat and compliance in the context of the costs of war and military mobilization. The course should be of special interest to students in international relations and comparative politics.",
  "prerequsite": null
 },
 {
  "code": "POLI 142L",
  "title": "Insurgency and Terrorism",
  "unit": "4",
  "discription": "“Terrorism” uses “illegitimate” violence to achieve political goals. This course uses philosophical, historical, and contemporary material from distinct cultures to understand which actions are defined as “terrorist,” who uses them, why, and when, as well as the determinants of their effectiveness.",
  "prerequsite": null
 },
 {
  "code": "POLI 142M",
  "title": "US Foreign Policy/Regional Security",
  "unit": "4",
  "discription": "Lectures and readings examine US foreign policy in Europe, Latin America, and East Asia with attention to current problems with specific nations (e.g., Bosnia) and issues (e.g., terrorism). This course integrates historical, comparative, and foreign perspectives on regional security dynamics.",
  "prerequsite": null
 },
 {
  "code": "POLI 142N",
  "title": "American Defense Policy",
  "unit": "4",
  "discription": "An introduction to analytic techniques for assessing policy options in the field of national security.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 142P",
  "title": "Crisis Areas in World Politics",
  "unit": "4",
  "discription": "This course examines the most critical areas in contemporary world politics. While the emphasis will be placed on American involvement in each crisis, an effort will be made to acquaint the student with its historical and political background.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 142Q",
  "title": "Cold War",
  "unit": "4",
  "discription": "This course explores the way in which the international rivalry between the Soviet Union and the United States affected relationships between the two powers, their allies, the Third World, and above all, their internal domestic affairs and development.",
  "prerequsite": null
 },
 {
  "code": "POLI 143A",
  "title": "War and Society",
  "unit": "4",
  "discription": "How has warfighting evolved over the centuries? How has it varied across cultures? What has war been like for soldiers and civilians? How do societies mobilize for war, and how do they change in the short and long term from fighting?",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 144",
  "title": "International Political Economy",
  "unit": "4",
  "discription": "This course serves as an introduction to the study of international political economy. We will examine the evolution of international economic relations in trade, finance, and economic development and discuss different explanations for its likely causes and consequences.",
  "prerequsite": null
 },
 {
  "code": "POLI 144AB",
  "title": "Selected Topics in International Political Economy",
  "unit": "4",
  "discription": "This course will consider major theories purporting to explain and predict the workings of the international order from the point of view of political economy. An extended discussion of one aspect of the economic order (e.g., the multinational corporation) will serve as the test case. One quarter of economics recommended.",
  "prerequsite": "POLI 12."
 },
 {
  "code": "POLI 144D",
  "title": "International Political Economy: Money and Finance",
  "unit": "4",
  "discription": "Examination of effects of national policies and international collaboration on public and private international financial institutions, in particular the management of international debt crises, economic policy coordination, and the role of international lender of last resort.",
  "prerequsite": null
 },
 {
  "code": "POLI 144E",
  "title": "The Politics of International Trade",
  "unit": "4",
  "discription": "Examines theories of trade and protectionism, focusing both on relations among advanced industrial nations and on relations between developed and developing countries. Topics include standard and strategic trade theory, nontariff barriers to trade, export-led growth strategies, regional trade agreements, and the future of the WTO.",
  "prerequsite": null
 },
 {
  "code": "POLI 144F",
  "title": "The Politics of International Trade and Finance",
  "unit": "4",
  "discription": "Examines the welfare and distributional aspects of international trade and finance as they relate to the politics of economic policy making. Topics include: globalization in historical perspective; origins and consequences of trade policy; exchange-rate arrangements; international capital flows; currency crises; economic development.",
  "prerequsite": null
 },
 {
  "code": "POLI 145A",
  "title": "International Politics and Drugs",
  "unit": "4",
  "discription": "This course examines the domestic and international aspects of the drug trade. It will investigate the drug issues from the perspectives of consumers, producers, traffickers, money launderers, and law enforcement. Course material covers the experience of the United States, Latin America, Turkey, Southeast Asia, Western Europe, and Japan.",
  "prerequsite": null
 },
 {
  "code": "POLI 145C",
  "title": "International Relations After the Cold War: Theory and Prospect",
  "unit": "4",
  "discription": "The nature of international politics appears to have changed dramatically since 1989. This course applies different theoretical approaches to enhance our understanding of the new international environment, future prospects for peace and war, and current problems of foreign policy.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 146A",
  "title": "The U.S. and Latin America: Political and Economic Relations",
  "unit": "4",
  "discription": "An analytical survey of US relations with Latin America from the 1820s to the present, with particular emphasis on the post–Cold War environment. Topics include free trade and economic integration; drugs and drug trafficking; illegal migration and immigration control. Focus covers US policy, Latin American reactions, dynamics of cooperation, and options for the future.",
  "prerequsite": null
 },
 {
  "code": "POLI 147B",
  "title": "Russian-American Relations",
  "unit": "4",
  "discription": "A historical and topical survey of major issues in Russian-American relations, such as security arrangements in the post-Soviet space, the war on terrorism, arms control and nonproliferation, and international energy.",
  "prerequsite": null
 },
 {
  "code": "POLI 150A",
  "title": "Politics of Immigration",
  "unit": "4",
  "discription": "Comparative analysis of attempts by the United States and other industrialized countries to initiate, regulate and reduce immigration from Third World countries. Social and economic factors shaping outcomes of immigration policies, public opinion toward immigrants, anti-immigration movements, and immigration policy reform options in industrialized countries.",
  "prerequsite": "upper-division standing required."
 },
 {
  "code": "POLI 151",
  "title": "International Organizations",
  "unit": "4",
  "discription": "Surveys the theory and function of IOs (UN, NATO, EU, World Bank, IMF) in promoting international cooperation in security, peacekeeping, trade, environment, and human rights. We discuss why IOs exist, how they work, and what challenges they face.",
  "prerequsite": "POLI 12, upper-division standing."
 },
 {
  "code": "POLI 153",
  "title": "The European Union in World Politics",
  "unit": "4",
  "discription": "This course introduces students to the role of the EU as a foreign policy actor. Topics include the development of the EU’s trade policy, foreign aid policy, security policy, as well as case studies of EU foreign policy.",
  "prerequsite": null
 },
 {
  "code": "POLI 154",
  "title": "Special Topics in International Relations",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of international relations. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequsite": null
 },
 {
  "code": "POLI 160AA",
  "title": "Introduction to Policy Analysis",
  "unit": "4",
  "discription": "(Same as USP 101) This course will explore the process by which the preferences of individuals are converted into public policy. Also included will be an examination of the complexity of policy problems, methods for designing better policies, and a review of tools used by analysts and policy makers.",
  "prerequsite": "POLI 10 or 11."
 },
 {
  "code": "POLI 160AB",
  "title": "Introduction to Policy Analysis",
  "unit": "4",
  "discription": "In this course, students will use their knowledge of the political and economic foundations of public policy making to conduct research in a wide variety of public policy problems.",
  "prerequsite": "POLI 160AA."
 },
 {
  "code": "POLI 162",
  "title": "Environmental Policy",
  "unit": "4",
  "discription": "This course will explore contemporary environmental issues such as global warming, endangered species, and land use. Students will be asked to analyze various policy options and to write case analyses. Policies may be debated in class.",
  "prerequsite": null
 },
 {
  "code": "POLI 163",
  "title": "Analyzing Politics",
  "unit": "4",
  "discription": "Politics are understood as the combination of individual preferences and decisions into collective choices. What are the issues involved in aggregating individual preferences, what is the choice of rules—formal and informal—for doing so.",
  "prerequsite": null
 },
 {
  "code": "POLI 164",
  "title": "The Politics of Public Policy",
  "unit": "4",
  "discription": "How do politics determine policy? In this course, students will be introduced to the skill of conducting a cost-benefit analysis, and then will discuss how political ideas, interests, and institutions often move policy outcomes away from those based on cost-benefit analysis.",
  "prerequsite": null
 },
 {
  "code": "POLI 165",
  "title": "Special Topic: Policy Analysis",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of policy analysis. May be repeated for credit two times, provided each course is a separate topic, for a maximum of twelve units.",
  "prerequsite": null
 },
 {
  "code": "POLI 168",
  "title": "Policy Assessment",
  "unit": "4",
  "discription": "The use of real data to assess policy alternatives. Introduction to benefit/cost analysis, decision theory, and the valuation of public goods. Applications to health, environmental, and regulatory economic policy making.",
  "prerequsite": null
 },
 {
  "code": "POLI 170A",
  "title": "Applied Data Analysis for Political Science",
  "unit": "4",
  "discription": "This course is an advanced introductory course for undergraduates. It will acquaint students with statistical methodology as it is used in the social sciences. It is assumed that the student has the mathematical background to progress through the materials a bit faster than in a true introductory course.",
  "prerequsite": "POLI 30 or POLI 30D or consent of instructor."
 },
 {
  "code": "POLI 171",
  "title": "Making Policy with Data",
  "unit": "4",
  "discription": "This class explores how we can make policy recommendations using data. We attempt to establish causal relationships between policy intervention and outcomes based on statistical evidence. Hands-on examples will be provided throughout the course.",
  "prerequsite": "POLI 5 or 5D or ECON 5 and POLI 30 or 30D."
 },
 {
  "code": "POLI 172",
  "title": "Advanced Social Data Analytics",
  "unit": "4",
  "discription": "An accelerated course in computer programming and data analytics for collecting, analyzing, and understanding data in the social world. Students engage in hands-on learning with applied social science problems, developing statistical and computational skills for sophisticated data manipulation, analysis, visualization.",
  "prerequsite": "POLI 5 or 5D or ECON 5 and POLI 30 or 30D."
 },
 {
  "code": "POLI 173",
  "title": "Social Network Analysis",
  "unit": "4",
  "discription": "This class introduces tools for analyzing social networks including graph visualization, egocentric and sociocentric network measures, network simulation, and data management.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 179",
  "title": "Special Topics in Political Science Methodology",
  "unit": "4",
  "discription": "Special topics course in quantitative methods for political science and broader social sciences. May be taken for credit up to three times.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "POLI 191A-B",
  "title": "Senior Honors Seminar: Frontiers of Political Science",
  "unit": "4-4",
  "discription": "This course is open only to seniors interested in qualifying for departmental honors. Admission to the course will be determined by the department. Each student will write an honors essay under the supervision of a member of the faculty.",
  "prerequsite": null
 },
 {
  "code": "POLI 192",
  "title": "Senior Seminar in Political Science",
  "unit": "1",
  "discription": "The Senior Seminar is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in political science at the upper-division level. Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequsite": "department stamp and/or consent of instructor."
 },
 {
  "code": "POLI 194",
  "title": "Research Seminar in Washington, DC",
  "unit": "4",
  "discription": "(Same as COMM 194, USP 194, HITO 193, SOCI 194, COGS 194) Course attached to six-unit internship taken by students participating in the UCDC Program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial research paper.",
  "prerequsite": "participating in UCDC Program."
 },
 {
  "code": "POLI 194RA",
  "title": "Research Apprenticeship Seminar",
  "unit": "4",
  "discription": "Preparation of a major paper from research conducted while participating in the Research Apprenticeship (POLI 198RA). Presentations to and participation in weekly seminar meetings also required. Students can enroll in POLI 194RA only if they have previously taken or are simultaneously enrolled in 198RA.",
  "prerequsite": "department approval. Students must apply for the Research Apprenticeship program and be approved to enroll. Participants must be majors in political science with junior or senior standing and a GPA of 3.5 or higher in all political science courses taken at UC San Diego. Individual projects may require other prerequisite training, such as POLI 30."
 },
 {
  "code": "POLI 194SD",
  "title": "Local Internship Research Seminar",
  "unit": "4",
  "discription": "The Local Internship Research Seminar will be paired with a Local Internship in Political Science (POLI 197SD) in the same quarter. The linkage to this research seminar will provide advanced academic training in analytic skills appropriate to the internship experience and requires a substantial paper based on original research.",
  "prerequsite": "department approval and consent of instructor. **Corequisites:** POLI 197SD."
 },
 {
  "code": "POLI 195",
  "title": "Apprentice Teaching",
  "unit": "4",
  "discription": "Teaching and tutorial activities associated with courses and seminars. Limited to advanced political science majors with at least a 3.5 GPA in upper-division political science courses. P/NP grades only. May be taken for credit two times, but only four units may be used for major credit.",
  "prerequsite": "department approval."
 },
 {
  "code": "POLI 197I",
  "title": "Political Science Washington Internship",
  "unit": "6, 8",
  "discription": "This internship is attached to the UCDC Program. Students participating in the UCDC Program are placed in an internship in the Washington, DC, area requiring approximately seventeen to twenty-three hours per week.",
  "prerequsite": "must be enrolled in the UCDC Program; department stamp required."
 },
 {
  "code": "POLI 197SD",
  "title": "Local Internship in Political Science",
  "unit": "4",
  "discription": "Individual placements for field learning integrated with political science. A written contract involving all parties with learning objectives, a project outline, and a means of supervision and progress evaluation must be filed with the faculty adviser and department undergraduate coordinator prior to the beginning of the internship. P/NP grades only. May be taken for credit two times.",
  "prerequsite": "ninety units completed; 2.5 minimum cumulative GPA overall and 3.0 in political science; POLI 30 and at least two upper-division courses in political science. Department approval and consent of instructor. **Corequisites:** POLI 194SD."
 },
 {
  "code": "POLI 198",
  "title": "Directed Group Study",
  "unit": "2-4",
  "discription": "Directed group study in an area not presently covered by the departmental curriculum. P/NP grades only.",
  "prerequsite": "department approval."
 },
 {
  "code": "POLI 198RA",
  "title": "Research Apprenticeship",
  "unit": "4",
  "discription": "Students conduct directed research as part of a principal investigator's project and under the supervision of a department mentor. Students may conduct research with a department mentor for up to two quarters. This course is part of the Research Apprenticeship program in political science. P/NP grades only. May be taken for credit two times.",
  "prerequsite": "department approval. Students must apply for the Research Apprenticeship program and be approved to enroll. Participants must be majors in political science with junior or senior standing and a GPA of 3.5 or higher in all political science courses taken at UC San Diego. Individual projects may require other prerequisite training, such as POLI 30."
 },
 {
  "code": "POLI 199",
  "title": "Independent Study for Undergraduates",
  "unit": "2 or 4",
  "discription": "Independent reading in advanced political science by individual students. (P/NP grades only.)",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "POLI 200A",
  "title": "Foundations of Political Science",
  "unit": "4",
  "discription": "An introduction to the theoretical concepts in the discipline of political science that are commonly used across various subfields. Each week will introduce the core concept(s) and discuss applications from several, if not all subfields in the department.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 200B",
  "title": "Democracy",
  "unit": "4",
  "discription": "An overview of the normative and positive issues associated with modern democracies. The appeal and the social, political, and economic arrangements of democracies will be explored.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 200C",
  "title": "States and Markets",
  "unit": "4",
  "discription": "An overview of the normative and positive issues associated with decentralized (market) versus centralized (political) mechanics of allocation. The appropriate role of government in the economy will be explored.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 203A",
  "title": "Analytic Theory I",
  "unit": "4",
  "discription": "The first in the two-course sequence on the essentials of game theory and fundamental concepts in the social sciences. This course examines the philosophy of modeling, and introduces social choice theory, decision-making under uncertainty, and games of complete information. Applications include representation and democracy, social dilemmas and collective action, principal-agent problems, self-enforcing agreements, and institutions as equilibria.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 203B",
  "title": "Analytic Theory II",
  "unit": "4",
  "discription": "The second in the two-course sequence on the essentials of game theory and fundamental concepts in the social sciences. This course introduces multistage and repeated games, as well as static and dynamic games with incomplete information. Applications include axiomatic and strategic models of negotiations, bargaining in legislatures, auctions, adverse selection problems, market failures, signaling and screening, reputation, conventions, and cheap talk.",
  "prerequsite": "POLI 203A, graduate student standing."
 },
 {
  "code": "POLI 204A",
  "title": "Research Design",
  "unit": "4",
  "discription": "This course will study various approaches to knowledge accumulation in social science. A basic outline of scientific method will be used to examine the difference between theories as assumptions and axioms and hypotheses as “if- then” statements derived from theory. Experimental, quasi-experimental, and qualitative designs will be discussed.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 204B",
  "title": "Quantitative Methods I",
  "unit": "4",
  "discription": "The use of quantitative methods (particularly multiple regression and its extensions) in political science. Emphasis on understanding the methods and using them in political science applications.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 204C",
  "title": "Game Theory 1",
  "unit": "4",
  "discription": "This course introduces students to the rudiments of decision theory and game theory. Emphasis will be placed on modeling and solving games.",
  "prerequsite": "graduate student standing."
 },
 {
  "code": "POLI 205",
  "title": "Game Theory II",
  "unit": "4",
  "discription": "This course covers advanced topics in game theory. Covered topics will include incomplete information in static and dynamic games, infinitely repeated games, and bargaining games. Emphasis will be placed on advanced equilibrium concepts, and applications of interest to political scientists.",
  "prerequsite": "department approval."
 },
 {
  "code": "POLI 210AA",
  "title": "Systems of Political Thought: Thucydides to Rousseau",
  "unit": "4",
  "discription": "This course is a preparation for the field examination in political theory. It will provide an intensive and critical introduction to European political thought from Thucydides to Rousseau. Some of the secondary literature on this period will also be explored.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 210AB",
  "title": "Systems of Political Thought: Kant to Rawls",
  "unit": "4",
  "discription": "This course is a preparation for the field examination in political theory. It will provide an intensive and critical introduction to European political thought from Kant to Rawls. Some of the secondary literature on this period will also be explored.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 212",
  "title": "Contemporary Sociological Theory",
  "unit": "4",
  "discription": "(Same as Soc/G 202.) Themes important for social theory at the turn of the twenty-first century: Marxism, Gramsci, Althusser, critical theory (Adorno, Habermas), interpretation (Geertz), social systems (Parson), poststructuralism (Foucault), postmodernism, and social constructivism (Bourdieu).",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 213",
  "title": "Culture and Political Theory",
  "unit": "4",
  "discription": "(Same as LTCO 287.) A comparative approach of political theory based on historical periods (with the tools of new historicism), various cultures (inspired by anthropological research), and referring to the most important philosophical thinkers from Western and non-Western traditions.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 214",
  "title": "Marxist and Post-Marxist Political Philosophy",
  "unit": "4",
  "discription": "An examination of selected texts in Marxist and post-Marxist political philosophy, with a focus on the theme of individual and collective identity including issues concerning alienation, consciousness, and ideology.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 215",
  "title": "Social Norms Change and Development",
  "unit": "4",
  "discription": "Study of types of social practices, how to measure them, and how to change them. Illustrated with examples such as footbinding, female genital cutting, urban violence in Colombia, Serbian student revolution, early female marriage, and other adverse gender norms.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 216",
  "title": "Contemporary Liberal and Democratic Theory",
  "unit": "4",
  "discription": "Normative approaches to liberty, equality, justice, and democracy, mostly Anglo-American and empirical approaches to justice. Thinkers such as Rawls, Habermas, Nozick, Dworkin, Raz, Roemer, Elster, Ostrom, Bowles, and Gintis may be considered.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 219",
  "title": "Special Topics in Political Theory",
  "unit": "4",
  "discription": "This seminar is an examination of the different approaches to the study of political theory. Issues and research areas will vary each time the course is offered.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 220A",
  "title": "Comparative Politics: State and Society",
  "unit": "4",
  "discription": "This course will provide a general literature review in comparative politics to serve as preparation for the field examination.",
  "prerequsite": "graduate standing, or consent of instructor."
 },
 {
  "code": "POLI 220B",
  "title": "Comparative Politics: Institutions",
  "unit": "4",
  "discription": "This is a second course in comparative politics designed as a preparation for the field examination. It will focus on the comparative study of political institutions.",
  "prerequsite": "graduate standing, or consent of instructor."
 },
 {
  "code": "POLI 220C",
  "title": "Origins of the State",
  "unit": "4",
  "discription": "Survey of theories, with empirical cases explaining origins of the modern state.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 221",
  "title": "Clientelism and Corruption",
  "unit": "4",
  "discription": "This graduate seminar explores clientelism and corruption. We first investigate clientelism, covering topics such as strategies during elections, the role of brokers, clientelism beyond campaigns, and shifts away from clientelism. We then examine corruption, covering topics such as grand corruption, petty corruption, and causes and consequences of corruption. The course focuses on developing countries, with some comparisons to advanced economies.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 223A",
  "title": "Comparative Parliamentary Studies",
  "unit": "4",
  "discription": "A survey of the academic literature on parliamentary studies, comparing the research on legislative elections, behavior, and organization in American, European, and Asian democracies. The course will also compare various approaches to studying legislative activity.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 224",
  "title": "The Politics of Democratization",
  "unit": "4",
  "discription": "A survey of theories explaining the processes of democratization and democratic stability.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 224A",
  "title": "Elections in Consolidating Democracies",
  "unit": "4",
  "discription": "Course looks at elections in consolidating democracies with an eye to evaluating existing theories of elections with new data. Also explores new empirical patterns in countries around the world, especially Africa, Latin America, Eastern Europe, and the Soviet successor states.",
  "prerequsite": "graduate student standing or consent of instructor."
 },
 {
  "code": "POLI 225",
  "title": "Political Violence",
  "unit": "4",
  "discription": "Contending analysis of the types, strategies, causes, processes, and consequences of political violence such as revolutions, insurgencies, and ethnic conflict.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 225B",
  "title": "The Nation-State",
  "unit": "4",
  "discription": "A reading and research seminar on the origins, development, and politics of nationalism and the nation-state.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 227",
  "title": "Comparative Political Economy",
  "unit": "4",
  "discription": "An introduction to seminal and current research in comparative political economy. Course explores how various political institutions and processes affect economic outcomes (e.g. growth, inequality, and redistribution) and how the economy influences politics (e.g. democratization, electoral institutions, and welfare states).",
  "prerequsite": "POLI 200C or consent of instructor."
 },
 {
  "code": "POLI 228",
  "title": "Historical Political Economy",
  "unit": "4",
  "discription": "Historical political economy (HPE) is a thriving field that employs quantitative historical datasets and qualitative case knowledge to study a wide range of political economy questions. Students will gain exposure to the frontiers of HPE research, and will learn and apply historical research methods to a research project of their choice.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 229",
  "title": "Special Topics in Comparative Politics",
  "unit": "4",
  "discription": "This seminar is an examination of the different approaches to the study of comparative politics. Issues and research areas will vary each time the course is offered.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 231",
  "title": "Political Economy of Development",
  "unit": "4",
  "discription": "This course explores key factors that shape the development trajectory of nations, drawing on work from political science, economics, and sociology. We will examine various aspects of development, with a particular focus on economic growth, and how political institutions influence development outcomes. Topics covered include the relationship between democracy and development, the role of the state, consequences of natural resources and corruption, and the impact of foreign aid.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 231E",
  "title": "Politics of Development",
  "unit": "4",
  "discription": "This course provides an overview of previous and current efforts to explain political and economic development in non-Western settings.",
  "prerequsite": null
 },
 {
  "code": "POLI 232",
  "title": "International Organization",
  "unit": "4",
  "discription": "This course will study various theories purporting to explain why states succeed or fall at creating institutions by international governance and what effects, if any, those institutions have.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 235A",
  "title": "Latin American Politics",
  "unit": "4",
  "discription": "Introductory reading seminar on Latin American politics to acquaint students with leading schools of thought, provide critical perspective on premises and methodology, and identify themes for further inquiry. Themes include authoritarianism, revolution, democratization, regional conflict, and emergence of middle-level powers.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 236",
  "title": "Immigration Policy and Politics",
  "unit": "4",
  "discription": "An interdisciplinary seminar covering origins, consequences, and characteristics of worker migration from Third World countries (especially Mexico, Central America, and the Caribbean basin) to the United States, from the nineteenth century to the present.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 240",
  "title": "International Relations Theory",
  "unit": "4",
  "discription": "A survey of the principal theories and approaches to the study of international relations.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 242",
  "title": "The European Union and Global Governance",
  "unit": "4",
  "discription": "This course explores contemporary research on European Union politics from a comparative and international relations perspective, and links this research to broader questions of global governance.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 242D",
  "title": "Weapons of Mass Destruction",
  "unit": "4",
  "discription": "This course provides an overview of the challenges posed by chemical, biological, radiological, and nuclear weapons. Students will learn about how these weapons work, why states seek them, and attempts to prevent proliferation. We will delve into technical and policy challenges related to these weapons, and address how CBRN weapons shape national and regional security dynamics. Efforts to restrict the proliferation of these weapons will be discussed. We will also analyze CBRN terrorism. May be coscheduled with POLI 142D.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 243",
  "title": "International Security",
  "unit": "4",
  "discription": "A colloquium surveying the major theoretical controversies in the study of international and national security.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 244",
  "title": "International Institutions",
  "unit": "4",
  "discription": "This course exposes students to contemporary research on international institutions. What leads nations to cede sovereignty? How do international institutions obtain a measure of authority in world affairs? What makes an institution \"successful\"? We'll also examine institutional design.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 244A",
  "title": "European Integration",
  "unit": "4",
  "discription": "This seminar provides perspectives on the theories and politics of European integration. Analysis will focus on the development of the European Union, the functioning of core institutions, and the challenges of creating a supranational political regime.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 245",
  "title": "International Political Economy",
  "unit": "4",
  "discription": "A seminar surveying the major theoretical controversies in the study of international political economy.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 245A",
  "title": "Political Economy of Regional Integration",
  "unit": "4",
  "discription": "This graduate course surveys theories of regional political and economic integration and international cooperation from a comparative and international relations perspective. We compare and contrast the European Union and other regional organizations.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 247A",
  "title": "Quantitative International Relations",
  "unit": "4",
  "discription": "Explores empirical research in international relations with special emphasis on international conflict. Topics covered include theories on the causes of war, the distribution of power and conflict, formal and informal alignment, interdependence and conflict, linkages between domestic and international processes, and issues of research design. Students who have previously taken 247 may not take this course for credit.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 247B",
  "title": "Formal Models in International Relations",
  "unit": "4",
  "discription": "Explores formal analytic and primarily game-theoretic research in international relations with emphasis on conflict and bargaining. Topics include: causes of war and peace, conventional and nuclear deterrence, crisis bargaining, arms race, and two-level games.",
  "prerequsite": null
 },
 {
  "code": "POLI 247C",
  "title": "History of International Relations",
  "unit": "4",
  "discription": "This course is a survey of the history of international relations from 1618 to 1945. The focus is on diplomacy and war-fighting in their social, economic, political, cultural, and technological contexts. Formative conflicts will be examined in detail.",
  "prerequsite": "240, 247A, and 247B; graduate standing."
 },
 {
  "code": "POLI 248",
  "title": "Special Topics in International Relations",
  "unit": "4",
  "discription": "(Same as IRGN 290) This seminar is an examination of the different approaches to the study of international relations. Issues and research areas will vary each time the course is offered.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 250",
  "title": "The Politics of Race, Ethnicity, and Immigration",
  "unit": "4",
  "discription": "This course examines the interplay between racial/ethnic identity and politics. How do race and ethnicity become politicized? What role does ethnic or racial identity play in political behavior and decision-making processes? To what extent do political institutions and institutional design reinforce the salience of ethnic or racial identity in politics? We will be taking a comparative approach to this topic, and cover readings in both American politics and comparative politics literature.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 251",
  "title": "American Political Institutions",
  "unit": "4",
  "discription": "A critical examination of major contributions to the theoretical and empirical literature on the US Congress, presidency, and federal bureaucracy.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 252",
  "title": "American Politics: Behavior",
  "unit": "4",
  "discription": "Theoretical and empirical perspectives on voting and other forms of political participation, parties, interest groups, and public opinion in the United States.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 253",
  "title": "Research in State Politics",
  "unit": "4",
  "discription": "This seminar will survey the existing literature in state politics with an eye toward proposing new research designs. Topics will include the variation across states in electoral systems, campaign finance laws, political culture, legislative institutions, judicial arrangements, and policy outcomes.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 254",
  "title": "American Political Development",
  "unit": "4",
  "discription": "This course examines the historical evolution of the American state with particular attention to theories of political development. Special topics include the development of the party system, electoral and policy realignments, and the evolution of national political institutions.",
  "prerequsite": "graduate standing in any discipline of the social sciences or humanities or consent of instructor."
 },
 {
  "code": "POLI 255",
  "title": "Urban Politics",
  "unit": "4",
  "discription": "Examines central works on the development of political institutions in US cities; analyses of community power structures; who governs, why, and to what ends; processes and prospects for minority empowerment; the prominence of “growth machines”; the political economy of contemporary cities.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 256",
  "title": "Race, Class, and Institutions in American Political Economy",
  "unit": "4",
  "discription": "This course will explore how institutions address and/or perpetuate racial, ethnic, and economic inequality in the U.S.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 257",
  "title": "Voting and Elections",
  "unit": "4",
  "discription": "This course is designed to acquaint graduate students with the central themes and issues in the study of voting in national elections.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 259",
  "title": "Special Topics in American Politics",
  "unit": "4",
  "discription": "This seminar is an examination of the different approaches to the study of American politics. Issues and research areas will vary each time the course is offered.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 260",
  "title": "Social Science Replication",
  "unit": "4",
  "discription": "The purpose of this class is to replicate new empirical research in the social sciences. The class meets weekly and will begin with two lectures introducing replication tools and best practices. Thereafter, pairs of students will take turns replicating and extending a working paper by an established political scientist—normally a visitor to UC San Diego—and will present their findings in front of the author. Through such reverse engineering, students will learn how to do excellent quantitative work.",
  "prerequsite": "POLI 204B and POLI 270 and POLI 271; graduate standing."
 },
 {
  "code": "POLI 270",
  "title": "Mathematical and Statistical Foundations",
  "unit": "4",
  "discription": "This course reviews essential calculus and linear algebra and introduces probability theory (probability rules, random variables, univariate and multivariate distributions) and mathematical statistics (sampling distributions, estimation and inference frameworks).",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 271",
  "title": "Advanced Statistical Applications",
  "unit": "4",
  "discription": "Use of advanced quantitative techniques in political science. Students will use political science data to complete small exercises and a major project. Students may not receive credit for both 271B and 271.",
  "prerequsite": "204B and 270; graduate standing."
 },
 {
  "code": "POLI 272",
  "title": "Bayesian Methods",
  "unit": "4",
  "discription": "Provides students a solid understanding of Bayesian inference and Markov chain Monte Carlo methods. Topics covered include Bayesian treatment of the linear model, Markov chain Monte Carlo methods, assessing model adequacy, and hierarchical models.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 273",
  "title": "Causal Inference",
  "unit": "4",
  "discription": "This course covers designs and methods of causal inference, including randomized experiments, cross-sectional and longitudinal designs, and other tools such as sensitivity analysis and randomization inference. These methods are illustrated with examples in political science and positive political economy.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 274",
  "title": "Text as Data",
  "unit": "4",
  "discription": "This class explores statistical and computational methods to enable students to use text as a data source in the social sciences. Hands-on examples and a final project will equip students to work with text data in their own research.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 275",
  "title": "Interviews, Survey Design, and Sampling",
  "unit": "4",
  "discription": "This course covers advanced topics in the design and implementation of field surveys and interviews. Questionnaire design and survey techniques for sensitive topics such as list experiments will be developed, as well as sampling methodologies to achieve representivity.",
  "prerequsite": null
 },
 {
  "code": "POLI 276",
  "title": "Qualitative Methods",
  "unit": "4",
  "discription": "Topics include concept formation; set theoretic and QCA approaches; within- case vs. cross-case analysis; the logic of case selection; counterfactuals; the use of narrative; primary, secondary, archival, and interview source material; comparative-historical analysis; and ethnography. Attention will be given to how qualitative approaches can be used to test game-theoretic models and strengthen casual inference in econometric and experimental designs. Reading intensive.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 278",
  "title": "Political Economy Models of Elections",
  "unit": "4",
  "discription": "This course introduces the formal literature on economic models of voting and electoral politics. It reviews models that look at elections as I) mechanisms for preference aggregation, II) mechanisms for information aggregation, and III) mechanisms for selecting and incentivizing politicians.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 279",
  "title": "Special Topics in Methodology",
  "unit": "4",
  "discription": "This course offers selected topics in quantitative methodology. Content may vary each time the course is offered. May be taken for credit three times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 280",
  "title": "Workshop: International Law and Regulation",
  "unit": "4",
  "discription": "Examination of recent research in international law and regulation: development and presentation of research projects by graduate students; presentation of research by faculty. Third-year students present dissertation prospectus, candidates make yearly presentations of dissertation research. S/U grades only. May be taken for credit three times as topics vary.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 281",
  "title": "Workshop: American Politics",
  "unit": "4",
  "discription": "Examination of recent research in American politics: development and presentation of research projects by graduate students, presentations of research by faculty. Third year students present dissertation prospectus; candidates make yearly presentations of dissertation research. May be taken for credit three times.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 282",
  "title": "Workshop: Comparative Politics",
  "unit": "4",
  "discription": "Examination of recent research in comparative politics, development and presentation of research projects by graduate students; presentations of research projects by faculty. Third-year students present dissertation prospectus; candidates make yearly presentations of dissertation research. May be taken for credit three times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 283",
  "title": "Workshop: International Relations",
  "unit": "4",
  "discription": "Examination of recent research in international relations, development and presentation of research projects by graduate students, presentations of research projects by faculty. Third year students present dissertation prospectus; candidates make yearly presentation of dissertation research. May be taken for credit three times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 285",
  "title": "Workshop: Political Theory",
  "unit": "4",
  "discription": "Examination of recent research in political theory: development and presentation of research projects by graduate students, presentation of research by faculty. Third year students present dissertation prospectus; candidates make yearly presentations of dissertation research. May be taken for credit three times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 286",
  "title": "Workshop: Methodology",
  "unit": "4",
  "discription": "Examination of recent research in political methodology; development and presentation of research projects by graduate students, presentation of research by faculty. Third year students present dissertation prospectus; candidates make yearly presentations of dissertation research. May be taken for credit three times.",
  "prerequsite": "graduate standing or consent of instructor."
 },
 {
  "code": "POLI 287",
  "title": "Multidisciplinary Methods in Political Science: Social Networks",
  "unit": "4",
  "discription": "Examination of research in the natural sciences that may be applied to problems in political science, development and presentation of research projects by graduate students and faculty, special emphasis on social networks.",
  "prerequsite": "204A and 204B and 204C, graduate standing or consent of instructor."
 },
 {
  "code": "POLI 289",
  "title": "Multidisciplinary Methods in Political Science: Biology",
  "unit": "4",
  "discription": "Examination of research in the natural sciences that may be applied to problems in political science, development and presentation of research projects by graduate students and faculty, special emphasis on biology.",
  "prerequsite": "204A and 204B and 204C, graduate standing or consent of instructor."
 },
 {
  "code": "POLI 298",
  "title": "Directed Reading",
  "unit": "1–12",
  "discription": "Guided and supervised reading in the literature of the several fields of political science.",
  "prerequsite": null
 },
 {
  "code": "POLI 299",
  "title": "Dissertation Research",
  "unit": "1–12",
  "discription": "Independent work by graduate students engaged in research and writing of second-year paper and doctoral dissertation, under direct supervision of adviser.",
  "prerequsite": null
 },
 {
  "code": "POLI 500",
  "title": "Apprentice Teaching",
  "unit": "1–4",
  "discription": "A course in which teaching assistants are aided in learning proper teaching methods by means of supervision of their work by the faculty: handling of discussions, preparation, and grading of examinations and other written exercises, and student relations. Twenty-four units of teaching apprenticeship meet the department teaching requirement for the PhD.",
  "prerequsite": null
 },
 {
  "code": "POLI 501",
  "title": "Seminar on Teaching Development—American Politics",
  "unit": "1–4",
  "discription": "A seminar designed for graduate students serving as teaching assistants in American politics, includes discussion of teaching theories, techniques, and materials, conduct of discussion sessions, and participation in examinations, under the supervision of the instructor in charge of the course.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 502",
  "title": "Seminar on Teaching Development—Comparative Politics",
  "unit": "1–4",
  "discription": "A seminar designed for graduate students serving as teaching assistants in comparative politics, includes discussion of teaching theories, techniques, and materials, conduct of discussion sessions, and participation in examinations, under the supervision of the instructor in charge of the course.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 503",
  "title": "Seminar on Teaching Development—International Relations",
  "unit": "1–4",
  "discription": "A seminar designed for graduate students serving as teaching assistants in international relations, includes discussion of teaching theories, techniques, and materials, conduct of discussion sessions, and participation in examinations under the supervision of the instructor in charge of the course.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 504",
  "title": "Seminar on Teaching Development—Political Theory",
  "unit": "1–4",
  "discription": "A seminar designed for graduate students serving as teaching assistants in political theory, includes discussion of teaching theories, techniques, and materials, conduct of discussion sessions, and participation in examinations, under the supervision of the instructor in charge of the course.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "POLI 599",
  "title": "Teaching Methods in Political Science",
  "unit": "2",
  "discription": "Training in teaching methods in the field of political science. Examines evidence-based research on undergraduate teaching and learning with emphasis on effective teaching techniques appropriate to political science. Covers TA training, syllabus design, and effective teaching strategies.",
  "prerequsite": "graduate standing in political science."
 }
]