[
 {
  "code": "PSYC 1",
  "title": "Psychology",
  "unit": "4",
  "description": "This course provides an overview of the basic concepts in psychology. Topics may include human information processing, learning and memory, motivation, development, language acquisition, social psychology, and personality.",
  "prerequisite": null
 },
 {
  "code": "PSYC 2",
  "title": "General Psychology: Biological Foundations",
  "unit": "4",
  "description": "This course provides an introductory survey of the relationship between human behavior and brain function. Specific areas of emphasis include vision and other sensory processes, memory, motivation, attention, and cognition.",
  "prerequisite": null
 },
 {
  "code": "PSYC 3",
  "title": "General Psychology: Cognitive Foundations",
  "unit": "4",
  "description": "This course provides an introduction to the basic concepts of cognitive psychology. Topics include perception, attention, memory, language, and thought. The relation of cognitive psychology to cognitive science and to neuropsychology is also covered.",
  "prerequisite": null
 },
 {
  "code": "PSYC 4",
  "title": "General Psychology: Behavioral Foundations",
  "unit": "4",
  "description": "This course provides an introduction to behavioral psychology. Topics include classical conditioning, operant conditioning, animal learning, and motivation and behavior modification.",
  "prerequisite": null
 },
 {
  "code": "PSYC 6",
  "title": "General Psychology: Social Foundations",
  "unit": "4",
  "description": "This course provides an introduction to social psychology. Topics may include emotion, aesthetics, behavioral medicine, person perception, attitudes and attitude change, and behavior in social organizations.",
  "prerequisite": null
 },
 {
  "code": "PSYC 7",
  "title": "General Psychology: Developmental Foundations",
  "unit": "4",
  "description": "This course provides an introduction to theories and research results in developmental psychology, covering infancy through adulthood.",
  "prerequisite": null
 },
 {
  "code": "PSYC 60",
  "title": "Introduction to Statistics",
  "unit": "4",
  "description": "This course provides an introduction to both descriptive and inferential statistics, core tools in the process of scientific discovery and the interpretation of research.",
  "prerequisite": null
 },
 {
  "code": "PSYC 70",
  "title": "Research Methods in Psychology",
  "unit": "4",
  "description": "This course provides an overview of how to choose appropriate research methods for experimental and nonexperimental studies. Topics may include classic experimental design and counterbalancing, statistical power, and causal inference in experimental and nonexperimental settings.",
  "prerequisite": "PSYC 60 or equivalent."
 },
 {
  "code": "PSYC 71",
  "title": "Laboratory in Psychological Research Methods",
  "unit": "4",
  "description": "This course provides hands-on research experience. Lecture topics will include experimental and nonexperimental designs, research ethics, data analysis, and causal inference. Students will design original research projects, collect and analyze data, and write a full APA-style report, including a brief literature review relevant to their design. This course builds on PSYC 70 by applying design principles to students' own research questions and ideas.",
  "prerequisite": "PSYC 70."
 },
 {
  "code": "PSYC 81",
  "title": "Laboratory in Brain, Behavior, and Evolution",
  "unit": "4",
  "description": "This course provides students the opportunity to learn about the intricate relationship that exists between brain and behavior, as well as the evolutionary forces that shape this interaction. Lectures for this course aim to introduce students to some of the best examples in the literature that highlight these issues, while a parallel component of the course aims to introduce students to performing research on the topic.",
  "prerequisite": "COGS 14B or Math 11 or PSYC 60."
 },
 {
  "code": "PSYC 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "PSYC 88",
  "title": "Learning Sustainable Well-being",
  "unit": "1",
  "description": "This course provides an overview of how to practice well-being, with principles based on mindfulness, positive psychology, cognitive therapy, and neuroscience. Each week, there is a short lecture on a given topic, combined with workshop-style exercises.",
  "prerequisite": null
 },
 {
  "code": "PSYC 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "description": "This seminar introduces the various subdisciplines in psychology and their research methods, and also explores career and graduate school opportunities. This includes informal presentations by faculty, graduate students, and other professionals.",
  "prerequisite": null
 },
 {
  "code": "PSYC 93",
  "title": "Topics in Psychology",
  "unit": "4",
  "description": "Selected topics in the field of psychology. May be repeated for credit as topics vary.",
  "prerequisite": null
 },
 {
  "code": "PSYC 99",
  "title": "Independent Study",
  "unit": "2 or 4",
  "description": "Independent study or research under direction of a member of the faculty. May be taken up to three times for a maximum of twelve units.",
  "prerequisite": "lower-division standing, completion of at least thirty units of undergraduate study at UC San Diego with a minimum UC San Diego GPA of 3.0; completed and approved Special Studies form."
 },
 {
  "code": "PSYC 100",
  "title": "Clinical Psychology",
  "unit": "4",
  "description": "This course provides a comprehensive overview of the causes, characteristics, and treatment of psychological disorders. Particular emphasis is given to the interaction between biological, psychological, and sociocultural processes contributing to abnormal behavior. Students may not receive credit for both PSYC 163 and PSYC 100.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 101",
  "title": "Developmental Psychology",
  "unit": "4",
  "description": "This course provides a comprehensive overview of the field of developmental psychology, including topics in cognitive, language, and social development.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 102",
  "title": "Sensory Neuroscience",
  "unit": "4",
  "description": "This course provides a comprehensive overview of the neural mechanisms that support vision, audition, touch, olfaction, and taste.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 104",
  "title": "Social Psychology",
  "unit": "4",
  "description": "This course provides a comprehensive overview of the field of social psychology, covering a review of the field's founding principles, classic findings, and a survey of recent findings. Topics will include social perception, attributions and attitudes, stereotypies, social influence, group dynamics, and aggressive and prosocial tendencies.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 105",
  "title": "Cognitive Psychology",
  "unit": "4",
  "description": "This course provides a comprehensive overview of cognitive psychology, the scientific study of mental processes: how people acquire, store, transform, use, and communicate information. Topics may include perception, attention, language, memory, reasoning, problem solving, decision-making, and creativity.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 106",
  "title": "Behavioral Neuroscience",
  "unit": "4",
  "description": "This course provides a comprehensive overview of human and animal behavior from a neuroscience perspective. Topics include the functions and mechanisms of perception, motivation (sex, sleep, hunger, emotions), learning and memory, and motor control and movement.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 108",
  "title": "Cognitive Neuroscience",
  "unit": "4",
  "description": "This course provides a comprehensive overview of neuroanatomy and major methods and results from neuroimaging and neuropsychological studies of behavior. Topics include attention, motor control, executive function, memory, learning, emotion, and language.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 110",
  "title": "Juniors Honors Research Seminars",
  "unit": "4",
  "description": "This course provides research seminars by a range of departmental faculty, exposing students to contemporary research problems in many areas of psychology. Class discussions will follow faculty presentations. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "upper-division standing. Admission by application. Department approval."
 },
 {
  "code": "PSYC 111A",
  "title": "Research Methods I",
  "unit": "6",
  "description": "This course provides training in applying advanced statistical methods to experimental design. Emphasis will be placed on the developing skills in statistical problem-solving, using computer applications, and writing scientific reports. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "upper-division standing. Open to honors students or by consent of instructor. Instructor and department approval."
 },
 {
  "code": "PSYC 111B",
  "title": "Research Methods II",
  "unit": "6",
  "description": "This course builds upon the material of PSYC 111A. Students will participate in data collection, data organization, statistical analysis and graphical analysis, with emphasis placed on developing scientific report writing, presentations, and critical thinking about experimental methods. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "PSYC 111A; upper-division standing. Instructor and department approval."
 },
 {
  "code": "PSYC 113",
  "title": "Electroencephalogram (EEG) Lab",
  "unit": "4",
  "description": "This course provides training in the design, execution, and analysis of electroencephalogram (EEG) experiments to study perception and cognition. The course will provide basic background on the EEG methodology: what and how neural signals are measured with EEG, how to interpret them, and how to design experiments. It will also provide hands-on training on conducting an EEG study: we will design and run experiments together in the laboratory, analyze the data, and discuss the results.",
  "prerequisite": "PSYC 60 or COGS 14B, and PSYC 70 or COGS 14A, and COGS 101A or COGS 107A or COGS 107B or COGS 107C or PSYC 102 or PSYC 106 or PSYC 108. Department approval."
 },
 {
  "code": "PSYC 114",
  "title": "Psychophysiological Perspectives on the Social Mind Laboratory",
  "unit": "4",
  "description": "This course provides an overview and training in the use of psychophysiological methods to investigate the cognitive and emotional process involved in understanding and reacting to other people. Students will develop individual research questions and actively participate in designing and conducting the experiments.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 115A",
  "title": "Laboratory in Cognitive Psychology I",
  "unit": "4",
  "description": "This course provides training in the design, execution, and analysis of cognitive psychology experiments. Students may not receive credit for both PSYC 115 and PSYC 115A.",
  "prerequisite": "upper-division standing and PSYC 60 or equivalent; an interview with the instructor is required."
 },
 {
  "code": "PSYC 115B",
  "title": "Laboratory in Cognitive Psychology II",
  "unit": "4",
  "description": "This course is designed to extend the training of PSYC 115A in the design, execution, and analysis of cognitive psychology experiments. Students may not receive credit for both PSYC 115 and PSYC 115B.",
  "prerequisite": "upper- division standing and PSYC 115A. Instructor and department approval."
 },
 {
  "code": "PSYC 116",
  "title": "Laboratory in Clinical Psychology Research",
  "unit": "2, 4",
  "description": "This course provides examination of theory, research design, and methods for clinical research. Students complete an internship at a clinical research lab, culminating in a paper. May be taken for credit three times for a total of eight units. Students may not receive credit for both PSYC 116 and PSYC 107.",
  "prerequisite": "upper-division standing. Instructor approval. _**Corequisites:** ****_PSYC 199."
 },
 {
  "code": "PSYC 117",
  "title": "Laboratory in Educational Research and Outreach",
  "unit": "4",
  "description": "This course provides experience conducting educational research and outreach for children in greater San Diego County. May be taken for credit three times.",
  "prerequisite": "upper-division standing. Instructor approval."
 },
 {
  "code": "PSYC 118",
  "title": "Laboratory in Animal Behavior",
  "unit": "4",
  "description": "This course provides an opportunity to learn about the various evolutionary forces that shape a species' natural behavioral repertoire while also conducting research related to these issues. Classroom lectures on topics related to ethology will be complemented by a research project in which students collect observational data on animal behavior.",
  "prerequisite": "upper-division standing and department approval."
 },
 {
  "code": "PSYC 120",
  "title": "Learning and Motivation",
  "unit": "4",
  "description": "This course provides a survey of research and theory in learning and motivation. Topics include instincts, reinforcement, stimulus control, choice, and human application.",
  "prerequisite": "upper-division standing. Must be taken concurrently with PSYC 121 or PSYC 140."
 },
 {
  "code": "PSYC 121",
  "title": "Laboratory in Operant Psychology",
  "unit": "4",
  "description": "This course provides laboratory experience in operant psychology.",
  "prerequisite": "upper-division standing. May be taken concurrently with PSYC 120."
 },
 {
  "code": "PSYC 122",
  "title": "Mechanisms of Animal Behavior",
  "unit": "4",
  "description": "This course focuses on approaches to the study of behavior and its underlying fundamental units of analysis in human and nonhuman animals. Students may not receive credit for both PSYC 122 and PSYC 103.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 123",
  "title": "Cognitive Control and Frontal Lobe Function",
  "unit": "4",
  "description": "This course provides an understanding of how the frontal lobes allow us to engage in complex mental processes. Topics may include anatomy and theory of prefrontal function, frontal lobe clinical syndromes, pharmacology and genetics, emotion control, and cognitive training.",
  "prerequisite": "upper- division standing. Instructor and department approval."
 },
 {
  "code": "PSYC 124",
  "title": "Clinical Assessment and Treatment",
  "unit": "4",
  "description": "This course provides an introduction to the history, purpose, and recent changes to the _Diagnostic and Statistical Manual of Mental Disorders_ along with appropriate evidence-based interventions. Other topics include psychiatric emergencies, crisis management, and ethics. Recommended preparation: Completion of PSYC 100.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 125",
  "title": "Clinical Neuropsychology",
  "unit": "4",
  "description": "This course provides a fundamental understanding of brain-behavior relationships as applied to the practice of clinical neuropsychology. Major topics include functional neuroanatomy, principles of neuropsychological assessment and diagnosis, and the neuropsychological presentation of common neurologic and psychiatric conditions.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 126",
  "title": "Practicum in Community Mental Health Care",
  "unit": "4",
  "description": "This course provides experience with clients in a community mental health care setting, under professional supervision. Seminar-based instruction also provides a framework for understanding theoretical, practical, and ethical issues related to client care.",
  "prerequisite": "PSYC 100 and PSYC 124 and department approval."
 },
 {
  "code": "PSYC 128",
  "title": "Psychology of Reading",
  "unit": "4",
  "description": "This course provides basic information about the nature of reading. Topics include word recognition, eye movements, inner speech, sentence processing, memory for text, learning to read, methods for teaching reading, reading disabilities and dyslexia, and speed-reading. Recommended preparation: completion of PSYC 105 or PSYC 145.",
  "prerequisite": "upper **-** division standing."
 },
 {
  "code": "PSYC 129",
  "title": "Logic of Perception",
  "unit": "4",
  "description": "This course provides an overview of how we perceive the world. Topics include classic studies in perception, discussion of the view that perception is “logical,” and new insights into the neural mechanisms underlying perception.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 130",
  "title": "Delay of Gratification",
  "unit": "4",
  "description": "This course provides a review of research on delay of gratification. Topics include what makes it so tough, in what situations it is possible, who can do it, and the implications of this ability.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 131",
  "title": "Scientific Racism: Genetics, Intelligence, and Race",
  "unit": "4",
  "description": "This course provides a background into the origins and implementation of scientific racism, especially since the nineteenth century. Topics may include race/ethnicity and genetics, intelligence, nationalism, criminality, human performance, and morphometry.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 132",
  "title": "Hormones and Behavior",
  "unit": "4",
  "description": "This course examines how hormones influence a variety of behaviors and how behavior reciprocally influences hormones. Specific topics covered include aggression, sex and sexuality, feeding, learning, memory, mood and neural mechanisms both in humans and nonhuman animals. Recommended preparation: completion of PSYC 106.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 133",
  "title": "Circadian Rhythms—Biological Clocks",
  "unit": "4",
  "description": "This interdisciplinary course provides an overview of the fundamental properties of daily biological clocks of diverse species, from humans to microbes. Emphasis is placed on the relevance of internal time keeping in wide-ranging contexts including human performance, health, and industry. Cross-listed with BIMM 116.",
  "prerequisite": "upper-division standing. PSYC 106 or BILD 1 or PSYC 2 or consent of instructor."
 },
 {
  "code": "PSYC 134",
  "title": "Eating Disorders",
  "unit": "4",
  "description": "This course provides an overview of the biology and psychology of eating disorders such as anorexia nervosa, bulimia nervosa, and binge eating disorder. Abnormal, as well as normal, eating will be discussed from various perspectives including endocrinological, neurobiological, psychological, sociological, and evolutionary.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 136",
  "title": "Cognitive Development",
  "unit": "4",
  "description": "This course provides an overview of how children’s thinking develops. Topics may include perception, concept formation, memory, problem solving, and social cognition.",
  "prerequisite": "upper-division standing; PSYC 101 or PSYC 105."
 },
 {
  "code": "PSYC 137",
  "title": "Social Cognition",
  "unit": "4",
  "description": "This course provides an overview of social cognition, which blends cognitive and social psychology to understand how people make sense of the social world. Topics may include social perception, inference, memory, motivation, affect, understanding the self, stereotypes, and cultural cognition.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 138",
  "title": "Sound and Music Perception",
  "unit": "4",
  "description": "This course provides an overview of auditory perception. Topics may include the physiology of the auditory system, perception of pitch, loudness, and timbre, sound localization, perception of melodic and temporal patterns and musical illusions and paradoxes. Recommended preparation: ability to read musical notation.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 139",
  "title": "The Social Psychology of Sport",
  "unit": "4",
  "description": "This course provides an introduction to the applications of social psychological principles and findings to sports. Topics include motivation, level of aspiration, competition, cooperation, social comparison, and optimal arousal. Additional topics may include the perspective of spectators, discussing motivation and perceptions of success, streaks, and such.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 140",
  "title": "Human Behavior Laboratory",
  "unit": "4",
  "description": "This course provides training in applying the principles of human behavior, including choice behavior, self-control, and reasoning.",
  "prerequisite": "upper-division standing. Must be taken concurrently with PSYC 120."
 },
 {
  "code": "PSYC 141",
  "title": "Evolution and Human Nature",
  "unit": "4",
  "description": "This course provides insight into the question of whether important aspects of human behavior can be explained as resulting from natural selection. Topics include sex differences, selfishness and altruism, homicide and violence, and context effects of human reasoning.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 142",
  "title": "Psychology of Consciousness",
  "unit": "4",
  "description": "This course provides a survey of research on consciousness from an experimental psychology perspective. Special emphasis will be placed on cognitive, neuroimaging, and clinical/psychiatric investigative techniques, and on the scientific assessment of the mind-body problem.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 143",
  "title": "Control and Analysis of Human Behavior",
  "unit": "4",
  "description": "This course provides an overview of the behavioral approach, including basic principles, self-control, clinical applications, and the design of cultures.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 144",
  "title": "Memory and Amnesia",
  "unit": "4",
  "description": "This course will provide a survey of current research and theory concerning human memory and amnesia from both cognitive and neuropsychological perspectives. Topics may include short-term (working) memory, encoding and retrieval, episodic and semantic memory, interference and forgetting, false memory, eyewitness memory, emotion and memory, famous case studies of amnesia, and the effects of aging and dementia on memory.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 145",
  "title": "Psychology of Language",
  "unit": "4",
  "description": "This course provides an overview of language comprehension and production. Topics include animal communication, language development, and language disorders. Recommended preparation: completion of a course in language, cognition, or philosophy of the mind.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 146",
  "title": "Language and Conceptual Development",
  "unit": "4",
  "description": "This course provides an introduction to research on language acquisition and its relationship to conceptual development. Topics include theoretical foundations (e.g., learning mechanisms, theories of concepts) and empirical case studies, including word learning, syntax and semantics, and language and thought. Recommended preparation: completion of a course in language/linguistics, cognition, or cognitive development.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 147",
  "title": "Gender",
  "unit": "4",
  "description": "This course provides an overview of the role of gender in psychology, with an emphasis on critical thinking about gender. Topics may include gender differences in behavior and communication, influences on gender roles, gender identity, and gender effects on health and well-being.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 148",
  "title": "Psychology of Judgment and Decision",
  "unit": "4",
  "description": "This course provides an overview of judgment and decision making, which is broadly concerned with preferences, subjective probability, and how they are combined to arrive at decisions. History and current topics will be covered.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 150",
  "title": "Cognitive Neuroscience of Vision",
  "unit": "4",
  "description": "This course provides an overview of the neural basis of visual experience, or how our brain creates what we see in the world around us.",
  "prerequisite": "upper-division standing; PSYC 102 or PSYC 108."
 },
 {
  "code": "PSYC 151",
  "title": "Tests and Measurement",
  "unit": "4",
  "description": "This course provides an introduction to psychology testing. Topics include psychometrics and statistical methods of test construction; application of psychological tests in industry, clinical practice, and applied settings; and controversies in the application of psychological tests.",
  "prerequisite": "upper-division standing; PSYC 60."
 },
 {
  "code": "PSYC 152",
  "title": "Conceptions of Intelligence",
  "unit": "4",
  "description": "This course provides an overview of the concept of intelligence from multiple perspectives. Topics include how intelligence is measured and the role of this measurement on practical matters, the role of intelligence in comparative psychology, and attempts to analyze intelligence in terms of more fundamental cognitive processes.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 153",
  "title": "Psychology of Emotion",
  "unit": "4",
  "description": "This course provides an overview of past and current theories of emotion. Topics include facial expressions associated with emotion, psychophysiology, evolutionary perspectives, and specific emotions such as anger, fear, and jealousy.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 154",
  "title": "Behavior Modification",
  "unit": "4",
  "description": "The course provides an extension of learning principles to human behavior. Topics include broad implications of a behavioral perspective, applied behavior analysis, and applications of behavioral principles to clinical disorders and to normal behavior in varied settings.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 155",
  "title": "Social Psychology and Medicine",
  "unit": "4",
  "description": "This course provides an exploration of health, illness, treatment, and delivery of treatment as they relate to psychological concepts and research and considers how the social psychological perspective might be extended into medical fields.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 156",
  "title": "Cognitive Development in Infancy",
  "unit": "4",
  "description": "This course provides an overview of infant development. Students will critically evaluate scientific theories regarding infant cognitive, linguistic, and social behavior. Recommended preparation: PSYC 60.",
  "prerequisite": "upper-division standing; PSYC 101 or HDP 1."
 },
 {
  "code": "PSYC 157",
  "title": "Happiness",
  "unit": "4",
  "description": "This course provides an overview of the psychology of happiness. Topics may include such questions as: What is happiness? How do we measure it, and how do we tell who has it? What is the biology of happiness and what is its evolutionary significance? What makes people happy—youth, fortune, marriage, chocolate? Is the pursuit of happiness pointless?",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 158",
  "title": "Interpersonal Relationships",
  "unit": "4",
  "description": "This course provides an examination of theories and empirical work pertaining to interpersonal relationships. Topics include attraction, jealousy, attachments, and love.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 159",
  "title": "Physiological Basis of Perception",
  "unit": "4",
  "description": "This course provides a survey of sensory and perceptual phenomena with an emphasis on their underlying physiological mechanisms.",
  "prerequisite": "upper-division standing; PSYC 102."
 },
 {
  "code": "PSYC 161",
  "title": "Engineering Psychology",
  "unit": "4",
  "description": "This course provides a survey of psychological findings relevant to designing “user-friendly” computers and devices and improving aviation and traffic safety. Topics include human perception as it pertains to displays and image compression, human memory limitations relevant to usability, and nature of human errors.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 162",
  "title": "Psychology and the Law",
  "unit": "4",
  "description": "This course provides an overview of the intersection between psychology and the legal system, covering a broad range of forensically relevant issues. Topics may include false memories, false confessions, eyewitness reliability, lie detection, DNA exonerations of the wrongfully convicted, jury decision making, and neuroscience and the law Recommended preparation: PSYC 60.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 164",
  "title": "Criminology",
  "unit": "4",
  "description": "This course provides an overview of the scientific study of law making and societal reaction to law breaking activity. Topics include major theories accounting for criminal behavior, the relationship between drugs and crime, the effects of penalties on recidivism, and the psychological effects of incarceration.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 166",
  "title": "History of Psychology",
  "unit": "4",
  "description": "This course provides a survey of the major trends and figures in the development of psychology as a field. Topics may include the mind-body problem, nativism vs. empiricism, and the genesis of behaviorism.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 167",
  "title": "Science of Imagination",
  "unit": "4",
  "description": "This seminar explores how psychologists think about and study the imagination—the capacity to mentally transcend time, place, and circumstance to think about what might have been, plan and anticipate the future, create and become absorbed in fictional worlds, and consider alternatives to actual experiences. You will learn how to evaluate psychological evidence, and how to read, interpret, discuss, present, and write about scientific literature. PC25, PC26, PS28, PC29, PC30, PC31, PC32, PC33, PC34, PC35, HD01, HD02, HD25, HD26, or CG32 major only.",
  "prerequisite": null
 },
 {
  "code": "PSYC 168",
  "title": "Psychological Disorders of Childhood",
  "unit": "4",
  "description": "This course provides an overview of psychological disorders in children. Topics may include anxiety disorders, depressive and bipolar disorders, communication and learning disorders, conduct problems, autism, and other conditions. Emphasis is placed on symptomatology, assessment, etiological factors, epidemiology, and treatment.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 169",
  "title": "Brain Damage and Mental Function",
  "unit": "4",
  "description": "This course provides an introduction to the neural mechanisms underlying perception, memory, language, and other mental capacities. Topics include how brain damage affects these capacities and how patients with brain lesions can contribute to our understanding of the normal brain.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 170",
  "title": "Cognitive Neuropsychology",
  "unit": "4",
  "description": "This course provides a journey to the interface between neurophysiology and psychology. Topics include neuroimaging and neuroplasticity.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 171",
  "title": "Neurobiology of Learning and Memory",
  "unit": "4",
  "description": "This course provides an overview of the neurobiology of learning and memory, from cognitive to molecular neuroscience, including human, animal, cellular, and molecular studies of memory. Topics include amnesia, intellectual disability, exceptional intelligence, aging, and Alzheimer’s disease.",
  "prerequisite": "PSYC 2 or 106 or 181, upper-division standing."
 },
 {
  "code": "PSYC 172",
  "title": "Psychology of Human Sexuality",
  "unit": "4",
  "description": "This course provides an overview of human sexuality research including diversity of sexual behavior and identities, sex and gender development, intimate relationships, and sexual dysfunction. Recommended preparation: completion of PSYC 1, 2, or 106.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 173",
  "title": "Psychology of Food and Behavior",
  "unit": "4",
  "description": "This course provides an overview of the biological, psychological, and social influences on the psychology of food and behavior. Topics may include taste preferences and aversions and how they are learned, how culture influences food selection, and food-related behaviors across the lifespan.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 174",
  "title": "Visual Cognition",
  "unit": "4",
  "description": "This course provides an overview of high-level visual perception, and of how visual perception intersects with attention, memory, and concepts. Topics may include an introduction to the visual system with an emphasis on high-level visual regions; object recognition, face recognition, scene recognition and reading; visual attention, including eye movements during scene perception and during reading; and visual working memory.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 175",
  "title": "Science of Mindfulness",
  "unit": "4",
  "description": "This course provides a review of the scientific research surrounding the topic of Mindfulness, which has been approached from multiple disciplines including Buddhism, Positive Psychology, Cognitive Behavioral Therapy, and Neuroscience. Because Mindfulness is so multi-faceted, with many variables involved, the scientific study of Mindfulness requires rigorous research methods and statistics, and for this reason, a significant portion of the class focuses on these aspects.",
  "prerequisite": "upper-division standing, COGS 14B or MATH 11 or PSYC 60, and COGS 14A or PSYC 70. Department approval."
 },
 {
  "code": "PSYC 176",
  "title": "Creativity",
  "unit": "4",
  "description": "This course provides an overview of how to foster creativity in individuals, groups, and organizations. Themes that cut across all three levels are highlighted.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 178",
  "title": "Industrial Organizational Psychology",
  "unit": "4",
  "description": "This course provides an examination of human behavior in industrial, business, and organizational settings. Topics include psychological principles applied to selection, placement, management, and training; the effectiveness of individuals and groups within organizations, including leadership and control; conflict and cooperation; motivation; and organizational structure and design.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 179",
  "title": "Drugs, Addiction, and Mental Disorders",
  "unit": "4",
  "description": "This course provides an overview of the use, abuse, liability, and psychotherapeutic effects of drugs on humans.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 180",
  "title": "Adolescence",
  "unit": "4",
  "description": "This course provides an overview of the period of human adolescence, including the physical, cognitive, social, and emotional changes that take place during this developmental transition.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 181",
  "title": "Psychopharmacology—Drugs and Behavior",
  "unit": "4",
  "description": "This course provides an overview of basic principles of psychopharmacology, including psychological effects, brain mode of action, and patterns of use of psychoactive agents. Drugs discussed may include drugs of abuse and psychotherapeutics such as stimulants, opioids, sedative hypnotics, hallucinogens, marijuana, alcohol, cognitive enhancers, anxiolytics, antidepressants, and antipsychotics.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 182",
  "title": "Illusions and the Brain",
  "unit": "4",
  "description": "This course provides an examination of visual, auditory, and tactile illusions and examines how they arise from interactions between perceptual and cognitive systems.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 184",
  "title": "Choice and Self-Control",
  "unit": "4",
  "description": "This course provides an overview of the experimental analysis of choice behavior, with an emphasis on the types of choice involved in self-control. A central interest will be the conditions under which decision-making is optimal.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 185",
  "title": "Psychology of Climate Crisis",
  "unit": "4",
  "description": "This course provides tools for the student to think about the escalating climate crisis. Urgent action is needed at a large, societal scale to prevent the worst consequences of anthropogenic global heating. Better understanding the prospects for such action can come from human psychology. How do people arrive at their beliefs? What is the basis of denial and delay? How does belief flow to action? What kinds of actions can people take?",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 186",
  "title": "Evolutionary Psychology",
  "unit": "4",
  "description": "This course provides an overview of the forces that shaped the human brain and behavior over our evolutionary history. The first part of the course will provide the key background on evolutionary principles and human natural history. The second part of the course will delve into the origins of defining characteristics of human cognition, such as language and theory of mind, by drawing on our understanding of both human evolution and comparisons with our living nonhuman primate relatives.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 187",
  "title": "Development of Social Cognition",
  "unit": "4",
  "description": "This course provides an overview of how children learn to reason about the social world. Topics may include theory of mind, social categorization and stereotyping, moral reasoning, and cultural learning. Recommended preparation: PSYC 101.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 188",
  "title": "Impulse Control Disorders",
  "unit": "4",
  "description": "This course provides an overview of problems of impulse control, which are important features of major psychiatric disorders and also of atypical patterns of behavior including pathological gambling, compulsive sex, eating, exercise, and shopping. Topics include development, major common features, treatment, and neurobiological basis of impulse control disorders.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 189",
  "title": "Brain, Behavior, and Evolution",
  "unit": "4",
  "description": "This course provides a survey of natural behaviors, including birdsong, prey capture, localization, electroreception and echolocation, and the neural system that controls them, emphasizing broad fundamental relationships between brain and behavior across species. Cross-listed with BIPN 189. Students may not receive credit for PSYC 189 and BIPN 189.",
  "prerequisite": "upper- division standing, BILD 2 or PSYC 102 or PSYC 106."
 },
 {
  "code": "PSYC 190",
  "title": "Science of Parenting",
  "unit": "4",
  "description": "This course provides an interdisciplinary overview of theories and scientific research on parenting. This course takes a critical approach to the scientific evidence regarding the role of parents in child development. Topics may include media reporting of science, behavior genetics, diet, sleep, the nature of learning, screen time, impulse control, family structure, parenting styles, attachment, discipline strategies, and vaccination.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "PSYC 191",
  "title": "Psychology of Sleep",
  "unit": "4",
  "description": "This course provides an overview of the psychology of sleep, including sleep stages and their functions, neurological aspects of sleep, sleep across species and development, dreams and their interpretation, sleep disorders, and the role of sleep in learning and memory.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 192",
  "title": "Senior Seminar in Psychology",
  "unit": "1",
  "description": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small setting to explore an intellectual topic in psychology (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequisite": "department stamp and/or consent of instructor."
 },
 {
  "code": "PSYC 193",
  "title": "Topics in Psychology",
  "unit": "4",
  "description": "Selected topics in the field of psychology. May be taken for credit three times as topics vary.",
  "prerequisite": "upper-division standing and department approval."
 },
 {
  "code": "PSYC 193L",
  "title": "Psychology Laboratory Topics",
  "unit": "4",
  "description": "Selected laboratory topics in the field of psychology. May be taken for credit two times as topics vary.",
  "prerequisite": "upper-division standing and department approval."
 },
 {
  "code": "PSYC 194A",
  "title": "Honors Thesis I",
  "unit": "4",
  "description": "This course provides the opportunity for students to plan and carry out a research project under the guidance of the psychology faculty. Students will write a proposal for the research that they plan to conduct in 194B-C and will present this proposal to the class. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "PSYC 110, PSYC 111A-B, department approval, psychology majors only, acceptance to the Honors Program._ __"
 },
 {
  "code": "PSYC 194B",
  "title": "Honors Thesis II",
  "unit": "4",
  "description": "This course provides the opportunity for students to continue to carry out their research projects. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "PSYC 194A, department approval, psychology majors only, acceptance to the Honors program."
 },
 {
  "code": "PSYC 194C",
  "title": "Honors Thesis III",
  "unit": "4",
  "description": "This course provides the opportunity for students to complete their research, write their honors thesis, and present their results at the Honors Poster Session. Must be taken for a letter grade for the Psychology Honors Program.",
  "prerequisite": "PSYC 194B, department approval, psychology majors only, acceptance to the Honors program."
 },
 {
  "code": "PSYC 195",
  "title": "Instruction in Psychology",
  "unit": "1 or 4",
  "description": "Introduction to teaching a psychology course. As an undergraduate instructional apprentice, students will attend the lectures of the course, hold weekly meetings with students of the course, hold weekly meetings with course instructor. Responsibilities may include class presentations, designing and leading weekly discussion sections, assisting with homework and exam grading, and monitoring and responding to online discussion posts. P/NP grades only. May be taken for credit two times. Only four units can be applied toward the psychology minor or major as upper-division psychology elective credit.",
  "prerequisite": "eligibility includes all of the following: upper-division standing, a minimum of A- in the course in which the student plans to assist, a 3.0 cumulative UC GPA, instructor and department approval."
 },
 {
  "code": "PSYC 196A-B-C",
  "title": "Research Seminar",
  "unit": "4-4-4",
  "description": "Weekly research seminar, three quarter research project under faculty guidance which culminates in a thesis. Must be taken for a letter grade to satisfy major requirements for Department of Psychology majors.",
  "prerequisite": "upper-division standing, instructor and department approval."
 },
 {
  "code": "PSYC 198",
  "title": "Directed Group Study in Psychology",
  "unit": "2 or 4",
  "description": "Group study under the direction of a faculty member in the Department of Psychology.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "PSYC 199",
  "title": "Independent Study",
  "unit": "2, 3, 4",
  "description": "Independent study or laboratory research under direction of faculty in the Department of Psychology. P/NP grades only. May be taken for credit nine times.",
  "prerequisite": "upper-division standing and department approval."
 },
 {
  "code": "PSYC 201A",
  "title": "Quantitative Methods in Psychology I",
  "unit": "6",
  "description": "The first part of a series of intensive courses in statistical methods and the mathematical treatment of data, with special reference to research in psychology.",
  "prerequisite": null
 },
 {
  "code": "PSYC 201B",
  "title": "Quantitative Methods in Psychology II",
  "unit": "6",
  "description": "The second part of a series of intensive courses in statistical methods and the mathematical treatment of data, with special reference to research in psychology.",
  "prerequisite": "PSYC 201A."
 },
 {
  "code": "PSYC 201C",
  "title": "Quantitative Methods in Psychology III",
  "unit": "6",
  "description": "The third part of a series of intensive courses in statistical methods and the mathematical treatment of data, with special reference to research in psychology.",
  "prerequisite": "PSYC 201B."
 },
 {
  "code": "PSYC 202",
  "title": "Writing and Presenting Academic Research Papers",
  "unit": "4",
  "description": "Instruction on organizing, writing, and presenting empirical research papers. Students will learn fundamentals of writing style, data presentation, and time management. This course is intended for psychology graduate students in service of preparation of their first-year papers and talks.",
  "prerequisite": "psychology graduate students (major code: PC76 or PC78 or PC79), or consent of instructor."
 },
 {
  "code": "PSYC 205",
  "title": "Emotion",
  "unit": "4",
  "description": "This seminar provides a selective overview of the scientific study of emotion. We will discuss various theoretical perspectives on emotion and will focus on specific topics such as emotion regulation, affect in social interactions, individual differences, and particular emotions (e.g., embarrassment, envy, and jealousy).",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 206",
  "title": "Mathematical Modeling",
  "unit": "4",
  "description": "This course is designed to teach the basics of mathematical modeling. Topics include when, why, and how to use signal detection theory (an essential theory for anyone interested in attention, perception, memory, or decision making), how to analyze reaction time distributions (instead of simply measuring mean RT), how to engage in the fine art of model comparison, and how to avoid creating models that are more complex than the data they seek to explain.",
  "prerequisite": null
 },
 {
  "code": "PSYC 209",
  "title": "Judgment and Decision Making",
  "unit": "4",
  "description": "This seminar examines issues in the psychology of judgment and decision making. Topics include the heuristics and biases approach, overconfidence, framing effects, intertemporal choice, and rationality.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 210",
  "title": "The Methods of Human Cognitive Neuroscience",
  "unit": "5",
  "description": "Covers many of the neuroscience methods available to study human cognition, with emphasis on concepts of data analysis, and comparative assessment of the different methods (along with alternative nonhuman animal approaches), with an eye to pitfalls and interpretational limitations.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 211",
  "title": "Proseminar in Computational Models of Mind",
  "unit": "5",
  "description": "Computational models of perception, cognition, behavior, and social interaction formalize psychological theories, and can offer insights into both how people solve challenging everyday problems and how to improve machine performance on these problems. We will consider formalisms for sensory processing, knowledge representation, learning, planning, and decisions, with an emphasis on modeling common problem structures such as statistical learning and probabilistic inference.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 212",
  "title": "Visual Science",
  "unit": "4",
  "description": "Each year a different topic in visual science is selected for in-depth review and discussion based on current readings.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 213",
  "title": "Professional Procedures and Survival in Psychology",
  "unit": "4",
  "description": "This course provides a forum for presentation and discussion of the basic issues associated with surviving in a professional (particularly, academic) psychology environment. It covers such issues as: 1) how to get a job, 2) how to keep a job, 3) general issues and ethics in professional survival. The course will include the presence of a number of the psychology faculty in topic specific areas (e.g., journal editors from our faculty, faculty sitting on grant review panels, etc.).",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 217",
  "title": "Proseminar in Developmental Psychology",
  "unit": "5",
  "description": "The course examines cognitive development through the school-age period and social and personality development from infancy through early adolescence. It begins with an examination of early neurological, sensory, motor, and perceptual functions and then focuses on issues in linguistic and cognitive development. The class will first discuss general developmental theory and methods and then topics such as attachment, temperament, self-concept, aggression, family relations, play, and peers. Students cannot get credit for PSYC 217 if they have already taken PSYC 217A or 217B.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 218",
  "title": "Proseminar in Cognitive Psychology",
  "unit": "5",
  "description": "A survey of basic principles and concepts of cognitive psychology. This course is intended to serve as the basic introduction for first-year students. Basic areas include knowledge, memory, thought, perception, and performance.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 220",
  "title": "Proseminar in Social Psychology",
  "unit": "5",
  "description": "An introduction to social psychology. Psychology and the law, health psychology, attitudes, emotions, person perception and aggression are some of the topics to be covered.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 221",
  "title": "Proseminar in Sensation and Perception",
  "unit": "5",
  "description": "Fundamentals of vision, audition, and other senses. Emphasis will be upon psychophysical approaches to the study of these sensory modalities, as well as some essential aspects of their neurophysiological bases.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 222",
  "title": "Proseminar in Biological Psychology",
  "unit": "5",
  "description": "A survey of the functional neuroanatomical, neurodevelopmental, neurophysiological, and pharmacological correlates of psychological phenomena.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 223",
  "title": "Current Directions in Vision",
  "unit": "1",
  "description": "An in-depth analysis of empirical and theoretical issues in a specialized area of vision or visual perception. Emphasis most likely will be on a topic of ongoing vision research at UC San Diego. S/U grades only. May be taken for credit eighteen times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 224",
  "title": "Current Directions in Cognitive Neural Systems (CNS)",
  "unit": "1",
  "description": "A weekly seminar series focused on understanding recent advances in the relationship between neural systems and behavior using a variety of experimental approaches (single unit recording, comp neuro, evolutionary bio, psychophysics, comparative anatomy, lesion work, psychopharm, fMRI, EEG, TMS, etc.). May be taken for credit twenty-four times.",
  "prerequisite": "graduate standing. S/U grades only."
 },
 {
  "code": "PSYC 229",
  "title": "Happiness",
  "unit": "4",
  "description": "This course will address the psychology of happiness. The discussions and readings, consisting largely of original research articles, will explore such questions as: What is happiness? How do we measure it, and how do we tell who has it? What is the biology of happiness and what is its evolutionary significance? What makes people happy—youth, fortune, marriage, chocolate? Is the pursuit of happiness pointless?",
  "prerequisite": null
 },
 {
  "code": "PSYC 231",
  "title": "Tools for Experimental Analysis",
  "unit": "4",
  "description": "This course will cover a set of general data analysis methods that are broadly applicable in many different subdisciplines of psychology/neuroscience. Topics include model fitting, information theory, Fourier analysis, and machine learning. Recommended preparation: Matlab, C, Java, R, or any related language. Students may only receive credit for one of the following: PSYC 231, NEUG 231, NEU 231.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 232",
  "title": "Probabilistic Models of Cognition",
  "unit": "4",
  "description": "Computational theories of human cognition, particularly Bayesian approaches. Techniques may include directed graphical models; hierarchical models; nonparametric models; probabilistic programming languages. Topics may include decision-making; perception; causal reasoning; categorization; language. Cross-listed with LIGN 228. Recommended preparation: Previous experience with statistics, machine learning, and/or functional programming helpful.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 233",
  "title": "Learning and Motivation",
  "unit": "4",
  "description": "Advanced topics in learning and motivation, with special emphasis on current research. May be taken for credit eighteen times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 234",
  "title": "Evolution of Language",
  "unit": "4",
  "description": "This seminar will explore issues related to the evolution of human language, and critically evaluate evidence for the diversity of theories about the topic. Discussions will include the comparative communication and cognition, manual communication, factors surrounding the initial emergence of language, among others.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 235",
  "title": "Thought and Language",
  "unit": "4",
  "description": "This course will explore the nature of human thought and its relationship to language taking a primarily developmental approach but drawing on contributions from the philosophy of mind and language, linguistics, and anthropology. Each year a different case study will be explored. Past case studies have included concepts, theory of mind, counting, and the logic of thought. Cross-listed with LIGN 232.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 236",
  "title": "Substance Abuse",
  "unit": "4",
  "description": "Theory and research on the development, progression, and resolution of substance use and abuse will be reviewed and evaluated. Normal and abnormal patterns of substance involvement will be contrasted across the life span.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 237",
  "title": "Human Rationality",
  "unit": "4",
  "description": "The traditional view of rationality is based upon abstract, content- independent rules for behavior. People sometimes violate these rules in a laboratory setting, but the violations are often systematic and appear to reflect adaptation to the environment outside the laboratory. Such findings raise questions about what it means to be rational. Readings will be empirically oriented and cover the areas of deductive reasoning, inductive reasoning, and choice.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 240",
  "title": "The Primate Brain",
  "unit": "4",
  "description": "This course will explore the neural basis of perception, action and cognition in primate cortex. Drawing on recent findings in neuroscience, we will discuss the role of cortex in a range of topics including decision making, object perception and recognition, memory and communication.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 241",
  "title": "Programming Web-Based Experiments for Psychology Research",
  "unit": "4",
  "description": "This hands-on programming course focuses on the design, implementation, and analysis of online experiments, particularly using Amazon’s Mechanical Turk. Topics include experimental design and counterbalancing, stimulus presentation and timing, response collection using the mouse and keyboard, and debugging experiments written in JavaScript and HTML/CSS. Course work will include individual projects. Recommended preparation: Graduate students who have not programmed at all should speak with the professor beforehand.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 242",
  "title": "Current Directions in Developmental Psychology",
  "unit": "1",
  "description": "Advanced seminar concentrating on methods of research and current experimental literature in developmental psychology. May be taken for credit twenty-four times. S/U grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 243",
  "title": "Sound and Music Perception",
  "unit": "4",
  "description": "This course deals with perception of sound, particularly music, and focuses on unusual aspects of music perception, including musical illusions and absolute pitch. Relationships between music and language will be explored, and there will be discussions concerning the evolutionary origins of these two forms of communication.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 244",
  "title": "Special Topics in Psycholinguistics",
  "unit": "4",
  "description": "Discussion of theories and experiments investigating language production, comprehension, or acquisition.",
  "prerequisite": null
 },
 {
  "code": "PSYC 246",
  "title": "Emotion and Cognition",
  "unit": "4",
  "description": "This seminar focuses on the interplay between emotion and cognition. We will consider how emotion influences perception, reasoning, memory, and judgment, and how cognitive processes can have emotional consequences. We will also discuss physiological and neural underpinnings of affective influence and debate more general issues such as emotion and rationality.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 247",
  "title": "Learning by Thinking in Children (and Adults)",
  "unit": "4",
  "description": "We often learn through observations or from testimony from others. Occasionally, we learn simply by thinking. How do we generate insights in the absence of new information from the external world? This course examines the cognitive capacities involved in learning by thinking, including thought experiments, deduction, analogy, imagination, and learning by explaining. This discussion-based seminar will take a cognitive science approach, emphasizing cognitive development.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 249A",
  "title": "Advanced Topics in Applied Behavior Analysis I",
  "unit": "1",
  "description": "Research and discussion on selected topics in applied behavior analysis. May be taken for credit five times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 249B",
  "title": "Advanced Topics in Applied Behavior Analysis II",
  "unit": "1",
  "description": "Research and discussion on selected topics in applied behavior analysis. May be taken for credit five times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 249C",
  "title": "Advanced Topics in Applied Behavior Analysis III",
  "unit": "1",
  "description": "Research and discussion on selected topics in applied behavior analysis. May be taken for credit five times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 251",
  "title": "Advanced Topics in Learning and Motivation",
  "unit": "1",
  "description": "Weekly meetings for graduate students actively engaged in research on conditioning. May be taken for credit multiple times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 252",
  "title": "Cognitive Neuroscience",
  "unit": "4",
  "description": "This is a series of weekly seminars on current trends in neuropsychology. The seminars will deal with the concept of “localization” of function in different parts of the brain and the effects of damage to these parts on cognitive functions such as perception, memory and language. Active student participation will be encouraged in preparing these seminars.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 255A",
  "title": "Advanced Topics in Biological Psychology I",
  "unit": "1",
  "description": "Research and discussion on selected topics in biological psychology. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 255B",
  "title": "Advanced Topics in Biological Psychology II",
  "unit": "1",
  "description": "Research and discussion on selected topics in biological psychology. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 255C",
  "title": "Advanced Topics in Biological Psychology III",
  "unit": "1",
  "description": "Research and discussion on selected topics in biological psychology. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 257",
  "title": "Development and Neurobiology of Theory of Mind",
  "unit": "4",
  "description": "Surveys research on people's everyday attribution of mental states to predict/explain actions, their naïve theory of mind, from developmental and neurocognitive perspectives. Topics include social cognition in infancy and childhood, in autism, and in nonhuman primates, and the brain underpinnings.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 258",
  "title": "Delay of Gratification",
  "unit": "4",
  "description": "This course will review the research on delay of gratification. We will cover what makes it in general so tough, what situations make it possible, who can do it, and what the implications of this ability are. We will draw from research in social, personality, and animal psychology as well as economics.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 260",
  "title": "Language and Conceptual Development",
  "unit": "4",
  "description": "This class will investigate case studies in conceptual development that interact with language acquisition, including domains such as time, space, number, and theory of mind. The approach of the class will be to explore the chosen case study from the perspective of philosophy, linguistics, psychology, anthropology, and comparative psychology, with a particular focus on how conceptual development is affected by the acquisition of language. Cross- listed with LIGN 283.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 263",
  "title": "Science of Mindfulness",
  "unit": "4",
  "description": "This graduate seminar addresses the science behind mindfulness. Topics include the effects of mindfulness practice on neural processing, psychological well- being, and prosocial behavior. A particular emphasis will be placed on the implications of mindfulness practices/effects on society and education.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 264A",
  "title": "Advanced Topics in Language Processes I",
  "unit": "1",
  "description": "Research and discussion on selected topics in language processes. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 264B",
  "title": "Advanced Topics in Language Processes II",
  "unit": "1",
  "description": "Research and discussion on selected topics in language processes. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 264C",
  "title": "Advanced Topics in Language Processes III",
  "unit": "1",
  "description": "Research and discussion on selected topics in language processes. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 265",
  "title": "Social Psychology and Medicine",
  "unit": "4",
  "description": "Concentrates on what psychology has to contribute to the understanding of illness, its treatment, and the social context in which these processes occur. Topics: psychological factors in the etiology and treatment of illness, doctor-patient roles, and communication.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 266",
  "title": "Psychology of Reading",
  "unit": "4",
  "description": "This seminar will cover aspects of reading, emphasizing cognitive processes involved in skilled reading. However, learning to read and methods to teach reading will also be discussed. Other topics include eye movements and reading, word recognition, inner speech, context effects, discourse processing, sentence parsing, and dyslexia.",
  "prerequisite": null
 },
 {
  "code": "PSYC 267A",
  "title": "Advanced Topics in Behavior Medicine I",
  "unit": "1",
  "description": "Research and discussion on selected topics in behavior medicine. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 267B",
  "title": "Advanced Topics in Behavior Medicine II",
  "unit": "1",
  "description": "Research and discussion on selected topics in behavior medicine. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 267C",
  "title": "Advanced Topics in Behavior Medicine III",
  "unit": "1",
  "description": "Research and discussion on selected topics in behavior medicine. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 268",
  "title": "Neurobiology of Action",
  "unit": "4",
  "description": "This seminar provides an overview of the past and current research on the neurobiology of actions in normal and diseased states such as addiction, Parkinson's, and other psychiatric disorders.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 269A",
  "title": "Advanced Topics in Sound and Music Perception I",
  "unit": "1",
  "description": "Research and discussion on selected topics in sound and music perception. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 269B",
  "title": "Advanced Topics in Sound and Music Perception II",
  "unit": "1",
  "description": "Research and discussion on selected topics in sound and music perception. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 269C",
  "title": "Advanced Topics in Sound and Music Perception III",
  "unit": "1",
  "description": "Research and discussion on selected topics in sound and music perception. S/U grades only. May be taken for credit four times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 270A",
  "title": "Introduction to Laboratory Experimentation I",
  "unit": "4",
  "description": "A basic laboratory course designed to introduce first-year graduate students to experimental methods in psychology. The student will select a research topic; do a thorough literature review of the area; design and carry out new, original studies of problems in the selected area; and prepare a final formal report of the study at the end of the spring quarter. This course is required of all first-year graduate students in the department. S/U grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 270B",
  "title": "Introduction to Laboratory Experimentation II",
  "unit": "4",
  "description": "Continuation of basic laboratory course designed to introduce first-year graduate students to experimental methods in psychology. The student will select a research topic; do a thorough literature review of the area; design and carry out new, original studies of problems in the selected area; and prepare a final formal report of the study at the end of the spring quarter. This course is required of all first-year graduate students in the department. S/U grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 270C",
  "title": "Introduction to Laboratory Experimentation III",
  "unit": "4",
  "description": "Final quarter of basic laboratory course designed to introduce first-year graduate students to experimental methods in psychology. The student will select a research topic; do a thorough literature review of the area; design and carry out new, original studies of problems in the selected area; and prepare a final formal report of the study at the end of the spring quarter. This course is required of all first-year graduate students in the department. Letter grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 271",
  "title": "Neurobiology of Learning and Memory",
  "unit": "4",
  "description": "This seminar will span the study of learning and memory from an interdisciplinary neuroscience perspective: the goal will be to gain a broad perspective on memory. The course will also touch on dysfunctions of learning and memory such as in amnesia, mental retardation, aging, and Alzheimer's disease. The course will end with exciting developments in the field, including the possibility of genetic and pharmacological enhancement of memory and intelligence.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 272",
  "title": "Selected Topics in Cognitive Psychology",
  "unit": "4",
  "description": "An in-depth analysis of selected empirical and theoretical topics in cognitive psychology. The course will focus on areas where notable progress appears to be taking place in contemporary research.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 273",
  "title": "Selected Topics in Quantitative Methods in Psychology",
  "unit": "4",
  "description": "An in-depth analysis and discussion of selected advanced topics in quantitative methods in psychology.",
  "prerequisite": "graduate standing or consent of the instructor."
 },
 {
  "code": "PSYC 274",
  "title": "Current Directions in Social Psychology",
  "unit": "1 **",
  "description": "A biweekly seminar series focusing on recent advances in both basic and applied research in social psychology including topics such as interpersonal relationships, emotion, health, social cognition, judgment, and decision making. May be taken for credit twenty-four times. S/U grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 275",
  "title": "Current Directions in Cognitive Psychology",
  "unit": "1",
  "description": "A weekly seminar series focused on understanding recent advances in any area of cognitive psychology. May be taken for credit twenty-four times. S/U grades only.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 276",
  "title": "Selected Topics in Social Psychology",
  "unit": "4",
  "description": "An in-depth analysis of selected empirical and theoretical topics in social psychology. The course will focus on areas where notable progress appears to be taking place in contemporary research. May be taken for credit three times.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "PSYC 280",
  "title": "Seminar in Communication and Information Processing",
  "unit": "1",
  "description": "S/U grades only.",
  "prerequisite": null
 },
 {
  "code": "PSYC 282",
  "title": "Auditory Neuroscience",
  "unit": "4",
  "description": "An in-depth analysis of current theoretical and empirical issues in the neurobiological study of auditory perception and cognition. Example topics include auditory stream segregation, localization, natural stimulus coding, pattern recognition and communication in multiple species.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "PSYC 296",
  "title": "Research Practicum",
  "unit": "1-12",
  "description": "Research in psychology under supervision of individual faculty members. S/U grades only. May be taken for credit fifteen times.",
  "prerequisite": null
 },
 {
  "code": "PSYC 299",
  "title": "Research Practicum",
  "unit": "1-12",
  "description": "Independent research and thesis research. S/U grades only. May be taken for credit fifteen times.",
  "prerequisite": null
 },
 {
  "code": "PSYC 500",
  "title": "Apprentice Teaching",
  "unit": "4",
  "description": "Teaching practicum for students enrolled in graduate program in psychology. Students who hold appointments as teaching assistants must enroll in this course. Minimum program requirement is for one four-unit course per year for four years. S/U grades only.",
  "prerequisite": null
 }
]