[
 {
  "code": "RELI 1",
  "title": "Introduction to Religion",
  "unit": "4",
  "description": "An introduction to key topics in the study of religion through the analysis of religious texts, artifacts, and/or practices. The intent is to develop basic strategies of interpretation for undertaking a critical, disciplined study of religion.",
  "prerequisite": null
 },
 {
  "code": "RELI 2",
  "title": "Comparative World Religions",
  "unit": "4",
  "description": "An introduction to the comparative study of religion, focusing on religious traditions of global significance. Although historical aspects of these traditions will be studied, emphasis will be placed on religious beliefs and practices as manifested in the contemporary world.",
  "prerequisite": null
 },
 {
  "code": "RELI 3",
  "title": "Technoscience and Religion",
  "unit": "4",
  "description": "The aim of this course is to introduce students to the complex relationship between \"technoscience,\" as a broad field of inquiry into the global human practices of technology combined with scientific methods, ranging from biology to computer sciences and robotics, with religion in its complex social manifestations.",
  "prerequisite": null
 },
 {
  "code": "RELI 87",
  "title": "First-year Student Seminar in Religion",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic related to the study of religion with a faculty member in a small seminar setting. First-year student seminars are offered in all campus departments and undergraduate colleges, and topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequisite": null
 },
 {
  "code": "RELI 101",
  "title": "Tools and Methods in the Study of Religion",
  "unit": "4",
  "description": "This course provides an advanced introduction to assumptions and norms that shape the study of religion as an academic field; to significant debates within the field; and to tools and methods used for professional research within the field.",
  "prerequisite": null
 },
 {
  "code": "RELI 131",
  "title": "Topics in Religion and Sexuality",
  "unit": "4",
  "description": "How does religiosity as a significant cultural component help mold gender and sexuality identities? The class offers topical investigations into this question.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 132",
  "title": "Topics in Orthodoxy and Heterodoxy",
  "unit": "4",
  "description": "Religious dogmas often develop in dialogue with alternative viewpoints that ultimately are rejected by heterodox by the dominant group. This class presents case studies in the interpretation of such ideological and sociological pairings using scriptural, literary, and analytic sources.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 134",
  "title": "Topics in American Religion",
  "unit": "4",
  "description": "Topical studies in the history of religion in American society, ranging from the Puritans to the New Age.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 141",
  "title": "Public Sphere and Religion",
  "unit": "4",
  "description": "This interdisciplinary course will explore the historical and theoretical relationship between public sphere and religion, particularly focusing on the manifestation of religious power, public ritual, and sacred theatricality in everyday spaces of life.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 142",
  "title": "Secularization and Religion",
  "unit": "4",
  "description": "Surveys the relationship between religion and modernity, in particular the problematic of the secularization theory; covers cases such as Catholic liberation theology and Islamic fundamentalism, with particular focus on the \"deprivatization of modern religion.\"",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 143",
  "title": "Topics in Performing Religion",
  "unit": "4",
  "description": "This course explores religion as a system of bodily practices, rather than one of tenets or beliefs. How do day-to-day activities as well as significant rituals express and inform people's religious lives? Why is doctrine an insufficient basis for understanding religion? May be taken up to three times as topics vary.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 144",
  "title": "Devils and Demons in Christianity",
  "unit": "4",
  "description": "Christianity frequently finds definition in contradistinction to an \"Other\" characterized as immoral, irrational, and malevolent. This class investigates how devils and demons as constructions of the \"Other\" have contributed to Christianity's growth and identity formation throughout history.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 145",
  "title": "Communication, Technology, and Religion",
  "unit": "4",
  "description": "This course will look at the relationship between information communication technologies (ICTs) and religion and how they have intersected or diverged in the course of history. We will look at both older and newer media, such as telegraph, radio, television, cassette tapes, internet, and satellite, and how they have been used by groups like Evangelical, Catholic, or Islamist movements in proliferation and transformation of ideas, rituals, ideologies, values, and diverse forms of sociability.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 146",
  "title": "Topics in the Religions of Antiquity",
  "unit": "4",
  "description": "Topical studies in the religious beliefs, practices, and institutions of pre- Christian Europe and near East. May be repeated for credit up to three times when topics vary.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 147",
  "title": "Pagan Europe and Its Christian Aftermath",
  "unit": "4",
  "description": "This course explores the history of how western Europe was converted from its indigenous pagan religions to the imported religion we know as Christianity. We will discuss conversion by choice and by force, partial or blended conversions, and the relationships between belief and culture.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 148",
  "title": "Religion and Women's Activisms",
  "unit": "4",
  "description": "The course surveys women's formal and informal roles and activities in a number of faiths, examining how women's agency and activism may be constrained or fostered by religious ideologies and norms in various historical and political contexts. Examples are drawn from a range of male-centered religions (Islam, Judaism, Christianity, Buddhism), woman-centered religions (Sande, Afro-Brazilian, Z-ar Cult), and newly formed theologies (Womanist, Native American, and Mujerista; New Age feminist spiritualities).",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 149",
  "title": "Islam in America",
  "unit": "4",
  "description": "This course introduces the students to historical and social developments of Islam in the United States. Tracing Islam back to the African slaves, the course examines various Muslim communities in the United States, with a focus on African American Muslims, especially Malcolm X.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "RELI 150",
  "title": "Religion and Cinema",
  "unit": "4",
  "description": "The course is an introductory study of cinema and religion. It explores how cinema depicts religion and spiritual experience. A number of films will be studied to understand how cinematic and religious narratives and practices overlap and, at times, diverge in complex ways.",
  "prerequisite": "upper- division standing or consent of instructor."
 },
 {
  "code": "RELI 151",
  "title": "Deep Ecology: Knowing Place",
  "unit": "4",
  "description": "This course explores intersections between religious discourse and ecological discourse by considering texts from both that treat the human world as irreducibly interconnected with more-than-human worlds of nature and “spirit.” Themes include the ambivalence of wildness; the critique of anthropocentrism (human-centeredness); and the question of how religious emphasis on “knowing (one’s) place” can create a sense of either human exceptionality, above nature, or embeddedness, within nature.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 153",
  "title": "Hispanic American Religions",
  "unit": "4",
  "description": "This course introduces students to historical and social developments of religion among Hispanic Americans. The course examines changing religious traditions and ritual practices among Hispanic Americans with a focus on Catholicism and (evangelical) Protestantism.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 154",
  "title": "Asian American Religions",
  "unit": "4",
  "description": "This course introduces students to historical and social developments of religion among Asian Americans. Tracing back to the mid-nineteenth century, the course examines changing religious traditions and ritual practices among Asian American communities.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 155",
  "title": "African American Religions",
  "unit": "4",
  "description": "This course introduces students to historical and social developments of religion among African Americans. The course examines changing religious traditions and ritual practices among African Americans since slavery to the present era.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "RELI 156",
  "title": "Posthuman Spirituality",
  "unit": "4",
  "description": "This course will survey questions surrounding the \"coevolution\" of human and technics and ways such processes are making new worlds of which we often feel a sense of perpetual disruption. We investigate posthuman not only in terms of new technological practices but spiritual experiences that bring about new understandings of being human in the world.",
  "prerequisite": "upper- division standing."
 },
 {
  "code": "RELI 157GS",
  "title": "Religion in Japan",
  "unit": "4",
  "description": "This course examines Japanese religions by studying various traditions including Buddhism, Christianity, and Shintoism and their influence on Japanese culture such as anime and cinema. Students must apply and be accepted into the Global Seminar Program.",
  "prerequisite": null
 },
 {
  "code": "RELI 158GS",
  "title": "Japanese Literature and Spirituality",
  "unit": "4",
  "description": "This course looks at the relationship between literature and spirituality in Japan. The course explores this relationship in the works of Shusaku Endo, Hiromi Ito, Yasunari Kawabata, Haruki Murakami, and others. Students must apply and be accepted into the Global Seminar Program.",
  "prerequisite": null
 },
 {
  "code": "RELI 159GS",
  "title": "Native Religions",
  "unit": "4",
  "description": "This course explores Native American ways of life and religions; it also examines the impact of European invasion and colonization.",
  "prerequisite": "Students must apply and be accepted into the Global Seminar Program. Program or material fee may apply."
 },
 {
  "code": "RELI 160GS",
  "title": "Religion and Politics",
  "unit": "4",
  "description": "Explores the complex relationship between religion and politics in a variety of historical and social contexts. The course examines a range of texts and case studies with a focus on the intersection of religion with politics.",
  "prerequisite": "Students must apply and be accepted into the Global Seminar Program. Program or material fee may apply."
 },
 {
  "code": "RELI 188",
  "title": "Special Topics in Religion",
  "unit": "4",
  "description": "Students in this lecture will investigate important problems in the study of religion or the history of particular religions. May be repeated for credit up to three times when topics vary.",
  "prerequisite": "upper-division standing."
 },
 {
  "code": "RELI 189",
  "title": "Seminar in Religion",
  "unit": "4",
  "description": "This seminar requires the intensive analysis of critical problems in the study of religion or the history of particular religions. May be repeated for credit up to three times when topics vary.",
  "prerequisite": "upper-division standing; RELI 101 or consent of instructor."
 },
 {
  "code": "RELI 192",
  "title": "Senior Seminar in Religion",
  "unit": "1",
  "description": "The senior seminar is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in religion at the upper-division level. Topics will vary from quarter to quarter. Senior seminars may be taken for credit up to four times, with a change in topic and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequisite": null
 },
 {
  "code": "RELI 196AH",
  "title": "Honors Thesis in Religion",
  "unit": "4",
  "description": "First quarter of a two-quarter sequence of individualized, directed-research courses for majors in which students learn firsthand the processes and practices of scholarly research in the study of religion, culminating in the completion of a thesis and an oral presentation. Students may not receive credit for both RELI 196H and RELI 196AH.",
  "prerequisite": "RELI 101 (may be completed concurrently with the honors sequence). Department approval required for entry into the Honors Program."
 },
 {
  "code": "RELI 196BH",
  "title": "Honors Thesis in Religion",
  "unit": "4",
  "description": "Second quarter of a two-quarter sequence of individualized, directed-research courses for majors in which students learn firsthand the processes and practices of scholarly research in the study of religion, culminating in the completion of a thesis and an oral presentation. Students may not receive credit for both RELI 196H and RELI 196BH.",
  "prerequisite": "RELI 196A. Department approval required for continuing participation in the Honors Program."
 },
 {
  "code": "RELI 197",
  "title": "Directed Advanced Readings",
  "unit": "4",
  "description": "A faculty member will direct a student in advanced readings on a topic not generally included in the Program for the Study of Religion's curriculum. Students must make arrangements with the program and individual faculty. May be repeated for credit up to three times for credit.",
  "prerequisite": "upper- division standing; RELI 110A or 110B; overall GPA of 2.5."
 },
 {
  "code": "RELI 199",
  "title": "Independent Research Study for Undergraduates",
  "unit": "2-4",
  "description": "Independent research in religion under the supervision of a faculty member affiliated with the Program for the Study of Religion. This course may be repeated three times with program approval. (P/NP grades only.)",
  "prerequisite": "upper-division standing, with 2.5 GPA (overall); program stamp."
 }
]