[
 {
  "code": "SIO 1",
  "title": "The Planets",
  "unit": "4",
  "description": "Space exploration has revealed an astonishing diversity among the planets and moons in our solar system. The planets and their histories will be compared to gain insight and a new perspective on planet Earth.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 3",
  "title": "Life in the Oceans",
  "unit": "4",
  "description": "An introduction to the wide variety of organisms that live in the oceans, the habitats they occupy, and how species interact with each other and their environment. Included will be examinations of adaptations, behavior, ecology, and a discussion of local and global resource management and conservation issues. This course is designed for nonbiology majors.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 10",
  "title": "The Earth",
  "unit": "4",
  "description": "An introduction to structure of the Earth and the processes that form and modify it. Emphasizes material that is useful for understanding geological events as reported in the news and for making intelligent decisions regarding the future of our environment.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 10GS",
  "title": "The Earth (In Iceland)",
  "unit": "4",
  "description": "This Global Seminar course will provide an introduction to planet Earth and the processes that shape it. Topics to be covered include Earth layers, materials, plate tectonics, weathering and erosion, and coastal processes. The geology of Iceland will be a specific emphasis and will thus be used as a lens through which to learn about the Earth. Program or material fee may apply. _",
  "prerequisite": "students must apply and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 12",
  "title": "History of the Earth and Evolution",
  "unit": "4",
  "description": "Evolution of the Earth from its origin in the early solar system to formation of continents and ocean basins, and how the planet became habitable. It examines the geologic record of evolution, extinction, plate tectonics, and climate changes through time.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 15",
  "title": "Natural Disasters",
  "unit": "4",
  "description": "Introduction to environmental perils and their impact on everyday life. Geological and meteorological processes, including earthquakes, volcanic activity, large storms, global climate change, mass extinctions throughout Earth's history, and human activity that causes and prevents natural disasters.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 16",
  "title": "Geology of the National Parks",
  "unit": "4",
  "description": "An introduction to fundamental concepts of geology and environmental science through the lens of the national park system. Topics covered include the geologic time scale; plate tectonics; igneous, metamorphic, and sedimentary processes; geomorphology; climate change; and environmental degradation.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 20",
  "title": "The Atmosphere",
  "unit": "4",
  "description": "Descriptive introduction to meteorology and climate studies. Topics include global and wind and precipitation patterns, weather forecasting, present climate and past climate changes (including droughts, El Niño events), greenhouse gas effects, ozone destruction, the “little ice age,” acid rain.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 25",
  "title": "Climate Change and Society",
  "unit": "4",
  "description": "Climate change is one of the most complex and critical issues affecting societies today. This course will present the scientific evidence for climate change and its impacts and consider governmental policy responses and possible adaptation strategies.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 30",
  "title": "The Oceans",
  "unit": "4",
  "description": "Presents modern ideas and descriptions of the physical, chemical, biological, and geological aspects of oceanography, and considers the interactions between these aspects. Intended for students interested in the oceans, but who do not necessarily intend to become professional scientists.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 35",
  "title": "Water",
  "unit": "4",
  "description": "This course will examine the properties of water that make it unique and vital to living things. Origin of water on Earth and neighboring planets will be explored. Socially relevant issues concerning water use and contamination will be covered.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 40",
  "title": "Life and Climate on Earth",
  "unit": "4",
  "description": "Explores life on Earth and its relationship to the environment—past, present, and future. Topics include origins of life, earth history, elemental cycles, global climate variability and human impacts on our environment.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 45",
  "title": "Volcanoes",
  "unit": "4",
  "description": "This class will provide students with an introduction to volcanoes, including the mechanisms, products, and hazards associated with various types of volcanic eruptions. A key area of emphasis will be the impact of volcanism on human societies.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 45GS",
  "title": "Volcanoes",
  "unit": "4",
  "description": "This class will provide students with an introduction to volcanoes, including the mechanisms, products, and hazards associated with various types of volcanic eruptions. A key area of emphasis will be the impact of volcanism on human societies.",
  "prerequisite": "students must apply for and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 46GS",
  "title": "Global Volcanism",
  "unit": "4",
  "description": "This global seminar course will focus on European volcanism—past, present, and future. Students will learn in detail about the volcanoes of Europe, including their geologic origins, eruptive styles, and histories. A special focus will be on the impact of volcanic hazards on the people, cultures, and societies of this heavily populated region. Notable volcanoes and historical eruptions (Vesuvius and Pompeii, Mt. Etna, Santorini, Campi Flegrei) will be discussed in detail. Program or materials fees may apply.",
  "prerequisite": "students must apply for and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 50",
  "title": "Introduction to Earth and Environmental Sciences",
  "unit": "6",
  "description": "This course is an introduction to how our planet works, focusing on the formation and evolution of the solid earth, and the processes affecting both its surface and interior. Laboratories and substantial field component complement and extend the lecture material. Program and/or materials fees may apply.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 60",
  "title": "Experiences in Oceanic and Atmospheric Sciences",
  "unit": "4",
  "description": "Oceanic and atmospheric sciences are introduced through a series of modules where students learn basic principles in the classroom and then have hands-on experiences demonstrating these principles. The course will include trips to the beach, the Ellen Browning Scripps Memorial Pier, and laboratories at Scripps Institution of Oceanography.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "description": "The First-year Student Seminar Program is designed to provide the new students with the opportunity to explore and intellectual topic with a faculty member in a small setting. Topics vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students. (P/NP grades only).",
  "prerequisite": null
 },
 {
  "code": "SIO 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "description": "Perspectives on ocean sciences. This seminar introduces students to exciting and current research topics in ocean science as presented by faculty and researchers at Scripps Institution of Oceanography. Formerly ERTH 90.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 96",
  "title": "Frontiers in the Earth Sciences",
  "unit": "2",
  "description": "An introduction to current research in the earth sciences. Background in science not required but may be useful for some topics. Areas covered vary from year to year.",
  "prerequisite": "none."
 },
 {
  "code": "SIO 99",
  "title": "Independent Study",
  "unit": "2 or 4",
  "description": "Independent reading or research on a problem by special arrangement with a faculty member.",
  "prerequisite": "lower-division standing, completion of thirty units of UC San Diego undergraduate study, a minimum UC San Diego GPA of 3.0, and a completed and approved Special Studies form, UC San Diego Application for Enrollment Special Studies Courses 97, 98, 99."
 },
 {
  "code": "SIO 100",
  "title": "Introduction to Field Methods",
  "unit": "4",
  "description": "Mapping and interpretation of geologic units. Fieldwork is done locally, and the data are analyzed in the laboratory. There will be one mandatory weekend field trip to Anza Borrego State Park. Program and/or materials fees may apply.",
  "prerequisite": "SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 101",
  "title": "California Coastal Oceanography",
  "unit": "4",
  "description": "This course emphasizes oceanographic connections between physical and climate forcing and marine ecosystem responses using examples from and activities in the California coastal environment. The approach is inquiry-based, combining classroom and experiential learning to build critical and quantitative thinking and research insights and abilities.",
  "prerequisite": "CHEM 6A or consent of instructor."
 },
 {
  "code": "SIO 102",
  "title": "Introduction to Geochemistry",
  "unit": "4",
  "description": "An introduction to the chemical composition and evolution of the Earth and solar system. Applications of chemical methods to elucidate the origin and geologic history of the Earth and the planets, evolution of oceans and atmosphere, and human environmental impacts.",
  "prerequisite": "SIO 50, CHEM 6A-B-C, or consent of instructor."
 },
 {
  "code": "SIO 103",
  "title": "Introduction to Geophysics",
  "unit": "4",
  "description": "An introduction to the structure and composition of the solid earth. Topics include seismology, the gravity and magnetic fields, high-pressure geophysics, and concepts in geodynamics. Emphasis is on global geophysics, i.e., on the structure and evolution of the planet.",
  "prerequisite": "MATH 20A-B-C-D and PHYS 2A-B-C, SIO 50, or consent of instructor. SIO 160 recommended."
 },
 {
  "code": "SIO 104",
  "title": "Paleobiology and History of Life",
  "unit": "6",
  "description": "An introduction to the major biological transitions in Earth history from the origins of metabolism and cells to the evolution of complex societies. The nature and limitations of the fossil record, patterns of adaptation and diversity, and the tempo and mode of biological evolution. Laboratories and substantial field component complement and extend the lecture material. Program and/or materials fees may apply.",
  "prerequisite": "undergraduate: BILD 3 or consent of instructor. Graduate: graduate-level standing or consent of instructor. Graduate students, additionally, will give oral presentation or research paper."
 },
 {
  "code": "SIO 105",
  "title": "Sedimentology and Stratigraphy",
  "unit": "4",
  "description": "This course will examine sedimentary environments from mountain tops to the deep sea across a variety of time scales. The focus is to develop the skills to interpret stratigraphy and read the history of the Earth that it records. Laboratories and substantial field component complement and extend lecture material. Program and/or course materials fees may apply.",
  "prerequisite": "SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 106",
  "title": "Introduction to Hydrogeology",
  "unit": "4",
  "description": "An introduction to the theory and practice of hydrogeology, emphasizing current concepts of aquifer and water properties and practical considerations related to groundwater quality, groundwater flow, and sustainability of groundwater reservoirs.",
  "prerequisite": "SIO 50, MATH 20C, PHYS 2C, and CHEM 6C; upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 108",
  "title": "Introduction to Paleoclimatology",
  "unit": "4",
  "description": "An introduction to basic principles and applications of paleoclimatology, the study of climate and climate changes that occurred prior to the period of instrumental records. A review of processes and archives of climate data will be investigated using examples from Earth history.",
  "prerequisite": "ESYS 102 or SIO 50 or SIO 12 or consent of instructor."
 },
 {
  "code": "SIO 109",
  "title": "Bending the Curve: Climate Change Solutions",
  "unit": "4",
  "description": "(Cross-listed with POLI 117). This course will focus on scalable solutions for carbon neutrality and climate stability. The course adopts climate change mitigation policies, technologies, governance, and actions that California, the UC system, and cities around the world have adopted as living laboratories and challenges students to identify locally and globally scalable solutions. Students may only receive credit for one of the following: POLI 117, POLI 117R, SIO 109, or SIO 109R.",
  "prerequisite": null
 },
 {
  "code": "SIO 109R",
  "title": "Bending the Curve Online: Climate Change Solutions",
  "unit": "4",
  "description": "(Cross-listed with POLI 117R). This online course focuses on developing urgent climate change solutions that integrate technology, policy and governance, finance, land-use, and social/educational dimensions. Students may only receive credit for one of the following: POLI 117, POLI 117R, SIO 109, or SIO 109R.",
  "prerequisite": null
 },
 {
  "code": "SIO 110",
  "title": "Introduction to GIS and GPS for Scientists",
  "unit": "4",
  "description": "A hands-on introduction to science applications of geographic information systems and global positioning system. Students acquire data through GPS field surveys, design and construct GIS using ESRI's ArcGIS software, analyze spatial data, and present the results in a web-based environment.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 111",
  "title": "Introduction to Ocean Waves",
  "unit": "4",
  "description": "The linear theory of ocean surface waves, including: group velocity, wave dispersion, ray theory, wave measurement and prediction, shoaling waves, giant waves, ship wakes, tsunamis, and the physics of the surf zone. Cross-listed with PHYS 111.",
  "prerequisite": "PHYS 2A-C or PHYS 4A-C and MATH 20A-E, or consent of instructor."
 },
 {
  "code": "SIO 113",
  "title": "Introduction to Computational Earth Science",
  "unit": "4",
  "description": "Computers are used in the geosciences to understand complex natural systems. This course includes beginning programming with a user-friendly language (Python).",
  "prerequisite": "SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 114",
  "title": "The Science and Analysis of Environmental Justice",
  "unit": "4",
  "description": "Introduction to the scientific basis and critical analysis of environmental justice, with an emphasis on case studies, activism, and community engagement. This course will prepare students to critique and develop scientific models, research designs, and measurements consistent with environmental justice. Students may not receive credit for ETHN 136 and SIO 114.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 115",
  "title": "Ice and the Climate System",
  "unit": "4",
  "description": "This course examines the Earth’s cryosphere, including glaciers, ice sheets, ice caps, sea ice, lake ice, river ice, snow, and permafrost. We cover the important role of the cryosphere in the climate systems and its response to climate change.",
  "prerequisite": "MATH 20C or MATH 31BH, and PHYS 2C, or consent of instructor."
 },
 {
  "code": "SIO 116",
  "title": "Climate Change and Global Health: Understanding the Mechanisms",
  "unit": "4",
  "description": "This course will introduce students to the public health effects of global climate change. The course will begin by understanding the climate change phenomena and explaining the direct and indirect links between climate change and human health, including the public health impacts of infectious diseases, atmospheric air pollution, and extreme weather events. The second part of the course will be dedicated to adaption and mitigation solutions with a particular focus on vulnerable populations. Students may not receive credit for SIO 116 and SIO 116GS.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 116GS",
  "title": "Climate Change and Global Health: Understanding the Mechanisms",
  "unit": "4",
  "description": "This course will introduce students to the public health effects of global climate change. The course will begin by understanding the climate change phenomena and explaining the direct and indirect links between climate change and human health, including the public health impacts of infectious diseases, atmospheric air pollution, and extreme weather events. The second part of the course will be dedicated to adaption and mitigation solutions with a particular focus on vulnerable populations. Students may not receive credit for SIO 116GS and SIO 116. Program or materials fees may apply.",
  "prerequisite": "students must apply for and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 117",
  "title": "The Physical Basis of Global Warming",
  "unit": "4",
  "description": "Introduction to the processes behind global warming, including the physics of the greenhouse effect, controls on greenhouse gases, atmospheric and oceanic circulation, climate feedbacks, relationship to natural climate variability, and global environmental issues related to global warming.",
  "prerequisite": "MATH 20D and PHYS 2C or consent of instructor."
 },
 {
  "code": "SIO 118GS",
  "title": "Responding to Climate Change: Possible Solutions",
  "unit": "4",
  "description": "This course will be taught in Dharamsala, India, and explores societal solutions to climate change. Course topics include mitigation and adaptation policies, including a guide to design, implement, and evaluate an adaptation policy, and the public health cobenefits of addressing climate change.",
  "prerequisite": "students must apply for and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 119",
  "title": "Physics and Chemistry of the Oceans",
  "unit": "4",
  "description": "Basic physical and chemical processes that influence the biology of the oceans, such as ocean circulation, ocean acidification, carbonate chemistry, trace metal chemistry.",
  "prerequisite": "PHYS 1C or 2C, CHEM 6C, or consent of instructor."
 },
 {
  "code": "SIO 120",
  "title": "Introduction to Mineralogy",
  "unit": "4",
  "description": "Application of mineralogical and x-ray crystallographic techniques in earth sciences. Topics include symmetry, crystal structure, chemical, and physical properties of minerals with special emphasis on the common rock-forming minerals. Laboratory component includes polarizing microscope and x-ray powder diffraction methods.",
  "prerequisite": "SIO 50, or consent of instructor."
 },
 {
  "code": "SIO 121",
  "title": "Biology of the Cryosphere",
  "unit": "4",
  "description": "The cryosphere comprises sea ice, glaciers, snow, and other frozen environments. Changing rapidly in the face of global climate change, these environments host unique and highly adapted ecosystems that play an important role in the global earth system. In this course we will explore the physiology and ecology of organisms in the cryosphere and peripheral habitats. A special emphasis will be placed on sea ice as a habitat archetype, but glacier, snow, and permafrost will also be covered.",
  "prerequisite": "BILD 1, BILD 2, BILD 3, or consent of instructor."
 },
 {
  "code": "SIO 121GS",
  "title": "Geology of the Alps",
  "unit": "4",
  "description": "This global seminar course will examine the geology of the Alps range. Students will develop an in-depth understanding of the geology, tectonics, and geomorphology of this fascinating, beautiful, and geologically complex region. The course will focus closely on the tectonics of the region and the subsequent geologic processes that have shaped it (e.g., glaciation) since the late Mesozoic Alpine Orogeny. Classroom study will be strongly augmented with local and regional field excursions. Program or materials fees may apply.",
  "prerequisite": "SIO 10 or SIO 50. Students must apply for and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 122",
  "title": "Ecological Developmental Biology",
  "unit": "4",
  "description": "This course will explore the rapidly expanding field of ecological developmental biology which focuses on how factors such as temperature, nutrition, microbes, predators, and hormones influence development epigenetically. Emphasis will be given to the genetic basis of responses to the environment, drawn from studies in aquatic and terrestrial animals and plants. Topics include phenotypic plasticity, teratogenesis, symbiosis, endocrine disruptors, sex determination, and genetic assimilation. Recommended preparation: BICD 100. ",
  "prerequisite": "BILD 3, or consent of instructor."
 },
 {
  "code": "SIO 123",
  "title": "Microbial Environmental Systems Biology",
  "unit": "4",
  "description": "Environmental systems biology is the study of the genomic basis for patterns of microbial diversity and adaptation in relation to habitat. This course introduces the microbial genome as a unit of study and surveys introductory principles in microbial genomics and bioinformatics that underlie a range of contemporary research in diverse marine habitats, such as the deep sea and polar regions, as well as studies of biomedical importance, including the human microbiome.",
  "prerequisite": "BICD 100 or consent of instructor."
 },
 {
  "code": "SIO 124",
  "title": "Marine Natural Products",
  "unit": "4",
  "description": "This course will provide a detailed introduction to marine natural products. It will survey the organisms that produce these compounds and introduce how they are made (biosynthesis), isolated and identified (natural products chemistry), why they are made (chemical ecology), and how they are exploited for useful purposes including drug discovery (marine biotechnology). It will leave students with a fundamental understanding of the latest techniques employed in natural product research.",
  "prerequisite": "CHEM 6C and BILD 1 or BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 125",
  "title": "Biomechanics of Marine Life",
  "unit": "4",
  "description": "An introduction to the physical basis of the biological world. This course explores how the physical principles of solids and fluids underlay the functional morphology, ecology, and adaptations of all living things, with emphasis on marine organisms.",
  "prerequisite": "BILD 3 and PHYS 1C or PHYS 2C, or consent of instructor."
 },
 {
  "code": "SIO 126",
  "title": "Marine Microbiology",
  "unit": "4",
  "description": "The role of microorganisms in the oceans; metabolic diversity; methods in marine microbiology; interactions of microbes with other microbes, plants and animals; biochemical cycling, pollution and water quality; microbe-mineral interactions; extremophiles. (Students may not receive credit for both SIO 126 and BIMM 126.)",
  "prerequisite": "BILD 1 or consent of instructor."
 },
 {
  "code": "SIO 127",
  "title": "Marine Molecular Ecology",
  "unit": "4",
  "description": "This course will survey the application of molecular methods to address diverse questions concerning the ecology and evolutionary biology in marine organisms. Focus will be on genetic and genomic approaches that are providing new insights into how marine organisms adapt to their physical and biotic environments.",
  "prerequisite": "BILD 3 and BICD 100, or consent of instructor."
 },
 {
  "code": "SIO 128",
  "title": "Microbial Life in Extreme Environments",
  "unit": "4",
  "description": "Microorganisms turn up in the strangest places. This course examines the exotic and bizarre in the microbial world, including the super-sized, the rock and cloud builders, the survivors, and those present at the limits of life.",
  "prerequisite": "BILD 1 or BILD 2 or BILD 3, or consent of instructor."
 },
 {
  "code": "SIO 129",
  "title": "Marine Chemical Ecology",
  "unit": "4",
  "description": "This class explores the chemistry of marine life involved in the chemical adaptations of defense and communication. The class examines all of the marine taxa from microbes to higher plants and animals.",
  "prerequisite": "CHEM 140C or consent of instructor."
 },
 {
  "code": "SIO 130",
  "title": "Scientific Diving",
  "unit": "4",
  "description": "This course includes theoretical and practical training to meet Scripps Institution of Oceanography and AAUS standards for scientific diving authorization and involves classroom, field, and ocean skin and scuba diving sessions. Topics include scientific diving programs and policy; physics and physiology of diving; decompression theory; dive planning; navigation; search and recovery; equipment and environmental considerations; subtidal sampling techniques; hazardous marine life; diving first aid; and diver rescue. Please see course preparation requirements here: <https://scripps.ucsd.edu/scientific-diving-program/authorization-training>. P/NP grades only. Program or materials fees may apply.",
  "prerequisite": "department approval required."
 },
 {
  "code": "SIO 131",
  "title": "Parasitology",
  "unit": "6",
  "description": "An ecological approach to parasitology. Students will gain the intellectual and practical foundation required to undertake parasitological research. Lectures will cover ecological/evolutionary concepts and the biology of various parasitic taxa. In labs, students will learn how to survey hosts for parasites, collect and identify parasites, perform infection experiments, and collect and analyze data. Students will also develop scholarship skills by delving into the scientific literature.",
  "prerequisite": "BILD 3 and BILD 2 or SIO 183, or SIO 184, or SIO 188, or consent of instructor."
 },
 {
  "code": "SIO 132",
  "title": "Introduction to Marine Biology",
  "unit": "4",
  "description": "Overview of marine organisms and their adaptations to sea life. Selected examples of physiological, behavioral, and evolutionary adaptations in response to the unique challenges of a maritime environment. (Students may not receive credit for both SIO 132 and BIEB 132.)",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 133",
  "title": "Marine Mammal Biology",
  "unit": "4",
  "description": "Introduction to the biology, ecology, evolution, and conservation status of marine mammals. Description of marine mammal taxa (mysticetes, odontocetes, pinnipeds, sirenians), their anatomy, physiology, ecology, and behavior. Impacts of whaling, fisheries interactions, and other anthropogenic threats.",
  "prerequisite": "BILD 3 and upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 134",
  "title": "Introduction to Biological Oceanography",
  "unit": "4",
  "description": "Basics for understanding the ecology of marine communities. The approach is process-oriented, focusing on major functional groups of organisms, their food-web interactions and community response to environmental forcing, and contemporary issues in human and climate influences. (Students may not receive credit for both SIO 134 and BIEB 134.)",
  "prerequisite": "BILD 3 and upper- division standing or consent of instructor."
 },
 {
  "code": "SIO 135",
  "title": "Satellite Remote Sensing",
  "unit": "4",
  "description": "Satellite remote sensing provides global observations of Earth to monitor environmental changes in land, oceans, and ice. Overview, physical principles of remote sensing, including orbits, electromagnetic radiation, diffraction, electro-optical, and microwave systems. Weekly labs explore remote sensing data sets. Graduate students will also be required to write a term paper and do an oral presentation.",
  "prerequisite": "undergraduate: PHYS 2A-B or PHYS 4A-B-C, or consent of instructor. Graduate: graduate-level standing or consent of instructor."
 },
 {
  "code": "SIO 136",
  "title": "Marine Biology Laboratory",
  "unit": "6",
  "description": "Introductory laboratory course in current principles and techniques applicable to research problems in marine biology. Field component includes introduction to intertidal, salt marsh, or other marine ecosystems. Program or materials fees may apply.",
  "prerequisite": "BILD 3, SIO 132, and SIO 134, or consent of instructor."
 },
 {
  "code": "SIO 137",
  "title": "Ecosystems and Fisheries",
  "unit": "4",
  "description": "This course introduces students to the broad ecological processes and approaches that are fundamental to studying the dynamics of exploited populations, food webs, and ecosystems. The basics of fisheries oceanography are covered, with a synergistic focus on internations between key members of an ecosystem. A diversity of ecosystems will be discussed but the focus will be on the open ocean and deep sea. ",
  "prerequisite": "SIO 134 or consent of instructor."
 },
 {
  "code": "SIO 138",
  "title": "The Coral Reef Environment",
  "unit": "4",
  "description": "Assessment of the physical, chemical, and biological interactions that define the coral reef system; essential geography and evolutionary history of reefs; natural and human perturbations to the coral reef ecosystem; aspects of reef management and sustainability.",
  "prerequisite": "BILD 3, MATH 10A or MATH 20A, CHEM 6B, or consent of instructor."
 },
 {
  "code": "SIO 139",
  "title": "Current Research in Marine Biology Colloquium",
  "unit": "2",
  "description": "Provides an introduction to current research topics and developments in marine biology and biological oceanography. Faculty members from Scripps Institution of Oceanography will offer perspectives in these areas. Students will practice scientific research and communication skills. P/NP grades only.",
  "prerequisite": "upper-division standing or consent of instructor."
 },
 {
  "code": "SIO 141",
  "title": "Chemical Principles of Marine Systems",
  "unit": "4",
  "description": "Introduction to the chemistry and distribution of the elements in seawater, emphasizing basic chemical principles such as electron structure, chemical bonding, and group and periodic properties and showing how these affect basic aqueous chemistry in marine systems.",
  "prerequisite": "CHEM 6C or 6CH, or consent of instructor."
 },
 {
  "code": "SIO 143",
  "title": "Ocean Acidification",
  "unit": "4",
  "description": "This course covers the fundamentals of ocean acidification, including the chemical background; past and future changes in ocean chemistry; biological and biogeochemical consequences, including organism and ecosystem function; biodiversity; biomineralization; carbonate dissolution; and the cycling of carbon and nitrogen in the oceans.",
  "prerequisite": "MATH 10C, PHYS 1C, CHEM 6C, or consent of instructor."
 },
 {
  "code": "SIO 144",
  "title": "Introduction to Isotope Geochemistry",
  "unit": "4",
  "description": "Radioactive and stable isotope studies in geology and geochemistry, including geochronology, isotopes as tracers of magmatic processes, cosmic-ray produced isotopes as tracers in the crust and weathering cycle, isotopic evolution of the crust and mantle.",
  "prerequisite": "undergraduate: SIO 50, 102, and 120 or consent of instructor. Graduate: graduate-level standing or consent of instructor. Graduate level requires student presentation."
 },
 {
  "code": "SIO 146",
  "title": "Methods in Cell and Developmental Biology of Marine Organisms Lab",
  "unit": "6",
  "description": "This laboratory course will introduce students to modern concepts and techniques in molecular, cellular, and developmental biology, through authentic research projects using echinoderm, mollusk, and coral species. In addition to designing and performing experiments, students will learn to evaluate data, work with DNA sequences, quantify results with statistics, prepare figures, read primary research literature, write and review scientific research articles, and give scientific presentations. ",
  "prerequisite": "BILD 2 or consent of instructor."
 },
 {
  "code": "SIO 147",
  "title": "Applications of Phylogenetics",
  "unit": "6",
  "description": "Overview of the computer-based methods for constructing phylogenetic trees using morphological and molecular data. Lectures and labs cover evolutionary and ecological transformations, biodiversity measurements, biogeography, systematic and taxonomy. An independent project and presentation are required. (Students may not receive credit for both SIO 147 and BIEB 147.)",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 150",
  "title": "Physics and Chemistry of Planetary Interiors",
  "unit": "4",
  "description": "Quantitative study of the physical and chemical processes operating within planetary interiors that control the evolution of planets on geological time scales. Comparative planetology of Earth, Venus, Mars, and other terrestrial planets and satellites will focus on how the formation, differentiation, and evolution of their interiors are expressed as tectonics and volcanism on their surfaces.",
  "prerequisite": "MATH 20D, PHYS 2C, CHEM 6C or consent of instructor."
 },
 {
  "code": "SIO 152",
  "title": "Petrology and Petrography",
  "unit": "6",
  "description": "Mineralogic, chemical, textural and structural properties of igneous, metamorphic, and sedimentary rocks; their origin and relations to evolution of the Earth's crust and mantle. Laboratory emphasizes hand specimens and microscopic studies of rocks in thin sections.",
  "prerequisite": "SIO 50 and SIO 120 or consent of instructor."
 },
 {
  "code": "SIO 153",
  "title": "Geomorphology",
  "unit": "4",
  "description": "Geomorphology is the study of the dynamic interface across which the atmosphere, water, biota, and tectonics interact to transform rock into landscapes with distinctive features crucial to the function and existence of water resources, natural hazards, climate, biogeochemical cycles, and life. In this class, we will study many of the Earth surface processes that operate on spatial scales from atomic particles to continents and over time scales of nanoseconds to millions of years.",
  "prerequisite": "SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 155",
  "title": "Whole Earth Geochemistry",
  "unit": "4",
  "description": "A geochemical overview of Earth materials and chemical processes involved in the Earth’s evolution. Topics include formation and differentiation of the Earth, linkages between the solid Earth and the atmosphere/hydrosphere, and isotope and trace element composition of igneous and metamorphic rocks.",
  "prerequisite": "SIO 102 or consent of instructor."
 },
 {
  "code": "SIO 160",
  "title": "Introduction to Tectonics",
  "unit": "4",
  "description": "The theory of plate tectonics attempts to explain how forces within the Earth give rise to continents, ocean basins, mountain ranges, earthquake belts, and most volcanoes. In this course we will learn how plate tectonics works.",
  "prerequisite": "SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 162",
  "title": "Structural Geology",
  "unit": "4",
  "description": "Principles of stratigraphy and structural geology applicable to field geologic studies. Discussion and laboratory exercises. Two to three field trips required. Program and/or materials fees may apply.",
  "prerequisite": "SIO 100 or consent of instructor."
 },
 {
  "code": "SIO 164",
  "title": "Underwater Archaeology: From Atlantis to Science",
  "unit": "4",
  "description": "Underwater archaeology provides access to ancient environmental and cultural data concerning human adaptation to climate and environmental change. Provides an overview of methods, theories, and practice of marine archaeology including—environmental characteristics of coastal and underwater settings; the nature of ports, navigation, maritime culture, submerged landscapes, shipbuilding; methods of research in underwater settings; and legislative issues regarding underwater and coastal heritage. Students may not receive credit for both ANAR 164 and SIO 164.",
  "prerequisite": null
 },
 {
  "code": "SIO 167",
  "title": "Geoarchaeology in Theory and Practice",
  "unit": "6",
  "description": "As specialists in human timescales, archaeologists are trained to identify subtle details that are often imperceptible for other geoscientists. This course is designed to train archaeologists to identify the natural processes affecting the archaeological record, and geoscientists to identify the influence of human behavior over land surfaces. The course, which includes lectures, laboratory training, and field observations, focuses on the articulation of sedimentology and human activity. Students may not receive credit for both ANAR 167 and SIO 167.",
  "prerequisite": "ANTH 3 and SIO 50 or consent of instructor."
 },
 {
  "code": "SIO 170",
  "title": "Introduction to Volcanology",
  "unit": "4",
  "description": "This class will introduce students to the fundamentals of the science of volcanology. Topics explored will include the processes and products of various types of volcanism, magma genesis, eruptive mechanisms, in addition to volcanic monitoring, hazards and mitigation. Students may not receive credit for both SIO 170 and SIO 170GS.",
  "prerequisite": "SIO 100 and CHEM 6A or CHEM 6AH, or consent of instructor."
 },
 {
  "code": "SIO 170GS",
  "title": "Introduction to Volcanology",
  "unit": "4",
  "description": "This class will introduce students to the fundamentals of the science of volcanology. Topics explored will include the processes and products of various types of volcanism, magma genesis, eruptive mechanisms, in addition to volcanic monitoring, hazards, and mitigation. Students may not receive credit for both SIO 170 and SIO 170GS. Program or materials fees may apply.",
  "prerequisite": "Students must apply and be accepted to the Global Seminars Program."
 },
 {
  "code": "SIO 170L",
  "title": "Introduction to Volcanology—Field Experience",
  "unit": "1-4",
  "description": "This course teaches fundamental aspects of physical and chemical volcanology through a one- to two-week field study experience prior to the start of the quarter. Subjects are introduced in lectures and reinforced and expanded upon in field exercises. Additional fees may be required for travel expenses. Program or materials fees may apply. May be taken for credit two times.",
  "prerequisite": "SIO 170 or consent of instructor; department approval required."
 },
 {
  "code": "SIO 171",
  "title": "Introduction to Physical Oceanography",
  "unit": "4",
  "description": "A physical description of the sea at the upper-division level, with emphasis on currents, waves, and turbulent motions that are observed in the ocean, and on the physics governing them.",
  "prerequisite": "MATH 20C and PHYS 2C or PHYS 4C, or consent of instructor."
 },
 {
  "code": "SIO 172",
  "title": "Physics of the Atmosphere",
  "unit": "4",
  "description": "This course provides an understanding of the physical principles governing the behavior of the Earth's atmosphere, with emphasis on the thermal structure and composition of the atmosphere, air masses and fronts, and atmospheric thermodynamics, fluid dynamics, and radiation.",
  "prerequisite": "MATH 20C and PHYS 2C, or consent of instructor."
 },
 {
  "code": "SIO 173",
  "title": "Dynamics of the Atmosphere and Climate",
  "unit": "4",
  "description": "Introduction to the dynamical principles governing the atmosphere and climate using observations, numerical models, and theory to understand atmospheric circulation, weather systems, severe storms, marine layer, Santa Ana winds, El Niño, climate variability, and other phenomena.",
  "prerequisite": "MATH 20E and PHYS 2C, or consent of instructor."
 },
 {
  "code": "SIO 174",
  "title": "Chemistry of the Atmosphere and Oceans",
  "unit": "4",
  "description": "An introduction to chemical compounds and their biogeochemical cycles in the oceans and atmosphere, with emphasis on climate issues like ocean acidification, greenhouse gases and the carbon cycle, other biogeochemical cycles, chlorofluorocarbons and the ozone hole, urban pollutants and their photochemistry, and aerosol particles and their effects on clouds.",
  "prerequisite": "CHEM 6C or CHEM 6CH and MATH 20C or MATH 31BH or consent of instructor."
 },
 {
  "code": "SIO 175",
  "title": "Analysis of Oceanic and Atmospheric Data",
  "unit": "4",
  "description": "Oceanic and atmospheric observations produce large data sets whose understanding requires analysis using computers. This course will include an introduction to Matlab for the purpose of analyzing data. Students will use modern data sets from the ocean and atmosphere to learn statistical data analysis.",
  "prerequisite": "MATH 18 or MATH 20F or MATH 31AH or consent of instructor."
 },
 {
  "code": "SIO 176",
  "title": "Observational Physical Oceanography",
  "unit": "4",
  "description": "This course gives an introduction to the methods and measurements used by observational physical oceanographers. Topics covered include sensors such as conductivity-temperature-depth (CTD), acoustic Doppler current profiler (ADCP), platforms such as autonomous gliders and ships, and services such as satellite measurements. This course includes a research project.",
  "prerequisite": "SIO 171 or consent of instructor."
 },
 {
  "code": "SIO 177",
  "title": "Fluid Dynamics",
  "unit": "4",
  "description": "This course gives an introduction to ocean and atmosphere fluid properties, statics, and kinematics; fluid conservation laws; irrotational flow; Bernoulli equation; gravity waves; shallow water equations; geophysical applications.",
  "prerequisite": "PHYS 2A and MATH 20D and MATH 20E or consent of instructor."
 },
 {
  "code": "SIO 178",
  "title": "Geophysical Fluid Dynamics",
  "unit": "4",
  "description": "This course provides an introductory look at physical principles governing ocean currents and atmospheric flow. Topics may include large-scale circulation, ocean eddies, atmospheric storms systems, coastal upwelling, equatorial dynamics, and internal waves.",
  "prerequisite": "PHYS 2C and SIO 177 and MATH 18 or MATH 20F or MATH 31AH or consent of instructor."
 },
 {
  "code": "SIO 179",
  "title": "Ocean Instruments and Sensors",
  "unit": "4",
  "description": "Apply modern and classic techniques for analysis of seawater, introducing concepts of signal transduction, calibration, and measurement quality control. Emphasis will be placed on computer automation to perform basic functions including instrument control, data storage, and on-the-fly calculations. Students will apply techniques from several branches of engineering to the marine sciences. Students may not receive credit for both SIO 179 and SIO 190 with the same subtitle. Recommended preparation: PHYS 2A-C or PHYS 4A-C.",
  "prerequisite": "CHEM 6A or CHEM 6AH or PHYS 2A or PHYS 4A or consent of instructor."
 },
 {
  "code": "SIO 180",
  "title": "Communicating Science to Informal Audiences",
  "unit": "4",
  "description": "Students develop fundamental science communication and instructional skills through the understanding and application of learning theory, interpretive techniques, and pedagogical practices, which occur in the context of communicating ocean science concepts to a diverse audience at Birch Aquarium at Scripps.",
  "prerequisite": "CHEM 6A or SIO 50 or BILD 1 or consent of instructor."
 },
 {
  "code": "SIO 181",
  "title": "Marine Biochemistry",
  "unit": "4",
  "description": "Biochemical mechanisms of adaptation in organisms to the marine environment. Special emphasis will be on the effects of pressure, temperature, salinity, oxygen, and light on the physiology and biochemistry. (Students may not receive credit for both SIO 181 and BIBC 130.)",
  "prerequisite": "none."
 },
 {
  "code": "SIO 182",
  "title": "Environmental and Exploration Geophysics",
  "unit": "4",
  "description": "Theory and practice of nonseismic geophysics for groundwater, environmental, and exploration purposes. Lectures are supplemented by collection of gravity, magnetic, and resistivity data; data analysis; and report writing. Includes an introduction to Matlab as a tool for geophysical data interpretation.",
  "prerequisite": "MATH 20D and PHYS 2C, or consent of instructor."
 },
 {
  "code": "SIO 183",
  "title": "Phycology: Marine Plant Biology",
  "unit": "6",
  "description": "Lecture and laboratory course emphasizing the biology, ecology and taxonomy of marine plants and seaweeds. Laboratory work mainly involves examination, slide preparation and dissection of fresh material collected locally. An oral presentation on a current research topic is required. Program or course fee may apply.",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 184",
  "title": "Marine Invertebrates",
  "unit": "6",
  "description": "Course emphasizing the diversity, evolution and functional morphology of marine invertebrates. Laboratory work involves examination of live and prepared specimens. An oral presentation and a paper on current research topic is required. Program or course fee may apply.",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 185",
  "title": "Marine Microbiology Laboratory",
  "unit": "5",
  "description": "Techniques and theory in marine microbiology. Students perform experiments concerning (a) enrichment, enumeration, and identification, and (b) metabolic and physiochemical adaptations, along with an independent project. Students may not receive credit for both SIO 126L and SIO 185.",
  "prerequisite": "BILD 1 and SIO 132 or SIO 134 or consent of instructor."
 },
 {
  "code": "SIO 187",
  "title": "Statistical Methods in Marine Biology",
  "unit": "4",
  "description": "Introduction to statistical inference. Emphasis on constructing statistics for specific problems in marine biology. Topics include probability, distributions, sampling, replication, and experimental design. Students may not receive credit for both SIO 187 and BIEB 100.",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 188",
  "title": "Biology of Fishes",
  "unit": "5",
  "description": "The comparative evolution, morphology, physiology, and ecology of fishes. Special emphasis on local, deep-sea, and pelagic forms in laboratory.",
  "prerequisite": "BILD 3 or consent of instructor."
 },
 {
  "code": "SIO 189",
  "title": "Pollution, Environment and Health",
  "unit": "4",
  "description": "The goal is to understand the scope of the pollution problem facing the planet. Students will learn the properties of chemicals in the environment and survey the biological mechanisms that determine their accumulation and toxicity.",
  "prerequisite": "CHEM 6C and BILD 1 or 3 or consent of instructor."
 },
 {
  "code": "SIO 190",
  "title": "Special Topics in Earth, Oceans, and Atmosphere",
  "unit": "4",
  "description": "A seminar course designed to treat emerging or topical subjects in the earth, ocean, or atmospheric sciences. Involves lectures, reading from the literature, and student participation in discussion. Topics vary from year to year. May be taken for credit two times. Enrollment by consent of instructor.",
  "prerequisite": "upper-division standing, a minimum UC San Diego GPA of 3.0 or consent of instructor."
 },
 {
  "code": "SIO 192",
  "title": "Senior Seminar in Scripps Institution of Oceanography",
  "unit": "1",
  "description": "The Senior Seminar Program is designed to allow Scripps Institution of Oceanography senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in Scripps Oceanography (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors.",
  "prerequisite": null
 },
 {
  "code": "SIO 194",
  "title": "Research Seminar in Washington, DC",
  "unit": "4",
  "description": "Course attached to a six- to eight-unit internship taken by students participating in the UCDC Program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial research paper.",
  "prerequisite": "department approval. Participation in the UCDC Program during quarter enrolled in seminar."
 },
 {
  "code": "SIO 195",
  "title": "Methods of Teaching Earth Sciences",
  "unit": "4",
  "description": "Introduction to teaching earth sciences class section in a lower-division class, hold office hours, assist with examinations. This course counts only once toward the major.",
  "prerequisite": "junior or senior earth sciences major with GPA of 3.0 or an A in the course, overall GPA of 3.0 or higher, ninety units or more, and consent of instructor, plus department stamp."
 },
 {
  "code": "SIO 196",
  "title": "Honors Thesis Research",
  "unit": "4",
  "description": "Course is for student participants in the senior honors thesis research program. Students complete individual research on a problem by special arrangement with, and under the direction of, a Scripps Institution of Oceanography faculty member. May be taken for credit two times.",
  "prerequisite": "completed ninety units of courses, including twelve units of SIO courses. Achieved a GPA of 3.3 overall and 3.5 in SIO courses. Submitted to Scripps Steering Committee, and had approved, an honors thesis research proposal. Department stamp."
 },
 {
  "code": "SIO 197",
  "title": "Earth Science Internship",
  "unit": "2 or 4",
  "description": "The earth science internship program is designed to complement the program's academic curriculum with practical field experience.",
  "prerequisite": "completion of ninety units with a GPA of 2.5, and a completed and approved Special Studies form, UC San Diego Application for Enrollment Special Studies Courses 197, 198, 199, and department stamp."
 },
 {
  "code": "SIO 197BA",
  "title": "Birch Aquarium Internship",
  "unit": "4",
  "description": "This internship will examine basic science learning theory and interpretive techniques best suited for learners in an aquarium or informal learning setting. Students will demonstrate learned skills by facilitating floor-based interactions and conducting visitor surveys that influence aquarium exhibit design and guest experiences. Interested students should contact the Scripps undergraduate office for application instructions. P/NP grades only.",
  "prerequisite": "upper-division standing and department stamp required."
 },
 {
  "code": "SIO 198",
  "title": "Directed Group Study",
  "unit": "2-4",
  "description": "This course covers a variety of directed group studies in areas not covered by formal Scripps Oceanography courses. (P/NP grades only.)",
  "prerequisite": "consent of instructor."
 },
 {
  "code": "SIO 199",
  "title": "Independent Study for Undergraduates",
  "unit": "4",
  "description": "Independent reading or research on a problem. By special arrangement with a faculty member. (P/NP grades only.)  ",
  "prerequisite": null
 },
 {
  "code": "SIOG 228",
  "title": "Research Seminar",
  "unit": "2",
  "description": "A three-quarter required sequence for BS/MS earth sciences students to prepare students for thesis writing.",
  "prerequisite": "current earth sciences BS/MS student. Department stamp required."
 },
 {
  "code": "SIOC 200A",
  "title": "Computational Ocean Acoustics and Signal Processing I",
  "unit": "4",
  "description": "Overview of ocean acoustics. Acoustics Wave Equation with some analytic solution techniques. Ray Methods. Introduction to Spectral and Normal Modes methods. Introduction to beamforming, including matched field processing. Computer programs will be constructed on all subjects covered.",
  "prerequisite": "graduate standing or consent of instructor. Kuperman"
 },
 {
  "code": "SIOC 200B",
  "title": "Computational Ocean Acoustics and Signal Processing II",
  "unit": "4",
  "description": "Continuation of SIOC 200A. Range dependent propagation models, including adiabatic and coupled mode models and parabolic equations. More advanced topics in matched field processing.",
  "prerequisite": "graduate standing and SIOC 200A or SIO 200A or consent of instructor. Kuperman"
 },
 {
  "code": "SIOC 200C",
  "title": "Computational Ocean Acoustics and Signal Processing III",
  "unit": "4",
  "description": "Continuation of SIOC 200B. Modeling interference such as ambient noise. Time domain methods. Matched field tomography, nonlinear optimization methods, and geophysical inversion.",
  "prerequisite": "graduate standing and SIOC 200B or SIO 200B or consent of instructor. Kuperman"
 },
 {
  "code": "SIOC 201",
  "title": "Geological Record of Climate Change",
  "unit": "4",
  "description": "Introduction to geological archives; the tools for paleoclimate reconstruction and a sampling of important issues from the geological record, including the development of “greenhouse” and “icehouse” worlds, the origin and evolution of glacial cycles, and the origin of “millennial scale” climate variability.",
  "prerequisite": "chemistry and physics required for graduate admission to SIO, SIO 101 or equivalent, or consent of instructor. Charles"
 },
 {
  "code": "SIOC 202A-B",
  "title": "Fundamentals of Wave Physics",
  "unit": "4-4",
  "description": "This two-quarter sequence is designed to introduce a broad background of students to basic principles of wave physics, including generation, propagation, dispersion, refraction, diffraction, reflection, waveguides, etc. A variety of wave motions of environmental relevance, including acoustic, ocean surface and internal (SIOC 202A), optical and seismic (SIOC 202B) are used to illustrate these principles. In-class experiments, data collection, and analysis exercises are incorporated.",
  "prerequisite": "calculus and partial differential equations. Kuperman, Melville, Stramski, Gerstoft"
 },
 {
  "code": "SIOC 203A",
  "title": "Introduction to Applied Mathematics I",
  "unit": "4",
  "description": "Review of exact methods for ordinary differential equations. Expansions about regular and irregular singular points. Introduction to asymptotic expansions. Approximate methods for nonlinear differential equations. Regular and singular perturbation theory. Additional topics depending upon the interests of the instructor. Coscheduled with MAE 294BA.",
  "prerequisite": "MATH 110, MATH 120A, or consent of instructor."
 },
 {
  "code": "SIOC 203B",
  "title": "Introduction to Applied Mathematics II",
  "unit": "4",
  "description": "Asymptotic methods: method of steepest descent (if not covered in I) WKB, method of multiple scales, boundary layer theory. Elements of complex analysis. Coscheduled with MAE 294B.",
  "prerequisite": "MAE 294A or SIOC 203A or SIO 203A or consent of instructor."
 },
 {
  "code": "SIOC 203C",
  "title": "Introduction to Applied Mathematics III",
  "unit": "5",
  "description": "Partial differential equations: characteristics, similarity solutions, Green's functions, images, wave equation, diffusion equation, Laplace's equation. Applications to continuum mechanics, potential fields, and transport phenomena such as diffusion, linear and nonlinear waves, Burger’s equation, shocks, and other topics. Other topics according to the interests of the instructor. Coscheduled with MAE 294C.",
  "prerequisite": "graduate standing and MAE 294B or SIOC 203B or SIO 203B or SIOC 215B or SIO 215B or consent of instructor. W. Young"
 },
 {
  "code": "SIOC 204",
  "title": "Underwater Acoustics",
  "unit": "4",
  "description": "Theory of radiation, transmission, and scattering of sound with special application to ocean acoustics.",
  "prerequisite": "graduate standing or consent of instructor. Buckingham"
 },
 {
  "code": "SIOC 205",
  "title": "Estuarine and Coastal Processes",
  "unit": "4",
  "description": "The course focuses on estuarine and coastal physical dynamics and biogeochemical/ecosystem impacts. Topics are adjusted for student interest, but include turbulence and the bottom boundary layer, tides (origin and propagation), estuary types, tidally averaged dynamics, temporal variation, stratification, lateral processes and fronts, dispersion mechanisms, sediment transport, estuarine productivity (nutrients, oxygen, and eutrophication), estuarine ecosystems, river plumes, and coastal upwelling.",
  "prerequisite": "graduate standing or consent of instructor. (Letter grades only.) Giddings"
 },
 {
  "code": "SIOC 206",
  "title": "Land Surface Hydrology",
  "unit": "4",
  "description": "Advanced introduction to natural processes that govern water occurrence and transport over the land surface. Principles of global hydrologic cycle and land-surface water balance, runoff and fluvial geomorphology, infiltration and subsurface water flow, evaporation and plant transpiration.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 207A",
  "title": "Fundamentals of Digital Signal Processing",
  "unit": "4",
  "description": "Discussion of discrete-time signals and systems, Discrete-Time Fourier Transform (DFT) and window functions, Fast Fourier Transform (FFT), design of Finite Impulse Response (FIR) and Infinite Impulse Response (IIR) digital filters and their implementations, finite word length effects, applications to data acquisition and analysis.",
  "prerequisite": "graduate standing or consent of instructor. Hodgkiss"
 },
 {
  "code": "SIOC 207B",
  "title": "Digital Signal Processing I",
  "unit": "4",
  "description": "Discrete random signals; conventional (FFT based) spectral estimation. Coherence and transfer function estimation; model-based spectral estimation; linear prediction and AR modeling, Levinson-Durbin algorithm and lattice filters, minimum variance spectrum estimation. Coscheduled with ECE 251A. (Recommended prerequisites: ECE 153 in addition to either ECE 161 or 161A and SIOC 207A or SIO 207A or equivalent background.)",
  "prerequisite": "graduate standing or consent of instructor. Hodgkiss, Rao"
 },
 {
  "code": "SIOC 207C",
  "title": "Digital Signal Processing II",
  "unit": "4",
  "description": "Adaptive filter theory, estimation errors for recursive least squares and gradient algorithms, convergence and tracking analysis of LMS, RLS, and Kalman filtering algorithms, comparative performance of Wiener and adaptive filters, transversal and lattice filter implementations, performance analysis for equalization, noise canceling, and linear prediction applications. Coscheduled with ECE 251B. (Recommended Prerequisites: ECE 251A or ECE 251AN.)",
  "prerequisite": null
 },
 {
  "code": "SIOC 207D",
  "title": "Array Processing",
  "unit": "4",
  "description": "The coherent processing of data collected from sensors distributed in space for signal enhancement and noise rejection purposes or wavefield directionality estimation. Conventional and adaptive beamforming. Matched field processing. Sparse array design and processing techniques. Applications to acoustics, geophysics, and electromagnetics. Coscheduled with ECE 251D. (Recommended Prerequisites: ECE251A or ECE 251AN.)",
  "prerequisite": "graduate standing; ECE 251C (for ECE 251D); SIOC 207C or SIO 207C (for SIOC 207D). Hodgkiss"
 },
 {
  "code": "SIOC 208",
  "title": "Seminar in Applied Ocean Sciences",
  "unit": "1",
  "description": "Topics in applied ocean sciences. One-hour seminar. (S/U grades only). Staff",
  "prerequisite": null
 },
 {
  "code": "SIOC 209",
  "title": "Special Topics",
  "unit": "1-4",
  "description": "Within the next few years, lectures on various special subjects will be offered by members of the staff. The emphasis will be on topics that reveal the interdependence of the biological, chemical, geological, and physical processes operating in the oceans. (S/U grades permitted.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOC 210",
  "title": "Physical Oceanography",
  "unit": "4",
  "description": "Physical description of the sea; physical properties of seawater, methods and measurements, boundary processes, regional oceanography.",
  "prerequisite": "graduate standing or consent of instructor. Talley"
 },
 {
  "code": "SIOC 211A",
  "title": "Ocean Waves I",
  "unit": "4",
  "description": "Propagation and dynamics of waves in the ocean, including the effects of stratification, rotation, topography, wind, and nonlinearity.",
  "prerequisite": "graduate standing or consent of instructor. Hendershott"
 },
 {
  "code": "SIOC 211B",
  "title": "Ocean Waves II",
  "unit": "4",
  "description": "Propagation and dynamics of waves in the ocean, including the effects of stratification, rotation, topography, wind, and nonlinearity.",
  "prerequisite": "graduate standing and SIOC 211A or SIO 211A and SIOC 214A or SIO 214A or consent of instructor. Melville"
 },
 {
  "code": "SIOC 212A",
  "title": "Geophysical Fluid Dynamics I",
  "unit": "4",
  "description": "The equations of motions for rotating stratified flow and their application to the atmospheric and oceanic dynamics; Ekman layer dynamics, potential vorticity dynamics, the quasigeostrophic approximation, theories of the wind- driven oceanic circulation, theories of the atmospheric Hadley circulation, geostrophic adjustment, and baroclinic instability.",
  "prerequisite": "graduate standing or consent of instructor. MacKinnon"
 },
 {
  "code": "SIOC 212B",
  "title": "Geophysical Fluid Dynamics II",
  "unit": "5",
  "description": "The equations of motion for rotating stratified flow and their application to the atmospheric and oceanic dynamics; Ekman layer dynamics, potential vorticity dynamics, the quasigeostrophic approximation, theories of the wind- driven oceanic circulation, theories of the atmospheric Hadley circulation, geostrophic adjustment, and baroclinic instability.",
  "prerequisite": "graduate standing and SIOC 212A or SIO 212A and SIOC 214A or SIO 214A or consent of instructor. Cessi"
 },
 {
  "code": "SIOC 213",
  "title": "Turbulence and Mixing",
  "unit": "4",
  "description": "Mixing mechanisms, their identification, description, and modeling. Introduction to turbulence, semi-empirical theories, importance of coherent structures, effects of stratification and rotation on turbulent structure, entrainment and mixing. (S/U grades permitted.) ",
  "prerequisite": "graduate standing or consent of instructor. Armi"
 },
 {
  "code": "SIOC 214A",
  "title": "Introduction to Fluid Mechanics",
  "unit": "4",
  "description": "A survey of classical problems in fluid mechanics and approximate techniques of analysis. Topics include conservation equations, straight laminar flows, low and high Reynolds number laminar flow, stability of laminar flows, turbulent flow.",
  "prerequisite": "graduate standing or consent of instructor. Hendershott"
 },
 {
  "code": "SIOC 214B",
  "title": "Environmental Fluid Dynamics",
  "unit": "4",
  "description": "Single-layer flows with a free surface; two-layer flows, including exchange flows in harbors, estuaries, seas, and buildings. Continuously stratified flows with meteorological and oceanographic applications. Topographic effects, plumes, jets, and thermals. Planetary boundary layers.",
  "prerequisite": "graduate standing or consent of instructor. Armi"
 },
 {
  "code": "SIOC 215A",
  "title": "Applied Mathematics for Oceanographers I",
  "unit": "4",
  "description": "Intended for first-year graduate students who seek a quantitative way to describe how the ocean works: vector analysis, complex quantities, Fourier and Laplace transforms, ordinary differential equations, nonhomogeneous ordinary differential equations, initial and boundary value problems, Heat and Laplace equations.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 215B",
  "title": "Applied Mathematics for Oceanographers II",
  "unit": "4",
  "description": "An introduction to the mathematical description of waves, beginning with a description of the linear oscillator, and followed by normal modes, the flexible string, membranes, water waves, ray theory, method of characteristics, and basic linear algebra.",
  "prerequisite": "graduate standing and SIOC 215A or SIO 215A or consent of instructor."
 },
 {
  "code": "SIOC 215C",
  "title": "Applied Mathematics for Oceanographers III",
  "unit": "4",
  "description": "An introduction to Perturbation theory, including regular and singular expansions, Poincare’s method, two-scale method, the WKB approximation and boundary layer theory.",
  "prerequisite": "graduate standing and SIOC 215A or SIO 215A and SIOC 215B or SIO 215B or consent of instructor."
 },
 {
  "code": "SIOC 216A",
  "title": "Introduction to the Physics of Complex Systems",
  "unit": "4",
  "description": "Emergent complex behavior in nonlinear, dissipative, open dynamical systems will be investigated by studying fundamental properties and their manifestation in examples drawn from the physical and biological sciences. Topics to include fractals, chaos, self-organization, artificial life, and neural networks.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Werner"
 },
 {
  "code": "SIOC 216B",
  "title": "Applied Complexity",
  "unit": "4",
  "description": "A project-based course focusing on applying methods from the study of complex systems to messy, real-world physical, biological, or social problems. Projects will encompass choosing a problem, writing a proposal, carrying out research, writing up and presenting results, and working collaboratively.",
  "prerequisite": "SIO 216 or SIOC 216 or SIOC 216A and graduate standing or consent of instructor. Werner"
 },
 {
  "code": "SIOC 217A",
  "title": "Atmospheric and Climate Sciences I",
  "unit": "4",
  "description": "Thermodynamics and statics of dry and moist air, atmospheric composition, Earth radiation budget, vertical structure of the atmosphere, global energy balance, thermodynamic feedbacks in the climate system.",
  "prerequisite": "graduate standing or consent of instructor. (Letter grades only.) Russell"
 },
 {
  "code": "SIOC 217B",
  "title": "Atmospheric and Climate Sciences II",
  "unit": "4",
  "description": "Fluid dynamics of the atmosphere; derivation of governing equations from the laws of physics, scale analysis, conservation principles, theoretical and observed structure of midlatitude synoptic systems; gradient wind and thermal wind approximations, geostrophic and quasigeostrophic approximations; potential vorticity, Rossby waves, climate and weather phenomena such as jet streams and cyclones.",
  "prerequisite": "graduate standing and SIOC 217A or SIO 217A or consent of instructor. Eisenman"
 },
 {
  "code": "SIOC 217C",
  "title": "Atmospheric and Climate Sciences III",
  "unit": "4",
  "description": "Radiative, physical, and dynamical processes that govern the mean state, variability, and change of the atmosphere and climate, including greenhouse gases, clouds and aerosols, convection and precipitation, general circulation, and coupled atmosphere-ocean interactions.",
  "prerequisite": "graduate standing and SIOC 217A or SIO 217A and SIOC 217B or SIO 217B, or consent of instructor. Norris"
 },
 {
  "code": "SIOC 217D",
  "title": "Atmospheric and Climate Sciences IV",
  "unit": "4",
  "description": "Atmospheric chemistry that impacts climate change, including photochemical reactions, ozone chemistry, and aerosol evolution in the troposphere and stratosphere. Atmospheric applications of catalytic cycles, heterogeneous chemistry, and microphysical processes will include the ozone hole, urban smog, and aerosol-cloud interactions.",
  "prerequisite": "SIOC 217A or SIO 217A and SIOC 217B or SIO 217B and SIOC 217C or SIO 217C. Russell"
 },
 {
  "code": "SIOC 218",
  "title": "Cloud Dynamics and Climate",
  "unit": "4",
  "description": "Cloud identification, cloud properties, dynamical processes governing formation and dissipation of different cloud types, impact of clouds on radiation flux and climate.",
  "prerequisite": "graduate standing and SIOC 217A or SIO 217A and SIOC 217B or SIO 217B. Nongraduate students may enroll with consent of instructor."
 },
 {
  "code": "SIOC 218A",
  "title": "Observational Techniques in Oceanography",
  "unit": "4",
  "description": "The course teaches practical knowledge of oceanographic methods, sensors, and platforms, with a focus on physical observations. Uses mixture of lectures, online information, lab demonstrations, practical exercises, student presentations, and manufacturers' visits.",
  "prerequisite": "graduate standing; basic knowledge of physical oceanography and physical principles. For graduate students in an oceanographic discipline, and graduate or third- or fourth-year undergraduate students in physics or engineering with an interest in ocean observations."
 },
 {
  "code": "SIOC 218B",
  "title": "Observational Techniques in Oceanography: At-Sea Practicum",
  "unit": "4",
  "description": "Practicum focused on preparing for and carrying out on-site fieldwork using state-of-the art methods (e.g., executing mooring-based data collection with physical, chemical, biological sensors). Teaches ship/deck skills, sensor and mooring preparation, cruise planning/execution, data analysis, cruise-report preparation.",
  "prerequisite": "graduate standing; basic knowledge of oceanography and data analysis. For graduate students in an oceanographic discipline, and graduate students in physics or engineering with an interest in ocean observations."
 },
 {
  "code": "SIOC 219",
  "title": "Special Topics in Physical Oceanography",
  "unit": "1-4",
  "description": "Example topics are case histories and methods in physical oceanography, theories of the ocean circulation, numerical methods in large-scale ocean and atmospheric models, and natural electromagnetic phenomena in the earth and the oceans. (S/U grades permitted.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOC 220",
  "title": "Observations of Large-Scale Ocean Circulation",
  "unit": "4",
  "description": "General circulation of the oceans; tropical, subtropical, and high-latitude current systems of the Atlantic, Indian, and Pacific Oceans and marginal seas; ocean heat flux and thermohaline circulations; observational basis of large- scale dynamics.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Roemmich"
 },
 {
  "code": "SIOC 221A",
  "title": "Analysis of Physical Oceanographic Data (A)",
  "unit": "4",
  "description": "Fundamental elements of analysis of geophysical and oceanographic time series, including sampling problems, least squares techniques, spectral analysis, interpretation of series, design of experiments.",
  "prerequisite": "consent of instructor. Pinkel"
 },
 {
  "code": "SIOC 221B",
  "title": "Analysis of Physical Oceanographic Data (B)",
  "unit": "4",
  "description": "Techniques for analysis of physical oceanographic data involving many simultaneous processes, including probability densities, sampling errors, spectral analysis, empirical orthogonal functions, correlation, linear estimation, objective mapping.",
  "prerequisite": "SIOC 221A or SIO 221A or consent of instructor. (S/U grades permitted.) Rudnick"
 },
 {
  "code": "SIOC 221C",
  "title": "Data Analysis Laboratory",
  "unit": "4",
  "description": "This course is to give students practical experience with analysis techniques. Students complete three projects. Topics include empirical orthogonal functions, objective mapping, complex demodulation, inference of geostrophic flow, minimization of CTD salinity spiking, isolation of wind-driven currents, wavelets.",
  "prerequisite": "SIOC 221A or SIO 221A and SIOC 221B or SIO 221B or consent of instructor. (S/U grades only.) Gille"
 },
 {
  "code": "SIOC 222",
  "title": "Underwater Bioacoustics",
  "unit": "4",
  "description": "Introductory course to familiarize a broad spectrum of participants to underwater sound and its relationship to underwater animals. Basic physics of sound propagation, use of sound to study underwater animals, and the sounds made by the animals themselves for echolocation and communication will be covered.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 223",
  "title": "Proposal Writing and Oceanographic Experiment Design",
  "unit": "4",
  "description": "Students will use concepts developed in class to develop ideas for an observational experiment, culminating in the writing of a NSF-style proposal and oral presentation of the proposed project. This effort will include identification of a tractable scientific problem, background research, development of an appropriate measurement program, and the writing of a compelling science proposal. Course will provide an opportunity to synthesize scientific, technical, and practical concepts presented in class.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 224",
  "title": "Numerical Modeling of the Climate System",
  "unit": "4",
  "description": "Introduction to the methods used in numerical models of the ocean and atmosphere; survey of numerical methods, introduced in the context of a series of example problems; overview of the equations represented in general circulation models (GCMs) of the atmosphere and ocean, and additional numerical methods used in these models; adjoint methods for state estimation, analysis of GCM output, and other related topics. ",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 225",
  "title": "Ice Sheet-Ocean Interactions",
  "unit": "4",
  "description": "Melting of glaciers and ice shelves by the ocean has emerged as a driver of rapid ice loss from Greenland and Antarctica, and hence sea level rise. In turn, melting of Greenland and Antarctica impacts ocean circulation and marine ecosystems. This interdisciplinary course covers basic glacier and ice sheet dynamics, fjord and ice shelf cavity circulation, melting of ice in the ocean and the current state of observations, models and theories of ice sheet ocean interactions at both hemispheres. Recommended preparation: Some introduction to physical oceanography and introductory calculus is helpful. The course is designed for an interdisciplinary group of students.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 235",
  "title": "Ocean-Atmosphere Interaction and Climate",
  "unit": "4",
  "description": "The class discusses ocean-atmosphere interaction dynamics that cause climate to vary in space and time, and form the physical basis for predicting year-to- year climate variability and projecting future climate change in the face of global warming.",
  "prerequisite": "graduate standing, SIO 210 or SIOC 210 and SIO 211A or SIO 211B or SIO 212A or SIO 212B or SIO 217A or SIO 217B or SIOC 211A or SIOC 211B or SIOC 212A or SIOC 212B or SIOC 217A or SIOC 217B or consent of instructor."
 },
 {
  "code": "SIOC 237A",
  "title": "Introduction to Ocean Optics",
  "unit": "4",
  "description": "Overview of ocean optics. Concepts in radiometry. Inherent and apparent optical properties. Radiative transfer equation. Light absorption and scattering by seawater constituents. Optics of air-water interface. Light fields within and leaving the ocean. Optics of marine particles. Measurement methods and instrumentation. Recommended preparation: basic physics and differential calculus.",
  "prerequisite": "graduate standing or consent of instructor. Stramski"
 },
 {
  "code": "SIOC 237B",
  "title": "Ocean Color Remote Sensing",
  "unit": "4",
  "description": "Overview of ocean color satellite missions. Concepts in radiometry. Inherent and apparent optical properties. Radiative transfer equation. Solar radiation and elements of atmospheric optics. Propagation of light across the sea surface and within the ocean. Light absorption and scattering by seawater. Water-leaving radiance and remote-sensing reflectance. Ocean color algorithms and applications. Recommended preparation: basic physics and differential calculus.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Stramski"
 },
 {
  "code": "SIOC 237C",
  "title": "Optical-Biological Interactions in the Ocean",
  "unit": "4",
  "description": "This is a course on the interactions of underwater light with marine plankton and animals. Topics include basic physics of interaction of light and matter, optical properties of marine plankton, optical and biological effects associated with interactions of light with marine organisms, and optical methods and their applications to the study of ocean biology. Course meetings consist of approximately 75 percent lectures by instructor and 25 percent student presentations and discussions of selected papers. Renumbered from SIO 237C. Students will not receive credit for SIOC 237C and SIO 237C. Recommended preparation: basic physics and biology. (Letter grades only.) Stramski",
  "prerequisite": null
 },
 {
  "code": "SIOC 238",
  "title": "Sensor Networks",
  "unit": "4",
  "description": "Characteristics of chemical, biological, seismic, and other physical sensors; signal processing techniques supporting distributed detection of salient events; wireless communication and networking protocols supporting formation of robust sensor fabrics; current experience with low power, low cost sensor deployments. Renumbered from SIO 238. Students may not receive credit for SIOC 238 and SIO 238. May be coscheduled with MAE 149 and ECE 156.",
  "prerequisite": "upper-division standing and approval of instructor, or graduate student in science or engineering. (S/U grades permitted.) Hodgkiss"
 },
 {
  "code": "SIOC 250",
  "title": "Advanced Atmospheric Dynamics",
  "unit": "4",
  "description": "Advanced topics in atmospheric dynamics not covered in the SIO 217 sequence, including baroclinic instability, mechanisms driving the general circulation of the troposphere and stratosphere, tropical waves, hurricanes and mesoscale phenomena, teleconnections, and spatially coherent patterns of variability.",
  "prerequisite": "SIOC 212A or SIO 212A or SIOC 217B or SIO 217B or consent of instructor."
 },
 {
  "code": "SIOC 251",
  "title": "Radiation in the Atmosphere",
  "unit": "4",
  "description": "This graduate-level core course in radiation provides an introduction to basic laws, radiative transfer under clear sky conditions, scattering by individual particles, multiple scattering, radiative properties of clouds and aerosols, the global energy budget, and applications to satellite meteorology.",
  "prerequisite": "graduate standing or consent of instructor. (Letter grades only.) Evan"
 },
 {
  "code": "SIOC 254",
  "title": "Science of Climate Change",
  "unit": "4",
  "description": "This course will provide the scientific basis for understanding climate change. The focus will be on the twentieth century and understanding the various natural and anthropogenic factors and feedback processes that are contributing to the observed climate changes, including extreme events. The students will develop a climate model and explore ways to slow down future changes.",
  "prerequisite": "SIOC 217A or SIO 217A or consent of instructor."
 },
 {
  "code": "SIOC 261",
  "title": "Nearshore Physical Oceanography",
  "unit": "4",
  "description": "This course will cover the basic physics of the nearshore region spanning the surf zone to the inner shelf. Topics covered will include wave shoaling, shoaling and breaking, radiation stress and vortex force formalisms, wave setup, wave driven currents in the surf zone and inner shelf, undertow, infragravity waves, basics of sediment transport, and transport and mixing.",
  "prerequisite": "SIOC 202A or SIOC 211A or SIOC 214A or consent of instructor."
 },
 {
  "code": "SIOC 267",
  "title": "Biogeochemistry",
  "unit": "4",
  "description": "Examines quantitatively the impact of the biota on the chemistry of the atmosphere and ocean. Emphasis given to isotopes as tracers of biogeochemical processes. Attention given to paleoclimatic and paleoatmospheric data from ice cores to reveal mechanisms.",
  "prerequisite": "graduate standing or consent of instructor. Severinghaus, R. Keeling"
 },
 {
  "code": "SIOC 290S",
  "title": "Climate Math and Science",
  "unit": "6",
  "description": "The course will introduce key physical and biogeochemical concepts needed to understand the Earth’s climate system. The overview will provide a foundation for examining the physical evidence of climate change. Mathematical methods will be presented to reinforce the scientific concepts. Students will complete group papers and presentations and lead discussions on assigned readings. SIOC 290S is a required course in the curriculum of the master of advanced studies—climate science and policy. (Letter grades only.)",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 291S",
  "title": "Introduction to Climate Policy",
  "unit": "6",
  "description": "The course will focus on policy solutions to climate change and introduce key topics in state, national, and international environmental law and policy. The energy system as well as energy policy will be examined, providing essential foundation for understanding California's renewable energy policy goals and how we may get there. Students will complete group papers and presentations and lead discussions on assigned readings. This course will include a one-week field trip (Letter grades only.)",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 292",
  "title": "Introduction to Climate Science and Policy",
  "unit": "4",
  "description": "This course explores the interaction between climate science, policy, and the larger culture. (S/U grades permitted).",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 293",
  "title": "Ocean-Atmosphere Processes and Climate Variability",
  "unit": "4",
  "description": "We will examine the general structure of the ocean and atmosphere and consider processes and interactions that contribute to climate variability. We will describe dominant climate modes of variability, such as ENSO, and evaluate processes driving climate changes on longer timescales, such as ice ages and deglaciation. Finally, we will explore how climate system processes and feedbacks modulate the impacts of anthropogenic greenhouse gases, and how they may be impacted in a warming climate.",
  "prerequisite": "SIOC 290S and graduate standing or consent of instructor."
 },
 {
  "code": "SIOC 296",
  "title": "Climate Science and Policy Forum",
  "unit": "1",
  "description": "This required course for MAS-CSP students will focus on the development of MAS Capstone Projects and discussions covering climate science and policy issues, including informal student presentations on political, economic, historical, educational, and natural science issues related to climate science and policy. (Letter grades only.) May be taken for credit three times.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "SIOC 299",
  "title": "Climate Science and Policy Capstone Project",
  "unit": "6-10",
  "description": "Building on the knowledge and experience gained from the entire curriculum of the master’s in climate science and policy (MAS-CSP) program, students will design and present a specific climate science and policy project. May be taken for credit one time for a maximum of ten units. (S/U grades only.)",
  "prerequisite": "graduate standing. Only students registered in MAS-CSP program."
 },
 {
  "code": "SIOG 222",
  "title": "Introduction to Industry Reflection Seismic Methods",
  "unit": "4",
  "description": "Seismic methods history; land and marine seismic sources and receivers; seismic wave types; basics of reflection data processing and imaging; vertical seismic profiling; well logs, 1-D synthetics, seismic-well ties; reflection data facies and fluids interpretation in geological settings; emerging reflection seismic methods.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Srnka, Leonard"
 },
 {
  "code": "SIOG 223A",
  "title": "Geophysical Data Analysis I",
  "unit": "4",
  "description": "Probability and statistics and their application to make inferences from geophysical data: point processes, distributions, maximum likelihood estimation, hypothesis testing and confidence intervals, least squares, density estimation, interpolation and smoothing.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOG 223B",
  "title": "Geophysical Data Analysis II",
  "unit": "4",
  "description": "Analysis of geophysical measurements, especially time series, Fourier theory digital signal processing, and spectral analysis.",
  "prerequisite": "graduate standing and SIOG 223A or SIO 223A or consent of instructor. Agnew"
 },
 {
  "code": "SIOG 224",
  "title": "Internal Constitution of the Earth",
  "unit": "4",
  "description": "An examination of current knowledge about the composition and state of the Earth’s interior revealed by geophysical observations. Seismic velocity and mass density distributions; equations of state; phase changes; energy balance and temperatures; constraints on composition from extraterrestrial samples and exposed rocks; spherical and aspherical variations of properties. Recommended preparation: calculus and differential equations, basic chemistry and physics.",
  "prerequisite": "graduate standing or consent of instructor. Masters, Stegman"
 },
 {
  "code": "SIOG 225",
  "title": "Physics of Earth Materials",
  "unit": "4",
  "description": "Mathematics and physics of continuous media, focusing on geophysical problems. Topics include deformation, stress, conservation laws, elasticity, attenuation, viscoelasticity, fracture mechanics, and porous media.",
  "prerequisite": "graduate standing or consent of instructor. Agnew, Fialko"
 },
 {
  "code": "SIOG 226",
  "title": "Introduction to Marine Geophysics",
  "unit": "4",
  "description": "Methods of exploration geophysics with emphasis on those useful at sea. Magnetic and gravitational potential field methods, multibeam echo sounding reflection and refraction seismology will be covered. Recent papers from the literature will also be read and discussed. Recommended preparation: differential equations; at least one geology course.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Dorman, Chadwell"
 },
 {
  "code": "SIOG 227A",
  "title": "Introduction to Seismology",
  "unit": "4",
  "description": "Introduction to seismometers and seismograms; stress and strain; potentials and the wave equation; geometrical ray theory and travel times in layered media; representation of seismic sources; WKBJ and synthetic seismograms; seismic hazards and other applications of seismology.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Shearer"
 },
 {
  "code": "SIOG 227B",
  "title": "Advanced Seismology I",
  "unit": "4",
  "description": "Introduction to low-frequency digital data; continuum mechanics and the equations of motion; free oscillation solutions; construction of Earth models; excitation of free-oscillations and source mechanism retrieval; array processing of long-period data; modelling aspherical structure; surface waves.",
  "prerequisite": "SIOG 227A or SIO 227A or consent of instructor. (S/U grades permitted.) Masters"
 },
 {
  "code": "SIOG 227C",
  "title": "Advanced Seismology II",
  "unit": "4",
  "description": "High-frequency wave propagation; methods for computing synthetic seismograms, including WKBJ, reflectivity and finite differences; body-wave spectra; attenuation of body waves; source physics; reflection and refraction seismology; seismic tomography.",
  "prerequisite": "SIOG 227A or SIO 227A and SIOG 227B or SIO 227B or consent of instructor. (S/U grades permitted.) Staff"
 },
 {
  "code": "SIOG 229",
  "title": "Gravity and Geomagnetism",
  "unit": "4",
  "description": "Introduction to potential theory, with applications to gravity and geomagnetism. Topics include the geoid, spherical harmonics, Laplace's equation, the Dirichlet problem on a sphere, and Fourier methods. Gravity anomalies and geomagnetic field modeling and sources are discussed; also, paleomagnetic observations.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) C. Constable"
 },
 {
  "code": "SIOG 230",
  "title": "Introduction to Inverse Theory",
  "unit": "4",
  "description": "Solution of linear and nonlinear inverse problems in geophysics by optimization techniques such as norm minimization and linear programming. Construction of models by regularization; inference by bounding functionals. Illustrations from gravity, geomagnetism, and seismology.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) C. Constable"
 },
 {
  "code": "SIOG 231",
  "title": "Introduction to EM Methods in Geophysics",
  "unit": "4",
  "description": "Introduction to electromagnetic methods for both global geophysics and applied/exploration methods. Covers history of EM induction, conduction in rocks, binary mixing laws, self potential, induced polarization, DC resistivity, magnetotellurics, geomagnetic depth sounding, elementary inverse methods, global conductivity structure, and marine EM methods.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) S. Constable"
 },
 {
  "code": "SIOG 232",
  "title": "Ethical and Professional Science",
  "unit": "2",
  "description": "Review and group discussion of professional behavior and survival skills in the earth and ocean sciences, including ethics, data management, plagiarism, authorships, preparing proposals, public speaking, conflict of interest, working with industry.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades only.) C. Constable, S. Constable"
 },
 {
  "code": "SIOG 233",
  "title": "Introduction to Computing at SIO",
  "unit": "4",
  "description": "Introduction to the SIO computing environment and common software tools in geophysics and other disciplines. Topics include UNIX, Matlab, Postscript, GMT, LaTex, HTML, and a scientific programming language such as C or Fortran90.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Shearer, Tauxe"
 },
 {
  "code": "SIOG 234",
  "title": "Geodynamics",
  "unit": "4",
  "description": "A general course on the dynamics and kinematics of the solid earth based on the text of Turcotte and Schubert. Topics include plate tectonics, heat flow, lithospheric cooling, flexure, viscous flow, gravity, crustal dynamics, and other related topics.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Sandwell"
 },
 {
  "code": "SIOG 236",
  "title": "Satellite Remote Sensing",
  "unit": "4",
  "description": "Satellite remote sensing provides global observations of Earth to monitor environmental changes in land, oceans, and ice. Overview physical principles of remote sensing, including orbits, electromagnetic radiation, diffraction, electro-optical, and microwave systems. Weekly labs explore remote sensing data sets. Graduate students will also be required to write a term paper and do an oral presentation. Coscheduled with SIO 135.",
  "prerequisite": "graduate standing or consent of instructor. Sandwell"
 },
 {
  "code": "SIOG 237",
  "title": "Space Geodesy",
  "unit": "2",
  "description": "This course covers topics in space geodesy related to the recovery and interpretation of crustal deformation measured by the Global Positioning System (GPS) as well as Interferometric Synthetic Aperture Radar (InSAR). The topics rotate yearly depending on the needs of the mostly geophysics graduate students. The course involves weekly meetings and discussions of papers. Students are also encouraged to participate in optional field trips to perform geodetic surveys.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades only)"
 },
 {
  "code": "SIOG 238",
  "title": "Numerical Methods for Partial Differential Equations",
  "unit": "4",
  "description": "The course will discuss main numerical methods used to solve boundary and initial value problems involving partial differential equations, such as finite differences, finite elements, and boundary elements. The emphasis will be on practical implementation of the commonly used tools and algorithms. Examples from geophysical applications will be provided. Recommended preparation: calculus and linear algebra.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Fialko"
 },
 {
  "code": "SIOG 239",
  "title": "Special Topics in Geophysics",
  "unit": "1-4",
  "description": "Special course offerings by staff and visiting scientists. Example topics are seismic source theory, geophysical prospecting methods, dislocation theory and seismic mechanisms, tectonic interpretation of geodetic data, and dynamo theory. (S/U grades permitted.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOG 240",
  "title": "Marine Geology",
  "unit": "4",
  "description": "Introduction to the geomorphology, sedimentation, stratigraphy, volcanism, structural geology, tectonics, and geological history of the oceans.",
  "prerequisite": "graduate standing or consent of instructor. Castillo, Charles, Gee"
 },
 {
  "code": "SIOG 241",
  "title": "Geological Field Methods for Geophysicists",
  "unit": "1",
  "description": "This course is intended for precandidacy geophysics students who have little practical geological experience. We will learn to use: Brunton compasses, GPS, topographic and geological maps and airphotos, and proper note-taking habits. We will explore the geology of Fossil Canyon (near Ocotillo), learn to determine age relationships and how to read the rock record for clues about the geological history of the area, including the opening of the Gulf of California.",
  "prerequisite": "graduate standing or consent of instructor. Tauxe"
 },
 {
  "code": "SIOG 242",
  "title": "Rates and Dates: Applications of Modern Geochronology Methods",
  "unit": "4",
  "description": "This course is designed to give students an understanding of the science behind numerical dating techniques in geological, archaeological, and environmental science contexts. This course will provide a background in the physics of radioactive decay and natural radiation sources and the geochemistry necessary for measurement that are critical to radiometric dating methods, and nonradiometric alternatives.",
  "prerequisite": "graduate standing."
 },
 {
  "code": "SIOG 243",
  "title": "Material Characterization",
  "unit": "4",
  "description": "Survey course in materials characterization geared in the earth, environmental, planetary, oceanographic, and biological sciences. Emphasis placed on surface analysis techniques. The course will introduce theoretical framework for spectroscopy, diffraction, and imaging methods used in structural and compositional characterization of materials. Techniques covered include SEM, TEM, IR, and Raman spectroscopy, laser ablation ICP-MS, etc. A term project will incorporate hands-on experience using SEM.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Van Allen"
 },
 {
  "code": "SIOG 244",
  "title": "Shape and Structure of the Ocean Floor",
  "unit": "4",
  "description": "Description and explanation of the structural geomorphology of oceanic crust, and of the tectonic and volcanic processes responsible for it. Description and interpretation of deep-sea sedimentary landforms (e.g., deep-sea fans, drifts, bedforms) and of the bottom currents that shape them. Offered in alternate years.",
  "prerequisite": "graduate standing or consent of instructor. Lonsdale"
 },
 {
  "code": "SIOG 245",
  "title": "Marine Sediments-Paleo Proxies",
  "unit": "4",
  "description": "On the chemical and isotopic records of marine sediments and implications for the history of seawater chemistry and paleoceanography. Will concentrate on the isotopic systems: Li, B, C, O, S, Sr, and Nd, in marine phases that reliably preserve the records, and on associated diagenetic problems.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Kastner"
 },
 {
  "code": "SIOG 246",
  "title": "Global Tectonics and Basin Formation",
  "unit": "4",
  "description": "Plate tectonics of the crust and upper mantle, examining a variety of environments from ridge crests to continental margins, including plate interiors, with an emphasis on basin formation in these tectonic settings.",
  "prerequisite": "graduate standing or consent of instructor. Cande, Driscoll"
 },
 {
  "code": "SIOG 247",
  "title": "Rock Magnetism and Paleomagnetism",
  "unit": "4",
  "description": "Rock magnetism and acquisition of magnetic remanence in geological materials as well as laboratory procedures and data analysis (isolating remanence components and statistical approaches). The paleomagnetic literature will be used to illustrate applications in geological and geophysical problems. Recommended preparation: one year each of college-level physics and geology; mathematics through calculus.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Tauxe"
 },
 {
  "code": "SIOG 249",
  "title": "Special Topics in Marine Geology",
  "unit": "1-4",
  "description": "Special course offerings by staff and visiting scientists. (S/U grades only.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOG 251",
  "title": "Whole Earth Geochemistry",
  "unit": "4",
  "description": "A geochemical overview of Earth materials and chemical processes involved in the Earth’s evolution. Topics include formation and differentiation of the Earth, linkages between the solid Earth and the atmosphere/ hydrosphere, and isotope and trace element composition of igneous and metamorphic rocks. Graduate students, additionally, must submit a term paper in one aspect of work discussed during the quarter to be presented orally in class.",
  "prerequisite": "graduate standing or consent of instructor. Hilton"
 },
 {
  "code": "SIOG 252A",
  "title": "Introduction to Isotope Geochemistry",
  "unit": "4",
  "description": "Radioactive and stable isotope studies in geology and geochemistry, including geochronology, isotopes as tracers of magmatic processes, cosmic-ray produced isotopes as tracers in the crust and weathering cycle, isotopic evolution of the crust and mantle. Graduate level requires student presentation. Conjoined with SIO 144.",
  "prerequisite": "graduate-level standing or consent of instructor. Castillo, Keeling"
 },
 {
  "code": "SIOG 252B",
  "title": "Advanced Isotope Geochemistry I",
  "unit": "4",
  "description": "An advanced treatment of noble gas and stable isotope geochemistry. Offered in alternate years with SIO 252C.",
  "prerequisite": "SIOG 252A or SIO 252A. Castillo, Keeling"
 },
 {
  "code": "SIOG 252C",
  "title": "Advanced Isotope Geochemistry II",
  "unit": "4",
  "description": "An advanced treatment of radiogenic and cosmogenic isotope geochemistry. Offered in alternate years with SIO 252B.",
  "prerequisite": "SIOG 252A or SIO 252A and SIOG 252B or SIO 252B."
 },
 {
  "code": "SIOG 253",
  "title": "Interactions of Oceanic Plates and the California Margin",
  "unit": "4",
  "description": "How the geology of Alta and Baja California has been shaped, especially in the past 30MYR, by changing patterns of ocean plates and microplates that have subducted beneath the North American Margin, slid obliquely past it, and captured continental crust.",
  "prerequisite": "graduate standing, or consent of instructor. Lonsdale"
 },
 {
  "code": "SIOG 255",
  "title": "Paleobiology and History of Life",
  "unit": "6",
  "description": "An introduction to the major biological transitions in Earth history from the origins of metabolism and cells to the evolution of complex societies. The nature and limitations of the fossil record, patterns of adaptation and diversity, and the tempo and mode of biological evolution. Laboratories and substantial field component complement and extend lecture material. Program and/or materials fees may apply. Graduate students, additionally, will give oral presentation or research paper. Coscheduled with SIO 104.",
  "prerequisite": "graduate-level standing or consent of instructor. R. Norris"
 },
 {
  "code": "SIOG 255A",
  "title": "Topics in Paleobiology and History of Life",
  "unit": "3",
  "description": "Lecture topics on the major transitions in the evolutionary history of life, including origin of metabolisms, microbes, major eukaryote radiations, ecosystems, and societies.",
  "prerequisite": "graduate standing or consent of instructor. R. Norris"
 },
 {
  "code": "SIOG 257",
  "title": "Seminar in Petrology",
  "unit": "4",
  "description": "Discussion of current research in petrology and mineralogy. (S/U grades permitted.)",
  "prerequisite": null
 },
 {
  "code": "SIOG 260",
  "title": "Marine Chemistry",
  "unit": "4",
  "description": "Chemical description of the sea; the distribution of chemical species in the world oceans, and their relationships to physical, biological, and geological processes. Aluwihare, Barbeau, Dickson, Martz",
  "prerequisite": null
 },
 {
  "code": "SIOG 261",
  "title": "Introduction to Rheology of Solid Earth",
  "unit": "4",
  "description": "This course provides a framework for understanding the intrinsic properties of rocks (mineralogy, diffusion, deformation). It explores fundamental aspects of geological processes with an emphasis on the interpretation of geophysical data. The course focuses on micro-, rock-, and planet-scale mechanisms.",
  "prerequisite": "graduate standing or consent of instructor. A. Pommier"
 },
 {
  "code": "SIOG 263",
  "title": "Aqueous Chemistry",
  "unit": "4",
  "description": "This course emphasizes the chemical principles that control basic aqueous chemistry in marine systems. The focus will be to show that the geochemistry of the various elements in sea water and biological systems can be understood as a consequence of basic general chemical concepts such as electron structure, chemical bonding, and group and periodic properties. Recommended preparation: undergraduate chemistry equivalent to UC San Diego CHEM 6 sequence.",
  "prerequisite": "graduate standing or consent of instructor. Dickson"
 },
 {
  "code": "SIOG 267",
  "title": "Marine Chemistry Laboratory",
  "unit": "4",
  "description": "Applies modern and classic techniques for analysis of seawater chemistry, introducing concepts of signal transduction, calibration, and measurement quality control, instrument communications, data processing.",
  "prerequisite": "graduate standing or consent of instructor. T. Martz"
 },
 {
  "code": "SIOG 268",
  "title": "Seminar in Geochemistry and Marine Chemistry",
  "unit": "2",
  "description": "Student seminars on topics related to geochemistry and the chemistry of the marine environment. (S/U grades only.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOG 269",
  "title": "Special Topics in Marine Chemistry",
  "unit": "1-4",
  "description": "Special course offerings by staff and visiting scientists. (S/U grades permitted.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOG 275",
  "title": "Paleoethnobotany",
  "unit": "6",
  "description": "(Cross-listed with ANTH 275.) This course provides an introduction to the fundamentals of practicing archaeobotany. How do archaeobotanists identify ancient plant remains in sites and how can we use this information to understand human subsistence and forestry regimes, animal feeding patterns, and climate change? Program or materials fees may apply. Students may not receive credit for ANTH 275 and SIOG 275. ",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Staff"
 },
 {
  "code": "SIOB 242A",
  "title": "Marine Biotechnology I: Tools and Methods",
  "unit": "4",
  "description": "The course will explore cutting-edge techniques as it applies to genomics, transcriptomics, proteomics, metabolomics, and the bioinformatics needed to analyze such data sets. Next generation sequencing, state-of-the-art mass spectrometry, and NMR techniques and bioinformatic challenges. Students may not receive credit for SIO 242A and SIO 242.",
  "prerequisite": "graduate standing or consent of instructor. Gaasterland, L. Gerwick"
 },
 {
  "code": "SIOB 242B",
  "title": "Marine Biotechnology II: Applications",
  "unit": "4",
  "description": "This course will explore the diverse biotechnological applications of marine science. Topics will include natural product drug discovery, biomaterials, nanotechnology, synthetic biology, aquaculture, and extremophiles. Students may not receive credit for SIO 242B and SIO 242.",
  "prerequisite": "SIOB 242A or SIO 242A or consent of instructor. Bartlett, Jensen"
 },
 {
  "code": "SIOB 242C",
  "title": "Marine Biotechnology III: Introduction to Bioinformatics",
  "unit": "4",
  "description": "Introduction to Unix commands and scripting techniques required for command line interaction with open source bioinformatics tools, including installation, configuration, and use for genome and transcriptome sequencing and assembly, gene expression analysis, and DNA- and RNA-binding protein binding site identification through ChIPseq. Emphasis is on how the bioinformatics tools work, how to use them, and their application to DNA and RNA data sets. Recommended preparation: prior programming skills will help the student gain more from the course. Students may not receive credit for SIO 242C if they have previously taken SIO 242.",
  "prerequisite": "SIOB 242A or SIO 242A and SIOB 242B or SIO 242B or consent of instructor."
 },
 {
  "code": "SIOB 243",
  "title": "Ecological and Medicinal Aspects of Natural Products",
  "unit": "2",
  "description": "This course will provide the foundation of the natural products sciences, including ethnobotanical uses of plants, ecological interactions and contemporary drug screening programs, and will increase awareness of the pervasiveness of natural products in pharmaceutical and other commercial products. Students may not receive credit for SPPS 281 and SIOB 243. W. Gerwick",
  "prerequisite": null
 },
 {
  "code": "SIOB 262",
  "title": "Marine Chemical Biology Seminar",
  "unit": "2",
  "description": "Students will give seminars on current research topics that span the interface of marine chemistry and marine biology. Topics will include natural products chemistry, biotechnology, biogeochemistry, and biochemistry relating to marine systems. May be taken for credit eighteen times.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades only.) Fenical, W. Gerwick, Moore"
 },
 {
  "code": "SIOB 264",
  "title": "Special Topics in Marine Natural Products Chemistry",
  "unit": "4",
  "description": "This course provides the foundation for advanced study in the field of marine natural products chemistry. Topics vary from the history of natural products to the organic chemistry of terpenes, alkaloids, acetogenins, and other natural product classes. Varying by topic quarterly, this class is given each quarter and may be repeated.",
  "prerequisite": "one-year general organic chemistry. (S/U grades only.) Fenical, W. Gerwick, Moore"
 },
 {
  "code": "SIOB 265",
  "title": "Marine Chemical Ecology",
  "unit": "4",
  "description": "Chemistry is the language by which most marine organisms communicate with each other and the environment. While we have yet to learn how to interpret much of this dialogue, it has become clear that natural products play pivotal roles in virtually every biotic process and interaction in the ocean. This course will broadly address the topic of marine chemical ecology, both at the macro- organism and microbiological scales.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOB 269",
  "title": "Interdisciplinary Forum for Environmental Research",
  "unit": "2",
  "description": "This course provides students from diverse disciplines with a common language to address problems related to the environment and conservation. The purpose is to promote collaboration and communications across departments and the course is open to all graduate students. Students who take the course for credit are expected to serve in the coordinating group to invite speakers and promote events across campus. May be taken for credit up to three times.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades only.) Staff"
 },
 {
  "code": "SIOB 270",
  "title": "Pelagic Ecology",
  "unit": "4",
  "description": "An analysis of the concepts and theories used to explain the biological events observed in the water column. Alternate years.",
  "prerequisite": "SIOC 210 or SIO 210 and SIOB 280 or SIO 280 or consent of instructor. Ohman, A. Allen"
 },
 {
  "code": "SIOB 270A",
  "title": "Fisheries Oceanography",
  "unit": "4",
  "description": "Aspects of marine ecology relevant to the reproduction, survival, and distribution of commercially important marine species. Alternate years only.",
  "prerequisite": "graduate standing or consent of instructor. Checkley"
 },
 {
  "code": "SIOB 271",
  "title": "Marine Zooplankton",
  "unit": "5",
  "description": "Lectures and laboratories treating the morphological, behavioral, and life history variations of the principal phyla of planktonic invertebrates and heterotrophic protists. Constraints of life at low Reynolds numbers; principles of allometry; growth processes of heterotrophic organisms.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Ohman"
 },
 {
  "code": "SIOB 272",
  "title": "Advanced Statistical Techniques",
  "unit": "4",
  "description": "An interactive overview of statistical methods, focusing on approaches common within the life sciences. Emphasis on the conceptual and logical basis of statistical methods. Topics include treatment of controlled experimental data through to model fitting and exploration of observational data. Recommended preparation: SIO 187, BIEB 100, or equivalent introductory statistics/ biostatistics course.",
  "prerequisite": "graduate standing or consent of instructor. Sandin"
 },
 {
  "code": "SIOB 273",
  "title": "Professional Ethics in Science",
  "unit": "2-4",
  "description": "A seminar on the historical and contemporary ethics and ethos of scientific research, based on published documents. Given in alternate years.",
  "prerequisite": "graduate standing and consent of instructor. Department stamp required. Dayton, Leichter"
 },
 {
  "code": "SIOB 274",
  "title": "Natural History Below the Tides",
  "unit": "6",
  "description": "Exposure to local underwater habitats by scuba with basic material to comply with AAUS certification. Lectures and shore dives in local coastal habitats (protected bay and outer coast sites). Aids students in diving research by providing experience with SIO scientists.",
  "prerequisite": "department stamp required. Students must qualify to take the SIO dive course. This includes a physical exam as well as swimming and diving proficiency. Dayton, Leichter ****"
 },
 {
  "code": "SIOB 275A",
  "title": "Benthic Ecology",
  "unit": "4",
  "description": "Evolution and maintenance of benthic communities from the terrestrial margins to the deep sea. Special emphasis will be placed on physical and biological scaling and processes determining patterns of distribution and abundance; interrelationships between community structure and population phenomena, including trophic relationships, reproductive and recruitment patterns, succession, and life history biology. Offered in alternate years with SIOB 275B.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Leichter, Levin"
 },
 {
  "code": "SIOB 275B",
  "title": "Natural History of Coastal Habitats",
  "unit": "6",
  "description": "The purpose of this class is to develop skills in natural history observation, appreciate the origins of natural diversity in the coast, desert, and mountain Southwest, and discuss the preservation and management of natural ecosystems.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Dayton, R. Norris"
 },
 {
  "code": "SIOB 276",
  "title": "Quantitative Theory of Populations and Communities",
  "unit": "4",
  "description": "An introduction to the quantitative tools and conceptual issues underlying the study of the dynamics and structure of ecological systems. Recommended preparation: three quarters of calculus.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Sugihara"
 },
 {
  "code": "SIOB 276L",
  "title": "Quantitative Ecology Project Lab",
  "unit": "4",
  "description": "A laboratory complement to SIOB 276, to apply quantitative tools to conceptual issues underlying the study of the dynamics and structure of ecological systems.",
  "prerequisite": "graduate standing, SIOB 276 or SIO 276 and consent of instructor. Department stamp. Sugihara"
 },
 {
  "code": "SIOB 277",
  "title": "Deep-Sea Biology",
  "unit": "4",
  "description": "The ecology, zoogeography, taxonomy, and evolution of deep-sea organisms, with emphasis on the benthos. Course includes one day cruise to the San Diego Trough to examine deep sea organisms (700-1200 meters) (two-hour steam from Point Loma). Offered alternate years.",
  "prerequisite": "graduate standing or consent of instructor. Levin"
 },
 {
  "code": "SIOB 278",
  "title": "Seminar in Ocean Biosciences",
  "unit": "2",
  "description": "Presentations of reports, review of literature, and discussion of current research in the marine biological and oceanographic sciences. (S/U grades permitted.) Staff",
  "prerequisite": null
 },
 {
  "code": "SIOB 279",
  "title": "Ecology Seminar in Biological Oceanography",
  "unit": "1",
  "description": "Weekly seminar for students in the biological oceanography curricular group. Lectures given by visiting scientists, resident staff, and students. May be taken for credit eighteen times.",
  "prerequisite": "graduate standing. (S/U grades only) Staff"
 },
 {
  "code": "SIOB 280",
  "title": "Biological Oceanography",
  "unit": "4",
  "description": "The biology and ecology of marine plankton, nekton, and benthos. Emphasis will be on processes regulating species, community, and ecosystem patterns and changes, including productivity, trophic relationships and species interactions with the physical, chemical, and geological environment. One or more field trips.",
  "prerequisite": "graduate standing or consent of instructor. Franks or Checkley, Levin"
 },
 {
  "code": "SIOB 281",
  "title": "Marine Physiology",
  "unit": "4",
  "description": "Biochemical and physiological mechanisms of adaptation of organisms to the marine environment. Special emphasis is on biological responses to temperature, salinity, carbon dioxide, pH and bicarbonate levels.",
  "prerequisite": "graduate standing or consent of instructor. Tresguerres"
 },
 {
  "code": "SIOB 282",
  "title": "Phytoplankton Diversity",
  "unit": "4",
  "description": "Molecular, biochemical, ecological, and evolutionary perspectives on the diversity of eukaryotic and prokaryotic phytoplankton.",
  "prerequisite": "graduate standing or consent of instructor. Palenik"
 },
 {
  "code": "SIOB 283",
  "title": "Phycology: Marine Plant Biology",
  "unit": "5",
  "description": "Lecture and laboratory course emphasizing the biology, ecology and taxonomy of marine plants and seaweeds. Laboratory work mainly involves examination, slide preparation and dissection of fresh material collected locally. An oral presentation on a current research topic is required. Program or course fee may apply. Graduate students, additionally, are required to write a research paper. Offered in alternate years. May be coscheduled with SIO 183. Renumbered from SIO 283. Students may not receive credit for SIO 283 and SIOB 283. Program or materials fees may apply.",
  "prerequisite": "graduate standing or consent of instructor. J. Smith"
 },
 {
  "code": "SIOB 284",
  "title": "Marine Invertebrates",
  "unit": "6",
  "description": "Course emphasizing the diversity, evolution and function morphology of marine invertebrates. Laboratory work involves examination of live and prepared specimens. An oral presentation on a current research topic is required. Graduate level additionally requires a research paper with extensive literature review and critical analyses. Program or course fee may apply.",
  "prerequisite": "graduate standing or consent of instructor. Rouse"
 },
 {
  "code": "SIOB 285",
  "title": "Physical-Biological Interactions",
  "unit": "4",
  "description": "Physical and biological processes affecting growth and patchiness of plankton. Concepts and equations from physical oceanography will be presented and explored in a biological context. Ideas will be treated both theoretically and with examples from the literature.",
  "prerequisite": "SIOC 210 or SIO 210 or consent of instructor. Franks"
 },
 {
  "code": "SIOB 286",
  "title": "Marine Science, Economics, and Policy",
  "unit": "4",
  "description": "This course investigates global issues in marine conservation and potential policy solutions. The approach is interdisciplinary, fast-paced, and discussion oriented. Students will become acquainted with sufficient background in marine biology, ecology, marine and conservation economics, international law, and policy as preparation for participation in discussion on real-world issues in marine conservation. Topics and instructors change each quarter.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Staff"
 },
 {
  "code": "SIOB 287A",
  "title": "Marine Microbial Ecology",
  "unit": "4",
  "description": "Recent developments in the study of marine bacteria. Emphasis will be on biochemical and physiological adaptations of marine bacteria to the ocean environment. Bacterial metabolism, growth, and death will also be discussed in the context of trophic interactions and flows of material and energy in marine ecosystems. Molecular biology techniques used in the study of bacterial ecology will also be discussed.",
  "prerequisite": "graduate standing or consent of instructor. (S/U grades permitted.) Azam"
 },
 {
  "code": "SIOB 287B",
  "title": "Microbial Physiology",
  "unit": "4",
  "description": "Prokaryotic cell biology will be discussed primarily from physiological and biochemical standpoints with focus on conceptual understanding, integration, and mechanism. Topics will vary from year to year but will include the following themes: bioenergetics, cell polarity, cell adhesion, the molecular basis of morphogenesis and differentiation, prokaryotic motility and behavior, rotary and linear molecular machines, bacterial organelles, pheromones and messengers, circadian rhythms, biological warfare, and bioremediation. Recommended preparation: BIBC 102, Metabolic Biochemistry; BICD 110, Cell Biology; BIMM 100, Molecular Biology, or equivalent background.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOB 289",
  "title": "Pollution, Environment, and Health",
  "unit": "4",
  "description": "The goal is to understand the scope of the pollution problem facing the planet. Students will learn the properties of chemicals in the environment and survey the biological mechanisms that determine their accumulation and toxicity. Graduate students will also be required to write a research paper.",
  "prerequisite": "graduate standing or consent of instructor. Hamdoun"
 },
 {
  "code": "SIOB 290",
  "title": "Marine Biology",
  "unit": "4",
  "description": "An introduction to the field of marine biology, especially to the diversity of marine organisms at all taxonomic levels and their adaptations to the marine environment.",
  "prerequisite": "graduate standing or consent of instructor. N. Holland"
 },
 {
  "code": "SIOB 291",
  "title": "Biology Graduate Research Presentations",
  "unit": "2",
  "description": "Graduate students in the biological sciences present research in a seminar or poster format. Class participants provide oral and written feedback on presentations. Required of second through fourth year students in the marine biology curricular group. Open to all SIO graduate students. (S/U grades only.)",
  "prerequisite": null
 },
 {
  "code": "SIOB 292",
  "title": "Communicating Science to Informal Audiences",
  "unit": "4",
  "description": "Graduate science students will develop fundamental communication and instructional skills through the understanding and application of learning theory, interpretive techniques, and pedagogical practices, including the development of an education/outreach plan to support a competitive research proposal. May be coscheduled with SIO 180. Renumbered from SIO 292. Students may not receive credit for SIO 292 and SIOB 292.",
  "prerequisite": "graduate standing or consent of instructor."
 },
 {
  "code": "SIOB 293",
  "title": "Applications of Phylogenetics",
  "unit": "6",
  "description": "Overview of the computer-based methods for constructing phylogenetic trees using morphological and molecular data. Lectures and labs cover evolutionary and ecological transformations, biodiversity measurements, biogeography, systematics and taxonomy. An independent project and presentation are required.",
  "prerequisite": "graduate standing or consent of instructor. Rouse"
 },
 {
  "code": "SIOB 294",
  "title": "Biology of Fishes",
  "unit": "5",
  "description": "The comparative evolution, morphology, physiology, and ecology of fishes. Special emphasis on local, deep-sea, and pelagic forms in laboratory.",
  "prerequisite": "graduate standing or consent of instructor. Hastings"
 },
 {
  "code": "SIOB 295",
  "title": "Behavior and Ecology of Fishes",
  "unit": "4",
  "description": "The course will review recent literature on the behavior and ecology of fishes with emphasis on phylogenetic interpretations of character evolution and/or implications for conservation biology. Topics covered may include habitat selection, foraging strategies, reproductive biology, ontogeny of behavior, speciation, radiations, macroecological patterns, specialized behaviors. Course is a mixture of lectures on the background of topics and student presentations.",
  "prerequisite": "graduate standing or consent of instructor. Hastings"
 },
 {
  "code": "SIOB 296",
  "title": "Special Topics in Ocean Biosciences",
  "unit": "1-5",
  "description": "Example topics are reproduction in marine animals, adaptation to marine environments, larval biology, marine fisheries, macromolecular evolution, physical chemical topics in physiology, philosophy of science.",
  "prerequisite": "graduate standing. (S/U grades permitted.) Staff"
 },
 {
  "code": "SIOB 297",
  "title": "Marine Biology Seminar",
  "unit": "1",
  "description": "Lectures given by visiting scientists and resident staff and students. May be taken for credit eighteen times.",
  "prerequisite": "graduate standing. (S/U grades only.) Staff"
 },
 {
  "code": "SIOB 298",
  "title": "Special Studies in Marine Sciences",
  "unit": "1-4",
  "description": "Reading and laboratory study of special topics under the direction of a faculty member. Exact subject matter to be arranged in individual cases.",
  "prerequisite": "graduate standing. (S/U grades permitted.) Staff"
 },
 {
  "code": "SIO 295S",
  "title": "Introduction to Marine Biodiversity and Conservation—Seminar",
  "unit": "8",
  "description": "Lectures on ecological, economic, social, and legal issues related to marine biodiversity and case studies on socioeconomic and legal issues. Students are expected to attend field trips at sea and to various sites around San Diego County as a part of the corequisite course. Students who have taken SIO 295 may not receive credit for SIO 295S. ",
  "prerequisite": null
 },
 {
  "code": "SIO 295LS",
  "title": "Introduction to Marine Biodiversity and Conservation—Lab",
  "unit": "8",
  "description": "Laboratory work on major biological taxa, field trips on biodiversity in situ, computer labs for informatic tools. Students are expected to attend field trips at sea and to various sites around San Diego County as a part of the course. Students who have taken SIO 295L may not receive credit for SIO 295LS. ",
  "prerequisite": null
 },
 {
  "code": "SIO 299",
  "title": "Research",
  "unit": "1-12",
  "description": "(S/U grades only.) Staff (F,W,S)",
  "prerequisite": null
 },
 {
  "code": "SIO 500",
  "title": "Teaching Apprenticeship",
  "unit": "1-4",
  "description": "This practicum for graduate students provides experience in teaching undergraduate oceanography courses.",
  "prerequisite": "department approval. (S/U grades only.) Staff"
 }
]