[
 {
  "code": "SOCI 1",
  "title": "Introduction to Sociology",
  "unit": "4",
  "discription": "An introduction to the organizing themes and ideas, empirical concerns, and analytical approaches of the discipline of sociology. The course focuses on both classical and contemporary views of modern society, on the nature of community, and on inequality, with special attention to class, race, and gender. Materials include both theoretical statements and case studies. Will not receive credit for SOCI 1 and SOCL 1A.",
  "prerequsite": null
 },
 {
  "code": "SOCI 2",
  "title": "The Study of Society",
  "unit": "4",
  "discription": "A continuation of Sociology/L 1A. The focus here is on socialization processes, culture, social reproduction and social control, and collective action. As in 1A, materials include both theoretical statements and case studies. While 1B may be taken as an independent course, it is recommended that students take 1A and 1B in sequence, as the latter builds on the former. Will not receive credit for SOCI 2 and SOCL 1B.",
  "prerequsite": null
 },
 {
  "code": "SOCI 10",
  "title": "American Society: Social Structure and Culture in the U.S.",
  "unit": "4",
  "discription": "An introduction to American society in historical, comparative, and contemporary perspectives. Topics will include American cultural traditions; industrialization; class structure; the welfare state; ethnic, racial, and gender relations; the changing position of religion; social movements; and political trends. Will not receive credit for SOCI 10 and SOCL 10.",
  "prerequsite": null
 },
 {
  "code": "SOCI 20",
  "title": "Social Change in the Modern World",
  "unit": "4",
  "discription": "A survey of the major economic, political, and social forces that have shaped the contemporary world. The course will provide an introduction to theories of social change, as well as prepare the student for upper-division work in comparative-historical sociology. Will not receive credit for SOCI 20 and SOCL 20.",
  "prerequsite": null
 },
 {
  "code": "SOCI 30",
  "title": "Science, Technology, and Society",
  "unit": "4",
  "discription": "A series of case studies of the relations between society and modern science, technology, and medicine. Global warming, reproductive medicine, AIDS, and other topical cases prompt students to view science-society interactions as problematic and complex. Will not receive credit for SOCI 30 and SOCL 30.",
  "prerequsite": null
 },
 {
  "code": "SOCI 40",
  "title": "Sociology of Health-Care Issues",
  "unit": "4",
  "discription": "Designed as a broad introduction to medicine as a social institution and its relationship to other institutions as well as its relation to society. It will make use of both micro and macro sociological work in this area and introduce students to sociological perspectives of contemporary health-care issues. Will not receive credit for SOCI 40 and SOCL 40.",
  "prerequsite": null
 },
 {
  "code": "SOCI 50",
  "title": "Introduction to Law and Society",
  "unit": "4",
  "discription": "Interrelationships between law and society, in the U.S. and other parts of the world. We examine law's norms, customs, culture, and institutions, and explain the proliferation of lawyers in the U.S. and the expansion of legal “rights” worldwide. Will not receive credit for SOCI 50 and SOCL 50.",
  "prerequsite": null
 },
 {
  "code": "SOCI 60",
  "title": "The Practice of Social Research",
  "unit": "4",
  "discription": "This course introduces students to the fundamental principles of the design of social research. It examines the key varieties of evidence, sampling methods, logic of comparison, and causal reasoning researchers use in their study of social issues. Will not receive credit for SOCI 60 and SOCL 60.",
  "prerequsite": null
 },
 {
  "code": "SOCI 70",
  "title": "General Sociology for Premedical Students",
  "unit": "4",
  "discription": "This introductory course is specifically designed for premedical students and will provide them with a broad introduction to sociological concepts and research, particularly as applied to medicine.",
  "prerequsite": null
 },
 {
  "code": "SOCI 87",
  "title": "First-year Student Seminar",
  "unit": "1",
  "discription": "The First-year Student Seminar Program is designed to provide new students with the opportunity to explore an intellectual topic with a faculty member in a small seminar setting. First-year student seminar topics will vary from quarter to quarter. Enrollment is limited to fifteen to twenty students, with preference given to entering first-year students.",
  "prerequsite": null
 },
 {
  "code": "SOCI 98",
  "title": "Directed Group Study",
  "unit": "4",
  "discription": "Small group study and research under the direction of an interested faculty member in an area not covered in regular sociology courses. (P/NP grades only.)",
  "prerequsite": "lower-division standing; completion of thirty units of UC San Diego undergraduate study; minimum UC San Diego GPA of 3.0; completion and approval of Special Studies form. Consent of instructor and department approval required."
 },
 {
  "code": "SOCI 99",
  "title": "Independent Study",
  "unit": "4",
  "discription": "Individual study and research under the direction of an interested faculty member. P/NP grades only.",
  "prerequsite": "lower-division standing; completion of thirty units of UC San Diego undergraduate study; minimum UC San Diego GPA of 3.0; completion and approval of Special Studies form. Consent of instructor and department approval required."
 },
 {
  "code": "SOCI 100",
  "title": "Classical Sociological Theory",
  "unit": "4",
  "discription": "Major figures and schools in sociology from the early nineteenth century onwards, including Marx, Tocqueville, Durkheim, and Weber. The objective of the course is to provide students with a background in classical social theory, and to show its relevance to contemporary sociology.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 100 and SOCA 100."
 },
 {
  "code": "SOCI 102",
  "title": "Network Data and Methods",
  "unit": "4",
  "discription": "Social network analysts view society as a web of relationships rather than a mere aggregation of individuals. In this course, students will learn how to collect, analyze, and visualize social network data, as well as utilize these techniques to answer an original sociological research question.",
  "prerequsite": "SOCI 60, upper-division standing."
 },
 {
  "code": "SOCI 103M",
  "title": "Computer Applications to Data Management in Sociology",
  "unit": "4",
  "discription": "Develop skills in computer management and analysis of sociological data. Practical experience with data produced by sociological research. Students will develop competency in the analysis of sociological data, by extensive acquaintance with computer software used for data analysis and management (e.g., SPSS).",
  "prerequsite": "SOCI 60. Will not receive credit for SOCI 103M and SOCA 103M."
 },
 {
  "code": "SOCI 104",
  "title": "Field Research: Methods of Participant Observation",
  "unit": "4",
  "discription": "Relationship between sociological theory and field research. Strong emphasis on theory and methods of participant observation: consideration of problems of entry into field settings, recording observations, description/analysis of field data, ethical problems in fieldwork. Required paper using field methods.",
  "prerequsite": "SOCI 60; majors only. Will not receive credit for SOCI 104 and SOCA 104."
 },
 {
  "code": "SOCI 104Q",
  "title": "Qualitative Interviewing",
  "unit": "4",
  "discription": "This course provides students with tools to conduct original research using qualitative interviews. Students will learn how to prepare, conduct, and analyze qualitative interviews. Special emphasis will be placed on the presentation of research in written form.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 104Q and SOCA 104Q."
 },
 {
  "code": "SOCI 105",
  "title": "Ethnographic Film: Media Methods",
  "unit": "6",
  "discription": "(Conjoined with SOCG 227.) Ethnographic recording of field data in written and audiovisual formats including film, video, and CD-ROM applications. Critical assessment of ethnographies and audiovisual ethnographic videotape.",
  "prerequsite": "graduate standing or consent of instructor for SOCG 227 and SOCI for SOCI 105. Will not receive credit for SOCI 105 and SOCA 105."
 },
 {
  "code": "SOCI 106",
  "title": "Comparative and Historical Methods",
  "unit": "4",
  "discription": "A broad-based consideration of the use of historical materials in sociological analysis, especially as this facilitates empirically oriented studies across different societies and through time, and their application in student research projects.",
  "prerequsite": "SOCI 60. Will not receive credit for SOCI 106 and SOCA 106."
 },
 {
  "code": "SOCI 106M",
  "title": "Holocaust Diaries",
  "unit": "4",
  "discription": "Methods for interpreting diaries, letters, and testaments written by victims and perpetrators of the Holocaust. Students use these sources for original research about life in hiding, ghettos, and death camps. Includes techniques for making comparisons and for generalizing from evidence.",
  "prerequsite": "SOCI 60 and SOCI 178 or the consent of instructor. Will not receive credit for SOCI 106M and SOCA 106M."
 },
 {
  "code": "SOCI 107",
  "title": "Epidemiological Methods: Statistical Study of Disease",
  "unit": "4",
  "discription": "Epidemiology is the statistical study of disease, and epidemiological methods are a powerful tool for understanding the causes of certain diseases, e.g., AIDS, scurvy, cholera, and lung cancer. These fundamental epidemiological methods will be taught.",
  "prerequsite": "SOCI 60. Will not receive credit for SOCI 107 and SOCA 107."
 },
 {
  "code": "SOCI 108",
  "title": "Survey Research Design",
  "unit": "4",
  "discription": "Translation of research goals into a research design, including probability sampling, questionnaire construction, data collection (including interviewing techniques), data processing, coding, and preliminary tabulation of data. Statistical methods of analysis will be limited primarily to percentaging.",
  "prerequsite": "SOCI 60. Will not receive credit for SOCI 108 and SOCA 108."
 },
 {
  "code": "SOCI 109",
  "title": "Analysis of Sociological Data",
  "unit": "4",
  "discription": "Students test their own sociological research hypotheses using data from recent American and international social surveys and state-of-the-art computer software. Application of classical scientific method, interpretation of statistical results, and clear presentation of research findings.",
  "prerequsite": "SOCI 60. Will not receive credit for SOCI 109 and SOCA 109."
 },
 {
  "code": "SOCI 109M",
  "title": "Research Reporting",
  "unit": "4",
  "discription": "Students learn to write a research report/article. Course covers the architecture of reports, different audiences, scientific writing style, the literature review, and how to present methodology and findings. Students write a research report using research they conducted in other classes.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 110",
  "title": "Qualitative Research in Educational Settings",
  "unit": "4",
  "discription": "Basic understanding of participant observation, interviewing, and other ethnographic research techniques through field experiences in school and community settings sponsored by CREATE. Students will learn to take field notes, write up interviews, and compose interpretive essays based on their field experiences.",
  "prerequsite": "SOCI 60 Will not receive credit for SOCI 110 and SOCA 110A."
 },
 {
  "code": "SOCI 111",
  "title": "Local Lives, Global Problems",
  "unit": "4",
  "discription": "This course surveys the variety of ways that scholars across disciplines have studied local-global phenomena and developed theoretical, methodological, and empirical orientations that incorporate concern for place, space, and scale into their analytical lens.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 112",
  "title": "Social Psychology",
  "unit": "4",
  "discription": "This course will deal with human behavior and personality development as affected by social group life. Major theories will be compared. The interaction dynamics of such substantive areas as socialization, normative and deviant behavior, learning and achievement, the social construction of the self, and the social identities will be considered.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 112 and SOCB 112."
 },
 {
  "code": "SOCI 113",
  "title": "Sociology of the AIDS Epidemic",
  "unit": "4",
  "discription": "This course considers the social, cultural, political, and economic aspects of HIV/AIDS. Topics include the social context of transmission; the experiences of women living with HIV; AIDS activism; representations of AIDS; and the impact of race and class differences.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 113 and SOCB 113."
 },
 {
  "code": "SOCI 114",
  "title": "Just a Joke?: Sociology of Humor",
  "unit": "4",
  "discription": "Telling jokes is fun, but it is also quintessentially a social act. How we make jokes and who we make jokes with is socially prescribed. We use humor every day in our social interactions to solidify social ties, but also to keep us apart. The course will examine the social dynamics of humor, paying specific attention to dimensions of race, gender, sexuality, disability, and national origin. Different types of humor will be analyzed, as well as the role of social media in altering joke culture.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "SOCI 115",
  "title": "Social Problems",
  "unit": "4",
  "discription": "Analyzes selected social problems in the United States, such as those regarding education, race relations, and wealth inequality from various sociological perspectives. The course also examines the various sites of debate discussion, like political institutions, TV and other media, and religious institutions.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 115 and SOCB 115."
 },
 {
  "code": "SOCI 116",
  "title": "Gender and Language in Society",
  "unit": "4",
  "discription": "(Same as LIGN 174.) This course examines how language contributes to the social construction of gender identities, and how gender impacts language use and ideologies. Topics include the ways language and gender interact across the life span (especially childhood and adolescence); within ethnolinguistic minority communities; and across cultures.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 116 and SOCB 118A."
 },
 {
  "code": "SOCI 117",
  "title": "Language, Culture, and Education",
  "unit": "4",
  "discription": "(Same as EDS 117.) The mutual influence of language, culture, and education will be explored; explanations of students' school successes and failures that employ linguistic and cultural variables will be considered; bilingualism; cultural transmission through education.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 117 and SOCB 117."
 },
 {
  "code": "SOCI 118",
  "title": "Sociology of Gender",
  "unit": "4",
  "discription": "An analysis of the social, biological, and psychological components of becoming a man or a woman. The course will survey a wide range of information in an attempt to specify what is distinctively social about gender roles and identities; i.e., to understand how a most basic part of the “self”—womanhood or manhood—is socially defined and socially learned behavior.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 118 and SOCB 118."
 },
 {
  "code": "SOCI 118E",
  "title": "Sociology of Language",
  "unit": "4",
  "discription": "An examination of how the understanding of language can guide and inform sociological inquiries and a critical evaluation of key sociological approaches to language, including ethnomethodology, frame analysis, sociolinguistics, structuralism and poststructuralism, and others.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 118E and SOCB 118L."
 },
 {
  "code": "SOCI 119",
  "title": "Sociology of Sexuality and Sexual Identities",
  "unit": "4",
  "discription": "Introduction both to the sociological study of sexuality and to sociological perspectives in gay/lesbian studies. Examines the social construction of sexual meanings, identities, movements, and controversies; the relation of sexuality to other institutions; and the intersection of sexuality with gender, class, and race.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 119 and SOCB 119."
 },
 {
  "code": "SOCI 120",
  "title": "Sociology Through Literature",
  "unit": "4",
  "discription": "In this course, we will examine how literature and poetry may illuminate and sometimes go beyond sociological writings in highlighting and spelling out sociological concepts and social processes. This course will cover basic concepts (social role, power), economic concepts (class, greed), and political concepts (colonialism, revolution).",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 120T",
  "title": "Special Topics in Culture, Language, and Social Interaction",
  "unit": "4",
  "discription": "This course will examine key issues in culture, language, and social interaction. Content will vary from year to year.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "SOCI 121",
  "title": "Economy and Society",
  "unit": "4",
  "discription": "An examination of a central concern of classical social theory: the relationship between economy and society, with special attention (theoretically and empirically) on the problem of the origins of modern capitalism. The course will investigate the role of technology and economic institutions in society; the influence of culture and politics on economic exchange, production, and consumption; the process of rationalization and the social division of labor; contemporary economic problems and the welfare state.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 121 and SOCC 121."
 },
 {
  "code": "SOCI 122",
  "title": "Social Networks",
  "unit": "4",
  "discription": "This course takes a social network approach to the study of society, examining the complex web of relationships— platonic, familial, professional, romantic—in which individual behavior is embedded. Special emphasis is placed on the unprecedented opportunities created by contemporary social media (e.g. Facebook, mobile phones, online dating websites) for answering fundamental sociological questions.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 123",
  "title": "Japanese Culture Inside/Out: A Transnational Perspective",
  "unit": "4",
  "discription": "We examine cultural production in Japan and abroad, national and transnational political-economic and social influences, the idea of Japan in the West, and the idea of the West in Japan.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 124",
  "title": "The Good Society",
  "unit": "4",
  "discription": "What institutions and policies are conducive to liberty, economic security, opportunity, a vibrant economy, shared prosperity, social cohesion, health, happiness, and other desirable features of a modern society?",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 125",
  "title": "Sociology of Immigration",
  "unit": "4",
  "discription": "Immigration from a comparative, historical, and cultural perspective. Topics include factors influencing amount of immigration and destination of immigrants; varying modes of incorporation of immigrants; immigration policies and rights; the impact of immigration on host economies; refugees; assimilation; and return migration.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 125 and SOCB 125."
 },
 {
  "code": "SOCI 126",
  "title": "Social Organization of Education",
  "unit": "4",
  "discription": "(Same as EDS 126.) The social organization of education in the U.S. and other societies; the functions of education for individuals and society; the structure of schools; educational decision making; educational testing; socialization and education; formal and informal education; cultural transmission.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 126 and SOCC 126."
 },
 {
  "code": "SOCI 127",
  "title": "Immigration, Race, and Ethnicity",
  "unit": "4",
  "discription": "Examination of the role that race and ethnicity play in immigrant group integration. Topics include theories of integration, racial and ethnic identity formation, racial and ethnic change, immigration policy, public opinion, comparisons between contemporary and historical waves of immigration.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 127 and SOCB 127."
 },
 {
  "code": "SOCI 128",
  "title": "Religion and Popular Culture in East Asia",
  "unit": "4",
  "discription": "(Same as HIEA 119.) Historical, social, and cultural relationships between religion and popular culture. Secularization of culture through images, worldviews, and concepts of right and wrong which may either derive from, or pose challenges to, the major East Asian religions.",
  "prerequsite": null
 },
 {
  "code": "SOCI 129",
  "title": "The Family",
  "unit": "4",
  "discription": "An examination of historical and social influences on family life. Analyzes contemporary families in the United States, the influences of gender, class, and race, and current issues such as divorce, domestic violence, and the feminization of poverty.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 129 and SOCC 129."
 },
 {
  "code": "SOCI 130",
  "title": "Population and Society",
  "unit": "4",
  "discription": "This course offers insight into why and how populations grow (and decline), and where and under what conditions changes in population size and/or structure change have positive and negative consequences for societies and environment.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 130 and SOCD 130."
 },
 {
  "code": "SOCI 131",
  "title": "Sociology of Youth",
  "unit": "4",
  "discription": "Chronological age and social status; analysis of social processes bearing upon the socialization of children and adolescents. The emergence of “youth cultures,” generational succession as a cultural problem.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 131 and SOCB 131."
 },
 {
  "code": "SOCI 132",
  "title": "Gender and Work",
  "unit": "4",
  "discription": "Examination and analysis of empirical research and theoretical perspectives on gender and work. Special attention to occupational segregation. Other topics include the interplay between work and family; gender, work and poverty; gender and work in the Third World.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 132 and SOCC 132."
 },
 {
  "code": "SOCI 133",
  "title": "Immigration in Comparative Perspective",
  "unit": "4",
  "discription": "Societies across the world are confronting new immigration. In this course, we will focus on Europe, Asia, and North America, and examine issues of nationalism, cultural diversity and integration, economic impacts, and government policy.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 133 and SOCB 133."
 },
 {
  "code": "SOCI 134",
  "title": "The Making of Modern Medicine",
  "unit": "4",
  "discription": "A study of the social, intellectual, and institutional aspects of the nineteenth-century transformation of clinical medicine, examining both the changing content of medical knowledge and therapeutics, and the organization of the medical profession.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 134 and SOCC 134A."
 },
 {
  "code": "SOCI 135",
  "title": "Medical Sociology",
  "unit": "4",
  "discription": "An inquiry into the roles of culture and social structure in mediating the health and illness experiences of individuals and groups. Topics include the social construction of illness, the relationships between patients and health professionals, and the organization of medical work.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 135 and SOCC 135."
 },
 {
  "code": "SOCI 136",
  "title": "Data and Society",
  "unit": "4",
  "discription": "This course explores the roles, challenges, and impacts of data and information technologies in contemporary societies. Information regarding discussion section is to be discussed in the first week of class.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 136E",
  "title": "Sociology of Mental Illness: A Historical Approach",
  "unit": "4",
  "discription": "An examination of the social, cultural, and political factors involved in the identification and treatment of mental illness. This course will emphasize historical material, focusing on the eighteenth, nineteenth, and early twentieth centuries. Developments in England as well as the United States will be examined from an historical perspective.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 136E and SOCC 136A."
 },
 {
  "code": "SOCI 136F",
  "title": "Sociology of Mental Illness in Contemporary Society",
  "unit": "4",
  "discription": "This course will focus on recent developments in the mental illness sector and on the contemporary sociological literature on mental illness. Developments in England as well as the United States will be examined.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 136F and SOCC 136B."
 },
 {
  "code": "SOCI 137",
  "title": "Sociology of Food",
  "unit": "4",
  "discription": "Topics include food as a marker of social differences (e.g., gender, class, ethnicity); the changing character of food production and distribution; food as an object of political conflict; and the symbolic meanings and rituals of food preparation and consumption.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 137 and SOCB 137."
 },
 {
  "code": "SOCI 138",
  "title": "Genetics and Society",
  "unit": "4",
  "discription": "The class will first examine the direct social effects of the “genetic revolution”: eugenics, genetic discrimination, and stratification. Second, the implications of thinking of society in terms of genetics, specifically—sociobiology, social Darwinism, evolutionary psychology, and biology.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 138 and SOCC 138."
 },
 {
  "code": "SOCI 139",
  "title": "Social Inequality: Class, Race, and Gender",
  "unit": "4",
  "discription": "Massive inequality in wealth, power, and prestige is ever-present in industrial societies. In this course, causes and consequences of class, gender, racial, and ethnic inequality (“stratification”) will be considered through examination of classical and modern social science theory and research.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 139 and SOCC 139."
 },
 {
  "code": "SOCI 140",
  "title": "Sociology of Law",
  "unit": "4",
  "discription": "This course analyzes the functions of law in society, the social sources of legal change, social conditions affecting the administration of justice, and the role of social science in jurisprudence.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 140 and SOCC 140."
 },
 {
  "code": "SOCI 140F",
  "title": "Law and the Workplace",
  "unit": "4",
  "discription": "This course examines how the US legal system has responded to workplace inequality and demands for employee rights. Particular attention is given to racial, gender, religious, and disability discrimination, as well as the law's role in regulating unions, the global economy, and sweatshop labor.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 140F and SOCC 140F."
 },
 {
  "code": "SOCI 140K",
  "title": "Law and Society in China",
  "unit": "4",
  "discription": "This course offers an overview of the courts of China. The focus is not on blackletter law. Instead, we look at what grassroots courts do on a daily basis. China has arguably the largest court system in the world. What does it do? How are the courts organized internally? What is the relationship between the courts and other government bureaucracies? Is there the rule of law in China? The course will address these questions by reviewing latest empirical research on the subject area.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 141",
  "title": "Crime and Society",
  "unit": "4",
  "discription": "A study of the social origins of criminal law, the administration of justice, causes, and patterns of criminal behavior, and the prevention and control of crime, including individual rehabilitation and institutional change, and the politics of legal, police, and correctional reform.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 141 and SOCC 141."
 },
 {
  "code": "SOCI 142",
  "title": "Social Deviance",
  "unit": "4",
  "discription": "This course studies the major forms of behavior seen as rule violations by large segments of our society and analyzes the major theories trying to explain them, as well as processes of rulemaking, rule enforcing, techniques of neutralization, stigmatization and status degradation, and rule change.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 142 and SOCB 142."
 },
 {
  "code": "SOCI 143",
  "title": "Suicide",
  "unit": "4",
  "discription": "Traditional and modern theories of suicide will be reviewed and tested. The study of suicide will be treated as one method for investigating the influence of society on the individual.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 143 and SOCB 143."
 },
 {
  "code": "SOCI 144",
  "title": "Forms of Social Control",
  "unit": "4",
  "discription": "The organization, development, and mission of social control agencies in the nineteenth and twentieth centuries, with emphasis on crime and madness; agency occupations (police, psychiatrists, correctional work, etc.); theories of control movements.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 144 and SOCC 144."
 },
 {
  "code": "SOCI 145",
  "title": "Violence and Society",
  "unit": "4",
  "discription": "Focusing on American history, this course explores violence in the light of three major themes: struggles over citizenship and nationhood; the drawing and maintenance of racial, ethnic, and gender boundaries; and the persistence of notions of “masculinity” and its relation to violence.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 145 and SOCB 145."
 },
 {
  "code": "SOCI 146",
  "title": "Criminal Punishment",
  "unit": "4",
  "discription": "This course examines the historic and contemporary responses to criminal behavior in the United States.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 147",
  "title": "Organizations, Society, and Social Justice",
  "unit": "4",
  "discription": "Organizations are dynamic forces in society. This course examines how organizations address human health and social justice issues in national and international settings, focusing on the links between internal dynamics of organizations and macro-level political, economic, and cultural factors.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 147 and SOCC 147."
 },
 {
  "code": "SOCI 148",
  "title": "Political Sociology",
  "unit": "4",
  "discription": "Course focuses on the interaction between state and society. It discusses central concepts of political sociology (social cleavages, mobilization, the state, legitimacy), institutional characteristics, causes, and consequences of contemporary political regimes (liberal democracies, authoritarianism, communism), and processes of political change.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 148 and SOCC 148."
 },
 {
  "code": "SOCI 148E",
  "title": "Inequality and Jobs",
  "unit": "4",
  "discription": "Some people do much better than others in the world of work. Causes and consequences of this inequality will be examined: How do characteristics of individuals (e.g., class, gender, race, education, talent) and characteristics of jobs affect market outcomes?",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 148E and SOCC 148L."
 },
 {
  "code": "SOCI 148GS",
  "title": "Political Sociology",
  "unit": "4",
  "discription": "Course focuses on the interaction between state and society. It discusses central concepts of political sociology (social cleavages, mobilization, the state, legitimacy), institutional characteristics, causes, and consequences of contemporary political regimes (liberal democracies, authoritarianism, communism), and processes of political change. Students cannot receive credit in this course if they have already taken SOCI 148.",
  "prerequsite": "students must apply and be accepted to the Global Seminar Program."
 },
 {
  "code": "SOCI 149",
  "title": "Sociology of the Environment",
  "unit": "4",
  "discription": "The environment as a socially and technically shaped milieu in which competing values and interests play out. Relation of humanity to nature, conflicts between preservation and development, environmental pollution and contested illnesses. Will not receive credit for SOCI 149 and SOCC 149.",
  "prerequsite": null
 },
 {
  "code": "SOCI 150",
  "title": "Madness and the Movies",
  "unit": "4",
  "discription": "Hollywood has had an ongoing obsession with mental illness. This course will examine a number of important or iconic films on this subject. By examining them against a background provided by relevant scholarly materials, we shall develop a critical perspective on these cultural artifacts.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 150 and SOCC 150."
 },
 {
  "code": "SOCI 151",
  "title": "Social Movement from Civil Rights to Black Lives Matter",
  "unit": "4",
  "discription": "A treatment of selected social movements dealing primarily with the struggles of African-Americans, Hispanics, and women to change their situation in American society.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 152",
  "title": "Social Inequality and Public Policy",
  "unit": "4",
  "discription": "(Same as USP 133.) Primary focus on understanding and analyzing poverty and public policy. Analysis of how current debates and public policy initiatives mesh with alternative social scientific explorations of poverty.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 152 and SOCC 152."
 },
 {
  "code": "SOCI 153",
  "title": "Urban Sociology",
  "unit": "4",
  "discription": "(Same as USP 105.) Introduces students to the major approaches in the sociological study of cities and to what a sociological analysis can add to our understanding of urban processes.",
  "prerequsite": "upper-division standing or consent of instructor. Will not receive credit for SOCI 153 and SOCC 153."
 },
 {
  "code": "SOCI 154",
  "title": "Religious Institutions in America",
  "unit": "4",
  "discription": "Examination of sociological theories for why people have religious beliefs. Also examines types of religious organizations, secularization, fundamentalism, religion and immigration, religion and politics, and religiously inspired violence and terrorism. The class will tend to focus on the American context.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 154 and SOCC 154."
 },
 {
  "code": "SOCI 155",
  "title": "The City of San Diego",
  "unit": "4",
  "discription": "A research-oriented course studying a specific city. Students will describe and analyze a local community of San Diego. Additional work on one citywide institution. Guest lecturers from San Diego organizations and government. Readings largely from city reports and news media.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 155 and SOCC 155."
 },
 {
  "code": "SOCI 156",
  "title": "Sociology of Religion",
  "unit": "4",
  "discription": "Diverse sociological explanations of religious ideas and religious behavior. The social consequences of different kinds of religious beliefs and religious organizations. The influence of religion upon concepts of history, the natural world, human nature, and the social order. The significance of such notions as “sacred peoples” and “sacred places.” The religious-like character of certain political movements and certain sociocultural attitudes.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 156 and SOCC 156."
 },
 {
  "code": "SOCI 157",
  "title": "Religion in Contemporary Society",
  "unit": "4",
  "discription": "Sacred texts, religious experiences, and ritual settings are explored from the perspective of sociological analysis. The types and dynamic of religious sects and institutions are examined. African and contemporary US religious data provide resources for lecture and comparative analysis.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 157 and SOCC 157."
 },
 {
  "code": "SOCI 158",
  "title": "Islam in the Modern World",
  "unit": "4",
  "discription": "The role of Islam in the society, culture, and politics of the Muslim people during the nineteenth and twentieth centuries; attempts by Muslim thinkers to accommodate or reject rival ideologies (such as nationalism and socialism); and a critical review of the relationship between Islam and the West.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 158 and SOCD 158."
 },
 {
  "code": "SOCI 159",
  "title": "Special Topics in Social Organizations and Institutions",
  "unit": "4",
  "discription": "Readings and discussion of particular substantive issues and research in the sociology of organizations and institutions, including such areas as population, economy, education, family, medicine, law, politics, and religion. Topics will vary from year to year.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 160",
  "title": "Sociology of Culture",
  "unit": "4",
  "discription": "This course will examine the concept of culture, its “disintegration” in the twentieth century, and the repercussions on the integration of the individual. We will look at this process from a variety of perspectives, each focusing on one cultural fragment (e.g., knowledge, literature, religion) and all suggesting various means to reunify culture and consequently the individual.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 160 and SOCB 160."
 },
 {
  "code": "SOCI 160E",
  "title": "Law and Culture",
  "unit": "4",
  "discription": "This course examines major formulations of the relationship between law and culture in the sociological literature. Topics include formal law versus embedded law, law and morality, law and the self, legal consciousness, the rule of law, and the construction of legality.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 160E and SOCB 160L."
 },
 {
  "code": "SOCI 161",
  "title": "Sociology of the Life Course",
  "unit": "4",
  "discription": "This course explores concepts, theory and empirical research related to demographic, sociopsychological, and institutional aspects of the different stages of human development. It considers social influences on opportunities and constraints by gender, class, race/ethnicity, and historical period.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 161 and SOCB 161."
 },
 {
  "code": "SOCI 162",
  "title": "Popular Culture",
  "unit": "4",
  "discription": "An overview of the historical development of popular culture from the early modern period to the present. Also, a review of major theories explaining how popular culture reflects and/or affects patterns of social behavior. Students may not receive credit for both SOCI 162 and SOCB 162.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 163",
  "title": "Migration and the Law",
  "unit": "4",
  "discription": "Provides a global sociological perspective on the development and consequences of laws regulating migration within and across nation-state borders. The ability of the nation-state to control migration using law and its policy instruments. The effects of different legal statuses on political and socioeconomic outcomes.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 163 and SOCC 163."
 },
 {
  "code": "SOCI 165",
  "title": "Predicting the Future from Tarot Cards to Computer Algorithms",
  "unit": "4",
  "discription": "No one can see the future but everyone must try. When we act with purpose, we must form an idea of the consequences of our actions and the world in which our action will unfold. We must form expectations about the future, and therefore, we must predict, often in the face of great uncertainty, what will and won't happen. This course surveys the social devices from tarot cards to computer algorithms designed to solve the problem of prediction.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 165A",
  "title": "American News Media",
  "unit": "4",
  "discription": "History, politics, social organization, and ideology of the American news media. This course,165A, surveys the development of the news media as an institution, from earliest newspapers to modern mass news media.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 165A and SOCC 165A."
 },
 {
  "code": "SOCI 166",
  "title": "Sociology of Knowledge",
  "unit": "4",
  "discription": "This course provides a general introduction to the development of the sociology of knowledge and will explore questions concerning social determination of consciousness as well as theoretical ways to articulate a critique of ideology.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 166 and SOCB 166."
 },
 {
  "code": "SOCI 167",
  "title": "Science and War",
  "unit": "4",
  "discription": "This class examines how science has been mobilized in the development of nuclear weapons and other weapons of mass destruction. The class applies sociological concepts to the analysis of modern technological violence.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 167 and SOCC 167."
 },
 {
  "code": "SOCI 168",
  "title": "Marxism",
  "unit": "4",
  "discription": "This course examines Marxism as social theory and social movement. It covers the origins and historical development of Marxist ideas, the history of Marxist movements and organizations, and the interaction between theory and political practice.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 168E",
  "title": "Sociology of Science",
  "unit": "4",
  "discription": "A survey of theoretical and empirical studies concerning the workings of the scientific community and its relations with the wider society. Special attention will be given to the institutionalization of the scientific role and to the social constitution of scientific knowledge.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 168E and SOCC 168E."
 },
 {
  "code": "SOCI 169",
  "title": "Citizenship, Community, and Culture",
  "unit": "4",
  "discription": "Will survey the liberal, communitarian, social-democratic, nationalist, feminist, post-nationalist, and multicultural views on the construction of the modern citizen and good society.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 169 and SOCD 169."
 },
 {
  "code": "SOCI 170",
  "title": "Gender and Science",
  "unit": "4",
  "discription": "Scientific practices have had a tremendous impact on our understandings of gender. Gender relations have also significantly influenced the character of scientific inquiry. The course will consider how and why these two processes intertwine.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 171",
  "title": "Technology and Science",
  "unit": "4",
  "discription": "Does improved technology mean progress? Or, are environmental pollution and social alienation signs that technology is out of control? This class uncovers the social problems of key modern technologies such as automobile transport, factory farming, biotechnology, and nuclear power.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 168T and SOCI 171."
 },
 {
  "code": "SOCI 172",
  "title": "Films and Society",
  "unit": "4",
  "discription": "An analysis of films and how they portray various aspects of American society and culture.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 172 and SOCB 172."
 },
 {
  "code": "SOCI 173",
  "title": "Sociology of Health, Illness, and Medicine",
  "unit": "4",
  "discription": "This course will explore the social forces that shape our health and the way we understand illness. Themes will include American public health and health care, inequality and biomedicine, as well as special topics like suicide, lead, autism, and HIV/AIDS.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 175",
  "title": "Nationality and Citizenship",
  "unit": "4",
  "discription": "Surveys the development of nationality and citizenship law in historical and comparative perspective with an emphasis on the United States, Latin America, and Europe. Examines competing sociological accounts for national variation and convergence; consequences of the law; and local, transnational, and extraterritorial forms of citizenship.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 175 and SOCD 175."
 },
 {
  "code": "SOCI 176",
  "title": "Transnational Japan Research Practicum",
  "unit": "4",
  "discription": "Focusing on Japan and its transnational relationships, this course combines analysis of readings with instruction in writing academic research papers. Students will spend about half their time on readings and half on their own research projects. We will analyze domestic and international contexts within which Japanese cultural forms emerge and influence others. Topics include Japanese approaches to popular culture, art, environment, social relationships, and social problems.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 177",
  "title": "International Terrorism",
  "unit": "4",
  "discription": "(Same as POLI 1420.) This course covers the definitions, history, and internationalization of terrorism; the interrelation of religion, politics and terror; and the representation of terrorism in the media. A number of organizations and their activities in Europe and the Middle East are examined.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 177 and SOCD 177."
 },
 {
  "code": "SOCI 178",
  "title": "The Holocaust",
  "unit": "4",
  "discription": "The study of the unique and universal aspects of the Holocaust. Special attention will be paid to the nature of discrimination and racism, those aspects of modernity that make genocide possible, the relationship among the perpetrators, the victims and the bystanders, and the teaching, memory, and denial of the Holocaust.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 178 and SOCD 178."
 },
 {
  "code": "SOCI 179",
  "title": "Social Change",
  "unit": "4",
  "discription": "Course focuses on the development of capitalism as a worldwide process, with emphasis on its social and political consequences. Topics include precapitalist societies, the rise of capitalism in the West, and the social and political responses to its expansion elsewhere.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 179 and SOCD 179."
 },
 {
  "code": "SOCI 180",
  "title": "Social Movements and Social Protest",
  "unit": "4",
  "discription": "An examination of the nature of protests and violence, particularly as they occur in the context of larger social movements. The course will further examine those generic facets of social movements having to do with their genesis, characteristic forms of development, relationship to established political configurations, and gradual fading away.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 180 and SOCC 180."
 },
 {
  "code": "SOCI 181",
  "title": "Modern Western Society",
  "unit": "4",
  "discription": "This course examines the nature and dynamics of modern western society in the context of the historical process by which this type of society has emerged over the last several centuries. The aim of the course is to help students think about what kind of society they live in, what makes it the way it is, and how it shapes their lives.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 181 and SOCD 181."
 },
 {
  "code": "SOCI 182",
  "title": "Ethnicity and Indigenous Peoples in Latin America",
  "unit": "4",
  "discription": "Ethnicity and the reassertion of Indian identity in contemporary Latin America. Issues related to these trends are examined in comparative perspective, with attention to changes in global conditions and in the socioeconomic, political, and cultural contexts of Latin American modernization.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 182 and SOCD 182."
 },
 {
  "code": "SOCI 183",
  "title": "The Geography of American Opportunity",
  "unit": "4",
  "discription": "How does where you grow up affect where you end up? This course explores \"who gets what where and why\" by examining spatial inequalities in life chances across regions, rural and urban communities, and divergent local economies in the U.S. We will \"place\" places within their economic, socio-cultural, and historical contexts. Readings and exercises will uncover spatial variation in inequalities by race/ethnicity, immigrant status, gender, class, and LGBTQIA status that national averages obscure. _",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 183 and USP 183."
 },
 {
  "code": "SOCI 184",
  "title": "Gender and Film",
  "unit": "4",
  "discription": "This class will examine issues of masculinity and femininity through analysis of films. Emphasis is on contemporary American society and will include varying issues such as race, class, and sexualities; worlds of work; romance, marriage, and family.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 184 and SOCC 184."
 },
 {
  "code": "SOCI 185",
  "title": "Globalization and Social Development",
  "unit": "4",
  "discription": "Social development is more than sheer economic growth. It entails improvements in the overall quality of human life, particularly in terms of access to health, education, employment, and income for the poorer sectors of the population. Course examines the impact of globalization on the prospects for attaining these goals in developing countries.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 185 and SOCD 185."
 },
 {
  "code": "SOCI 185GS",
  "title": "Globalization and Social Development",
  "unit": "4",
  "discription": "Social development is more than sheer economic growth. It entails improvements in the overall quality of human life, particularly in terms of access to health, education, employment, and income for the poorer sectors of the population. Course examines the impact of globalization on the prospects for attaining these goals in developing countries. Students cannot receive credit in this course if they have already taken SOCI 185.",
  "prerequsite": "students must apply and be accepted to the Global Seminar Program."
 },
 {
  "code": "SOCI 187",
  "title": "African Societies through Film",
  "unit": "4",
  "discription": "Exploration of contemporary African urbanization and social change via film, including 1) transitional African communities, 2) social change in Africa, 3) Western vs. African filmmakers' cultural codes. Ideological and ethnographic representations, aesthetics, social relations, and market demand for African films are analyzed.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 187 and SOCD 187."
 },
 {
  "code": "SOCI 187E",
  "title": "The Sixties",
  "unit": "4",
  "discription": "A sociological examination of the era of the 1960s in America, its social and political movements, its cultural expressions, and debates over its significance, including those reflected in video documentaries. Comparisons will also be drawn with events in other countries.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 187E and SOCD 187S."
 },
 {
  "code": "SOCI 188D",
  "title": "Latin America: Society and Politics",
  "unit": "4",
  "discription": "Course focuses on the different types of social structures and political systems in Latin America. Topics include positions in the world economy, varieties of class structure and ethnic cleavages, political regimes, mobilization and legitimacy, class alignments, reform and revolution.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 188D and SOCD 188D."
 },
 {
  "code": "SOCI 188E",
  "title": "Community and Social Change in Africa",
  "unit": "4",
  "discription": "The process of social change in African communities, with emphasis on changing ways of seeing the world and the effects of religion and political philosophies of social change. The methods and data used in various village and community studies in Africa will be critically examined.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 188E and SOCD 188A."
 },
 {
  "code": "SOCI 188F",
  "title": "Modern Jewish Societies and Israeli Society",
  "unit": "4",
  "discription": "Contradictory effects of modernization on Jewish society in Western and Eastern Europe and the plethora of Jewish responses: assimilation, fundamentalism, emigration, socialism, diaspora nationalism, and Zionism. Special attention will be paid to issues of discontinuity between Jewish societies and Israeli society. Simultaneously, we will scrutinize the influence of the Palestinian-Israeli conflict on Israeli society, state, and identity.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 188F and SOCD 188F."
 },
 {
  "code": "SOCI 188G",
  "title": "Chinese Society",
  "unit": "4",
  "discription": "The social structure of the People's Republic of China since 1949, including a consideration of social organization at various levels: the economy, the policy, the community, and kinship institutions.",
  "prerequsite": "upper- division standing. Will not receive credit for SOCI 188G and SOCD 188B."
 },
 {
  "code": "SOCI 188GS",
  "title": "Change in Modern South Africa",
  "unit": "4",
  "discription": "Using sociological and historical perspectives, this course examines the origins and demise of apartheid and assesses the progress that has been made since 1994, when apartheid was officially ended. Contrasts of racism in South Africa and the United States. Will not receive credit for SOCI 188GS and SOCI 188J.",
  "prerequsite": "students must apply and be accepted to the Global Seminar Program."
 },
 {
  "code": "SOCI 188I",
  "title": "The Israeli-Palestinian Conflict",
  "unit": "4",
  "discription": "In this course we will examine the national and colonial dimensions of this long-lasting conflict and then turn our attention to the legal, governmental/political, and everyday aspects of the Israeli occupation of the West Bank and Gaza following the 1967 war.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 188J",
  "title": "Change in Modern South Africa",
  "unit": "4",
  "discription": "Using sociological and historical perspectives, this course examines the origins and demise of apartheid and assesses the progress that has been made since 1994, when apartheid was officially ended. Contrasts of racism in South Africa and the United States.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 188J and SOCD 188J."
 },
 {
  "code": "SOCI 188K",
  "title": "American Society",
  "unit": "4",
  "discription": "Comparative and historical perspectives on US society. The course highlights “American exceptionalism”: Did America follow a special historical path, different from comparable nations in its social relations, politics, and culture? Specific topics include class relations, race, religion, and social policy.",
  "prerequsite": "upper-division standing. Will not receive credit for SOCI 188K and SOCD 188K."
 },
 {
  "code": "SOCI 188M",
  "title": "Social Movements in Latin America",
  "unit": "4",
  "discription": "Course examines theories of social movements and changing patterns of popular protest and contentious mobilization in Latin America since the mid-twentieth century. Case studies include populism, guerrillas, liberation theology and movements of workers, peasants, women, and indigenous groups.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 188O",
  "title": "Settlements and Peacemaking in Israel",
  "unit": "4",
  "discription": "We will examine the social, political, and religious factors that affect the nexus of Israeli settlements and Israeli-Arab and Israeli-Palestinian peace making. Special attention will be paid to the period after the 1967 War when these processes begun as well as to alternative resolutions to the conflict.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 189",
  "title": "Special Topics in Comparative-Historical Sociology",
  "unit": "4",
  "discription": "Readings and discussion in selected areas of comparative and historical macrosociology. Topics may include the analysis of a particular research problem, the study of a specific society or of cross-national institutions, and the review of different theoretical perspectives. Contents will vary from year to year.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "SOCI 192",
  "title": "Senior Seminar in Sociology",
  "unit": "1",
  "discription": "The Senior Seminar Program is designed to allow senior undergraduates to meet with faculty members in a small group setting to explore an intellectual topic in sociology (at the upper-division level). Topics will vary from quarter to quarter. Senior Seminars may be taken for credit up to four times, with a change in topic, and permission of the department. Enrollment is limited to twenty students, with preference given to seniors. (P/NP grades only.)",
  "prerequsite": "instructor permission or department stamp, upper-division standing."
 },
 {
  "code": "SOCI 194",
  "title": "Research Seminar in Washington, DC",
  "unit": "4",
  "discription": "(Same as PS 194, COGN 194, ERTH 194, HIST 193, USP 194.) Course attached to six-unit internship taken by students participating in the UCDC Program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial research paper.",
  "prerequsite": "department approval. Participating in UCDC Program. Will not receive credit for SOCI 194 and SOCE 194."
 },
 {
  "code": "SOCI 196A",
  "title": "Honors Seminar: Advanced Studies in Sociology",
  "unit": "4",
  "discription": "This seminar will permit honors students to explore advanced issues in the field of sociology. It will also provide honors students the opportunity to develop a senior thesis proposal on a topic of their choice and begin preliminary work on the honors thesis under faculty supervision.",
  "prerequsite": "acceptance into Department of Sociology Honors Program."
 },
 {
  "code": "SOCI 196B",
  "title": "Honors Seminar: Supervised Thesis Research",
  "unit": "4",
  "discription": "This seminar will provide honors candidates the opportunity to complete research on and preparation of a senior honors thesis under close faculty supervision.",
  "prerequsite": "completion of SOCI 196A."
 },
 {
  "code": "SOCI 198",
  "title": "Directed Group Study",
  "unit": "4",
  "discription": "Group study of specific topics under the direction of an interested faculty member. Enrollment will be limited to a small group of students who have developed their topic and secured appropriate approval from the departmental committee on independent and group studies. These studies are to be conducted only in areas not covered in regular sociology courses.",
  "prerequsite": "junior standing and department approval required."
 },
 {
  "code": "SOCI 198RA",
  "title": "Research Apprenticeship",
  "unit": "4",
  "discription": "Students work on a graduate student’s research project supervised by the graduate student’s faculty mentor. Students assist with research tasks, gather material for a research report to be written in SOCI 109M. May be taken for credit up to two times.",
  "prerequsite": "students must apply and be accepted to the research apprenticeship course. Participants must be majors in sociology with junior or senior standing and a GPA of 3.2 in all sociology courses taken at UC San Diego. Individual projects may require other training, such as SOCI 60."
 },
 {
  "code": "SOCI 199",
  "title": "Independent Study",
  "unit": "4",
  "discription": "Tutorial: individual study under the direction of an interested faculty member in an area not covered by the present course offerings. Approval must be secured from the departmental committee on independent studies.",
  "prerequsite": "junior standing and department approval required."
 },
 {
  "code": "SOCG 200",
  "title": "Introductory Methods/Epistemology",
  "unit": "4",
  "discription": "This course introduces various methods for observing and analyzing the social world, principles for choosing among them, and general issues of research design. Coverage emphasizes common qualitative and quantitative methods in sociology in preparation for further methods courses.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 201",
  "title": "Classical Sociology Theory",
  "unit": "4",
  "discription": "This course discusses major themes in the work of nineteenth- and twentieth- century social thinkers, including Tocqueville, Marx, Weber, and Durkheim.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 202",
  "title": "Contemporary Sociological Theory",
  "unit": "4",
  "discription": "Themes important for social theory at the turn of the twenty-first century: Marxism (Gramsci, Althusser), critical theory (Adorno, Habermas), interpretation (Geertz), social systems (Parsons), post-structuralism (Foucault), postmodernism, and social constructivism (Bourdieu).",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 203",
  "title": "Field Methods",
  "unit": "4",
  "discription": "Research will be conducted in field settings. The primary focus will be on mastering the problems and technical skills associated with the conduct of ethnographic and participant observational studies.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 204",
  "title": "Text and Discourse Analysis",
  "unit": "4",
  "discription": "Techniques of gathering and analyzing transcripts of naturally occurring conversations, interviews, discourse in institutional settings, public political discourse, and text of historical materials.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 205",
  "title": "Quantitative Methods I",
  "unit": "4",
  "discription": "This course covers some of the elementary techniques used 1) to select random samples, 2) to detect statistical patterns in the sample data, and 3) to determine whether any patterns found in sample data are statistically significant. The course also stresses the benefits and drawbacks of survey and aggregate data and some common ways in which these data are used incorrectly.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 206",
  "title": "Quantitative Methods II",
  "unit": "4",
  "discription": "The course covers some of the more advanced techniques used 1) to select random samples, 2) to detect statistical patterns in the sample data, and 3) to determine whether any patterns found in sample data are statistically significant. The course also stresses the benefits and drawbacks of survey and aggregate data and some common ways in which these data are used incorrectly.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 207",
  "title": "Comparative-Historical Methods",
  "unit": "4",
  "discription": "A broad-based consideration of the use of historical materials in sociological analysis, especially as this facilitates empirically oriented studies across different societies and through time.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 208A",
  "title": "Graduate Student Seminar",
  "unit": "1",
  "discription": "Introduction to the sociology graduate program and faculty. Course includes themes to connect student with the sociological community, a variety of departmental scholarly research, and focus on practical tools for student success. Students may not receive credit for SOCG 208A and SOCG 208.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 208B",
  "title": "Graduate Student Seminar",
  "unit": "1",
  "discription": "Second part of the introduction to the sociology graduate program and faculty. Course includes themes to connect student with the sociological community, a variety of departmental scholarly research, and focus on practical tools for student success",
  "prerequsite": null
 },
 {
  "code": "SOCG 209",
  "title": "Social Networks",
  "unit": "4",
  "discription": "This course provides an accessible, graduate level introduction to social network analysis as a theoretical and methodological approach—one takes relationships rather than individuals as the fundamental unit of analysis. While the course will focus on concepts and applications rather than statistical models, students will also become acquainted with basic analytic techniques as well as learn how to collect, store, inspect, and visualize original network data.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 211",
  "title": "Introduction to Computational Social Science",
  "unit": "4",
  "discription": "This course provides an overview and practical, hands-on introduction to some of the common tools employed in computational approaches to social science research. Students will acquire sufficient skills to use existing tools to conduct computational social science research, such as basic Python language. Recommended preparation: knowledge of or background in statistics.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 212",
  "title": "Social Stratification",
  "unit": "4",
  "discription": "The causes and effects of social ranking in various societies. Theories of stratification; the dynamics of informal social grouping; determinants of institutional power, and the nature of struggles for power; the distribution of wealth and its causes; the dynamics of social mobility; the effects of stratification on life-styles, culture, and deviance.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 214",
  "title": "Urban Sociology",
  "unit": "4",
  "discription": "A survey of topics in urban sociology, including the city and suburb as social forms, civility among strangers, urbanism and culture, the political economy of metropolitan development, urban poverty, and racial residential segregation. Classical and contemporary approaches will be considered.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 216",
  "title": "Sociology of Culture",
  "unit": "4",
  "discription": "The history of the concept of culture; cultural pluralism in advanced industrialized societies; the differentiation of cultural institutions; cultural policy and social structure; culture as a property of social groups; conflict and accommodation over efforts to change and sustain traditional culture.",
  "prerequsite": null
 },
 {
  "code": "SOCG 222",
  "title": "Social Movements",
  "unit": "4",
  "discription": "An examination of theories accounting for the causes and consequences of social movements, including a discussion of the strengths and weaknesses of such theories for understanding historically specific revolutions, rebellions, and violent and nonviolent forms of protest in various parts of the world.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 225",
  "title": "Comparative Political Economy",
  "unit": "4",
  "discription": "An examination of the history and performance of key economic, political, and social institutions and policies in the United States and other nations. Special attention to similarities and differences across countries, and to strategies of comparative analysis.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 226",
  "title": "Political Sociology",
  "unit": "4",
  "discription": "This course discusses the relationship between state and society in a comparative perspective. The focus is on the interaction among states, domestic economic elites, and external economic and political processes in the determination of different developmental paths. Analytically, it includes topics such as characteristics and functions of the state in different types of society throughout history (with an emphasis on the varieties of capitalist and socialist state), the autonomy of the state and its causes in different settings, and developmental and predatory consequences of state activity. Readings will include both theoretical and empirical materials, the latter dealing mostly with nineteenth- and twentieth-century Europe and twentieth- century Latin America.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 227",
  "title": "Ethnographic Film: Media Methods",
  "unit": "6",
  "discription": "Ethnographic recording of field data in written and audiovisual formats, including film, video, and CD-ROM applications. Critical assessment of ethnographies and audiovisual data in terms of styles, format, and approaches. Graduate students are required to submit a fifteen-page mid-term paper comparing a written and an audiovisual ethnography and a final video ethnography with a project abstract.",
  "prerequsite": "graduate standing; SOCI 1, SOCI 2; or consent of instructor."
 },
 {
  "code": "SOCG 230",
  "title": "Advanced Approaches to Sociological Theory",
  "unit": "4",
  "discription": "This course is a discussion of recent topics in sociological theory, usually focusing on a single approach, like postcolonialism, feminism, or Western Marxism. May be repeated as the topics change.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 232",
  "title": "Advanced Issues in the Sociology of Knowledge",
  "unit": "4",
  "discription": "The social construction of knowledge and the social institutions in which these processes take place are examined. Topics include relationships between knowledge and social institutions, foundations of knowledge in society, knowledge and social interactions, and contrasting folk and specialized theories.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 238",
  "title": "Survey of the Sociology of Scientific Knowledge",
  "unit": "4",
  "discription": "An introduction to some enduring topics in the sociology of scientific knowledge and to some resources for addressing them. Attention is drawn to problems of accounting for scientific order and change, and to recurrent debates over the proper method for sociological accounts of science.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "SOCG 243",
  "title": "Sociology of Social Control",
  "unit": "4",
  "discription": "An examination of the sociological literature on social control, looking at theoretical developments over time and examining the contemporary literature dealing with social control in historical and comparative perspective.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "SOCG 244",
  "title": "Sociology of Race and Ethnicity",
  "unit": "4",
  "discription": "Analysis of enduring topics in the study of race and ethnicity, including stratification, discrimination conflict, immigration, assimilation, and politics. Other topics include racial and ethnic identity and the social construction of race and ethnic categories. A special focus is on the role of “culture” and “structure” for explaining race/ethnic differentiation.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 245",
  "title": "Gender, Work, and the Economy",
  "unit": "4",
  "discription": "This course studies social constructions of gender within economic opportunities and constraints. We read classical sociological theory on this topic; feminist critiques; and newer research on careers, organizations, and markets.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 246",
  "title": "The Welfare State",
  "unit": "4",
  "discription": "Surveys major theories of the development and functioning of the welfare state, addressing the roles of economic development, political institutions, stratification, and culture. The course focuses on the development of the US social provision in comparison with other advanced industrial societies.",
  "prerequsite": null
 },
 {
  "code": "SOCG 247",
  "title": "Madness and Society",
  "unit": "4",
  "discription": "An examination of changing Western responses from the age of Bedlam to the age of Prozac. Topics include the rise and decline of the total institution; the emergence of psychiatry; changing cultural meanings of madness; and the therapeutics of mental disorder.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 252",
  "title": "Research Practicum I",
  "unit": "4",
  "discription": "In this seminar students work on a research project, which might have originated in a paper written for another course. The goal is to produce the first draft of a paper that will be submitted to an academic journal.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 253",
  "title": "Research Practicum II",
  "unit": "4",
  "discription": "In this seminar students revise an existing research paper (usually the one they wrote for Sociology 252) for submission to an academic journal. Emphasis is placed on conceptual development, writing style and structure, and drawing links to the existing theoretical and empirical literature.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 255A",
  "title": "Introduction to Science Studies",
  "unit": "4",
  "discription": "(Same as Phil 209A, HIGR 238, and COGR 225A.) Study and discussion of classic work in history of science, sociology of science, and philosophy of science, and of work that attempts to develop a unified science studies approach. Required for all students in the Science Studies Program.",
  "prerequsite": "enrollment in Science Studies Program."
 },
 {
  "code": "SOCG 255B",
  "title": "Seminar in Science Studies",
  "unit": "4",
  "discription": "(Same as Phil 209B, HIGR 239, and COGR 225B.) Study and discussion of selected topics in the science studies field. Required for all students in the Science Studies Program.",
  "prerequsite": "enrollment in Science Studies Program."
 },
 {
  "code": "SOCG 255C",
  "title": "Colloquium in Science Studies",
  "unit": "4",
  "discription": "(Same as Phil 209C, HIGR 240, and COGR 225C.) A forum for the presentation and discussion of research in progress in science studies, by graduate students, faculty, and visitors. Required of all students in the Science Studies Program.",
  "prerequsite": "enrollment in the Science Studies Program."
 },
 {
  "code": "SOCG 255D",
  "title": "Advanced Approaches to Science Studies",
  "unit": "4",
  "discription": "(Same as COGR 225D, HIGR 241, Phil 209D.) Focus on recent literature in the history, philosophy, and sociology of science, technology, and medicine. Required of all students in the Science Studies Program.",
  "prerequsite": "SOCG 255A is a prerequisite for SOCG 255D; enrollment in Science Studies Program or instructor's permission."
 },
 {
  "code": "SOCG 263",
  "title": "Graduate Seminar in the Sociology of Art",
  "unit": "4",
  "discription": "This seminar explores the production and interpretation of art forms in cross- cultural context. Processes of symbolic and economic exchange in art worlds will be examined from sociological and semiotic perspectives. Contemporary and popular art forms will be analyzed as types of cultural reproduction. Graduate students will be required to submit a project abstract and final research paper of twenty-seven pages.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 264",
  "title": "Economic Sociology",
  "unit": "4",
  "discription": "This course provides an overview of the classical and current debates in the economic sociology literature. It presents theories of the rise of industrial economics and addresses how economic activities are constituted and influenced by institutions, culture, and social structure.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 267",
  "title": "Sociology of Gender",
  "unit": "4",
  "discription": "Course examines social construction of gender focusing on recent contributions to the field, including micro- and macro-level topics, i.e., social psychological issues in the development of gender, gender stratification in the labor force, gender and social protest, feminist methodologies.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 269",
  "title": "The Citizenship Debates",
  "unit": "4",
  "discription": "Will examine the controversies surrounding the construction of the modern citizen and the good society of the liberal outlook, and their alternatives in the communitarian, social-democratic, nationalist, feminist, and multiculturalist perspectives.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 270",
  "title": "Sociology of Education",
  "unit": "4",
  "discription": "The course will begin by discussing the history and goals of education, as well as how sociologists have sought to understand this institution. We will then examine important topics including educational inequality; the dynamics of race, class, and gender in education; higher education; and social and political forces for change in educational forms.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 278",
  "title": "Immigration, Assimilation, and Identity",
  "unit": "4",
  "discription": "This course focuses on theoretical and empirical approaches to the study of immigration, assimilation, and identity. The course will focus primarily on the post-1965 immigrants, but consideration will also be given to earlier waves of immigration.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 282",
  "title": "Immigration and Citizen",
  "unit": "4",
  "discription": "Alternative theories of the relations of immigrants and host societies, and an examination on the debates on, and dynamic of, immigration expansion and restriction. Comparison of the bearing of liberal, communitarian, and ethnic citizenship discourses on the inclusion and exclusion of immigrants and their descendants.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 284",
  "title": "Contemporary Biomedicine",
  "unit": "4",
  "discription": "Develops central themes in medical sociology in order to understand twentieth- and twenty-first century medical practice and research. Topics include authority and expertise; health inequalities; managed care; health activism; biomedical knowledge production; and the construction of medical objects and subjects.",
  "prerequsite": "graduate standing."
 },
 {
  "code": "SOCG 288",
  "title": "Knowledge Capitalism",
  "unit": "4",
  "discription": "This seminar examines the place of scientific knowledge and information and communication technology in the transformation of capitalist economy and society. The class explores new interactions between science studies and social theory of advanced capitalism.",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 290",
  "title": "Graduate Seminar",
  "unit": "4",
  "discription": "A research seminar in special topics of interest to available staff, provides majors and minors in sociology with research experience in close cooperation with faculty. (S/U grades permitted.)",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 298",
  "title": "Independent Study",
  "unit": "1–8",
  "discription": "Tutorial individual guides study and/or independent research in an area not covered by present course offerings. (S/U grades only.)",
  "prerequsite": "graduate standing in sociology; department approval."
 },
 {
  "code": "SOCG 299",
  "title": "Thesis Research",
  "unit": "1–12",
  "discription": "Open to graduate students engaged in thesis research. (S/U grades only.)",
  "prerequsite": "graduate standing in sociology."
 },
 {
  "code": "SOCG 500",
  "title": "Apprentice Teaching",
  "unit": "2–4",
  "discription": "Supervised teaching in lower-division contact classes, supplemented by seminar on methods in teaching sociology. (S/U grades only.)",
  "prerequsite": "graduate standing in sociology. Technology done under the direction of a faculty member. College stamp required. Pass/Not Pass grade only."
 }
]