[
 {
  "code": "TMC 1",
  "title": "First Year Experience",
  "unit": "2",
  "discription": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only.",
  "prerequsite": "open to Marshall College first-year students only."
 },
 {
  "code": "TMC 2",
  "title": "Transfer Year Experience",
  "unit": "2",
  "discription": "This course facilitates academic success at a leading research university by helping students understand and embrace academic and curricular expectations, engage and map cocurricular opportunities, and strengthen critical thinking and organizational, interpersonal, and wellness skills. P/NP grades only.",
  "prerequsite": "open to Marshall College transfer students only."
 },
 {
  "code": "TMC 15",
  "title": "Introduction to Public Service in America",
  "unit": "4",
  "discription": "This course is designed to study, discuss, and analyze the history and current role of public service in the United States. Students will be introduced to the different roles held by the three sectors of the American economic structure (government, business, and nonprofit/public service) with opportunity to provide a critical analysis of those roles within American society.",
  "prerequsite": null
 },
 {
  "code": "TMC 20",
  "title": "Thurgood Marshall College Honors Seminar",
  "unit": "1",
  "discription": "Weekly seminar conducted by UC San Diego faculty and distinguished guest lecturers on topics related to the core curriculum: diversity, justice, and imagination. P/NP grades only.",
  "prerequsite": null
 },
 {
  "code": "TMC 90",
  "title": "Undergraduate Seminar",
  "unit": "1",
  "discription": "These seminars are designed to expose undergraduate students, especially first-year students and sophomores, to exciting research conducted by UC San Diego faculty. P/NP grades only.",
  "prerequsite": "none."
 },
 {
  "code": "TMC 198",
  "title": "Thurgood Marshall College Directed Group Studies",
  "unit": "4",
  "discription": "Directed group studies of a creative project. Designated for TMC students to work as a group on a project supervised by faculty; not included in regular curriculum, where group emphasis would be more beneficial and constructive than individual special studies.",
  "prerequsite": "upper-division standing (ninety units) including lower-division writing requirement (DOC 2 and DOC 3), minimum overall GPA of 2.5 and consent of instructor."
 },
 {
  "code": "TMC 199",
  "title": "Marshall College Special Project",
  "unit": "1–4",
  "discription": "Individual, independent research, or creative work intended to satisfy Marshall College graduation requirement. Designated for Marshall College students, topics are supervised by Marshall faculty in association with the honors seminar and honors projects. A written application describing the project is required. See Office of the Provost. P/NP grades only.",
  "prerequsite": "upper-division students with 2.5 GPA and ninety units and approval of the provost or faculty designee. Honors standing required for honors projects."
 }
]