[
 {
  "code": "USP 1",
  "title": "History of US Urban Communities",
  "unit": "4",
  "discription": "This course charts the development of urban communities across the United States both temporally and geographically. It examines the patterns of cleavage, conflict, convergence of interest, and consensus that have structured urban life. Social, cultural, and economic forces will be analyzed for the roles they have played in shaping the diverse communities of America's cities.",
  "prerequsite": null
 },
 {
  "code": "USP 2",
  "title": "Urban World System",
  "unit": "4",
  "discription": "Examines cities and the environment in a global context. Emphasizes how the world's economy and the earth's ecology are increasingly interdependent. Focuses on biophysical and ethicosocial concerns rooted in the contemporary division of labor among cities, Third World industrialization, and the post- industrial transformation of US cities.",
  "prerequsite": null
 },
 {
  "code": "USP 3",
  "title": "The City and Social Theory",
  "unit": "4",
  "discription": "An introduction to the sociological study of cities, focusing on urban society in the United States. Students in the course will examine theoretical approaches to the study of urban life; social stratification in the city; urban social and cultural systems–ethnic communities, suburbia, family life in the city, religion, art, and leisure.",
  "prerequsite": null
 },
 {
  "code": "USP 4",
  "title": "Introduction to Geographic Information Systems",
  "unit": "4",
  "discription": "This course provides an entry-level introduction to Geographic Information Systems (GIS) and using GIS to make decisions: acquiring data and organizing data in useful formats, demographic mapping, and geocoding.",
  "prerequsite": null
 },
 {
  "code": "USP 5",
  "title": "Introduction to the Real Estate and Development Process",
  "unit": "4",
  "discription": "This course introduces students to the terminology, concepts, and basic practices of real estate finance and development. It surveys real estate law, appraisal, marketing, brokerage, management, finance, investment analysis, and taxation.",
  "prerequsite": null
 },
 {
  "code": "USP 6",
  "title": "Introduction to Global Architecture",
  "unit": "4",
  "discription": "Architecture and design shape our interaction with the built environment. This course covers history of built forms, including iconic work of well-known architects, with emphasis on global movements and power. Why did some ideas and forms travel, while others didn't?",
  "prerequsite": null
 },
 {
  "code": "USP 15",
  "title": "Applied Urban Economics for Planning and Development",
  "unit": "4",
  "discription": "This course explores how economics contributes to understanding and solving urban problems using a \"learn by doing\" approach. Economic analysis will be applied to important issues that planners and developers must deal with, such as land markets, housing, and zoning.",
  "prerequsite": null
 },
 {
  "code": "USP 25",
  "title": "Real Estate and Development Principles and Analysis",
  "unit": "4",
  "discription": "This course will analyze the concepts related to the planning, development, leasing, valuation, and financing of real estate. There will be special emphasis on critical thinking and analytical decision-making by solving real estate problems primarily using Excel and Argus.",
  "prerequsite": null
 },
 {
  "code": "USP 50",
  "title": "Real Estate and Development Colloquium",
  "unit": "2",
  "discription": "In this course, students will attend weekly seminars presented by leading researchers and practitioners in the field of real estate and development. Students will learn about best practices and innovative case studies from the field. Recommended for students interested in the real estate and development minor or major.",
  "prerequsite": null
 },
 {
  "code": "USP 100",
  "title": "Introduction to Urban Planning",
  "unit": "4",
  "discription": "This course is designed to provide an introduction to the fundamentals of urban planning. It surveys important topics in urban planning, including economic development, urban design, transportation, environmental planning, housing, and the history of urban planning.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 101",
  "title": "Introduction to Policy Analysis",
  "unit": "4",
  "discription": "(Same as POLI 160AA.) This course will explore the process by which the preferences of individuals are converted into public policy. Also included will be an examination of the complexity of policy problems, methods for designing better policies, and a review of tools used by analysts and policy makers.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 102",
  "title": "Urban Economics",
  "unit": "4",
  "discription": "(Same as ECON 135.) Economic analysis of why and where cities develop, patterns of land use in cities, why cities sub-urbanize, and the pattern of urban commuting. The course also examines problems of urban congestion, air pollution, zoning, poverty, and crime, and discusses public policies to deal with them. Credit not allowed for both ECON 135 and USP 102.",
  "prerequsite": "ECON 2 or 100A and MATH 10A or 20A."
 },
 {
  "code": "USP 104",
  "title": "Ethnic Diversity and the City",
  "unit": "4",
  "discription": "(Same as ETHN 105.) This course will examine the city as a crucible of ethnic identity exploring both the racial and ethnic dimensions of urban life in the United States from the Civil War to the present.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 105",
  "title": "Urban Sociology",
  "unit": "4",
  "discription": "(Same as SOCI 153.) Introduces students to the major approaches in the sociological study of cities and to what a sociological analysis can add to our understanding of urban processes.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 106",
  "title": "The History of Race and Ethnicity in American Cities",
  "unit": "4",
  "discription": "(Same as HIUS 129.) This class examines the history of racial and ethnic groups in American cities. It looks at major forces of change such as immigration to cities, political empowerment, and social movements, as well as urban policies such as housing segregation.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 107",
  "title": "Urban Politics",
  "unit": "4",
  "discription": "(Same as POLI 102E.) This survey course focuses upon the following six topics: the evolution of urban politics since the mid-nineteenth century; the urban fiscal crisis; federal/urban relationships; the “new” politics; urban power structure and leadership; and selected contemporary policy issues such as downtown redevelopment, poverty, and race.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 109",
  "title": "California Government and Politics",
  "unit": "4",
  "discription": "This survey course explores six topics: 1) the state's political history; 2) campaigning, the mass media, and elections; 3) actors and institutions in the making of state policy; 4) local government; 5) contemporary policy issues; e.g., Proposition 13, school desegregation, crime, housing and land use, transportation, water; 6) California's role in national politics.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 110",
  "title": "Advanced Topics in Urban Politics",
  "unit": "4",
  "discription": "(Same as POLI 102J.) Building upon the introductory urban politics course, the advanced topics course explores issues such as community power, minority empowerment, and the politics of growth. A research paper is required. Students may not receive credit for both POLI 102J and USP 110.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 113",
  "title": "Politics and Policymaking in Los Angeles",
  "unit": "4",
  "discription": "(Same as POLI 103B.) This course examines politics and policymaking in the five-county Los Angeles region. It explores the historical development of the city, suburbs, and region; politics, power, and governance; and major policy challenges facing the city and metropolitan area.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 114",
  "title": "Communication and Social Institutions: Science Communication",
  "unit": "4",
  "discription": "(Same as COMM 114T.) Examine science communication as a profession and unique form of storytelling. Identify who does science communication; how, why, and with what impacts. Highlight science communication's role in democracy, power, public reason, technological trajectories, the sustainability transition, and shifting university-community relations.",
  "prerequsite": "COMM 10 or USP 2."
 },
 {
  "code": "USP 115",
  "title": "Politics and Policymaking in San Diego",
  "unit": "4",
  "discription": "(Same as POLI 103C.) This course examines how major policy decisions are made in San Diego. In analyses the region's power structure (including the roles of nongovernmental organizations and the media), governance systems and reform efforts, and the politics of major infrastructure projects.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 116",
  "title": "California Local Government: Finance and Administration",
  "unit": "4",
  "discription": "(Same as POLI 103D.) This course surveys public finance and administration. It focuses upon California local governments—cities, counties, and special districts—and also examines state and federal relationships. Topics explored include revenue, expenditure, indebtedness, policy responsibilities, and administrative organization and processes.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 120",
  "title": "Urban Planning, Infrastructure, and Real Estate",
  "unit": "4",
  "discription": "This course will explore the interrelationships of urban planning, public infrastructure, and real estate development. These three issues are critical to an examination of the major challenges facing California’s and America’s major metropolitan centers.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 121",
  "title": "Real Estate Law and Regulation",
  "unit": "4",
  "discription": "Examination of regulation of real estate development, as it affects landowners, developers and others private sector actors. Includes underlying public policies, establishment and enforcement of laws and regulations, application of regulations to individual projects, and political considerations in implementing regulations.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 122",
  "title": "Redevelopment Planning, Policymaking, and Law",
  "unit": "4",
  "discription": "This course examines key elements of land use, planning, and law as related to urban redevelopment. It focuses on San Diego case studies, including the Petco Park/East Village redevelopment project and the Naval Training Center (NTC) Redevelopment Area (Liberty Station).",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 123",
  "title": "Law, Planning, and Public Policy",
  "unit": "4",
  "discription": "Examination of the intersection of law and policy, in the form of processes and institutions, as they affect decision-making and program implementation in urban planning and design. Opportunities and constraints in making law and policy. Application to specific case examples.",
  "prerequsite": "upper- division standing or consent of instructor."
 },
 {
  "code": "USP 124",
  "title": "Land Use Planning",
  "unit": "4",
  "discription": "Introduction to land use planning in the United States: zoning and subdivision, regulation, growth management, farmland preservation, environmental protection, and comprehensive planning. May be coscheduled with USP 224.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 125",
  "title": "The Design of Social Research",
  "unit": "4",
  "discription": "Research methods are tools for improving knowledge. Beginning with a research question, students will learn to select appropriate methods for sampling, collecting, and analyzing data to improve their research activities and research results.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 126",
  "title": "Comparative Land Use and Resource Management",
  "unit": "4",
  "discription": "This course evaluates alternative land use, regulatory, and land transfer approaches to the US regime. Considered are overseas reform models for comprehensive land use and resource management and their effects on environmental justice, resource sustainability, and management efficiency and innovation.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 129",
  "title": "Research Methods: Studying Racial and Ethnic Communities",
  "unit": "4",
  "discription": "(Same as ETHN 190.) The course offers students the basic research methods with which to study ethnic and racial communities. The various topics to be explored include human and physical geography, transportation, employment, economic structure, cultural values, housing, health, education, and intergroup relations.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 130",
  "title": "Fieldwork in Racial and Ethnic Communities",
  "unit": "4",
  "discription": "(Same as ETHN 107.) This is a research course examining social, economic, and political issues in ethnic and racial communities through fieldwork. Topics are examined through a variety of research methods which may include interviews and archival, library, and historical research.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 132",
  "title": "African Americans, Religion, and the City",
  "unit": "4",
  "discription": "(Same as ETHN 188.) This course details the history of African American migration to urban areas after World War I and World War II and explores the role of religion in their lives as well as the impact that their religious experiences had upon the cities in which they lived.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 133",
  "title": "Social Inequality and Public Policy",
  "unit": "4",
  "discription": "(Same as SOCI 152.) Primary focus on understanding and analyzing poverty and public policy. Analysis of how current debates and public policy initiatives mesh with alternative social scientific explanations of poverty.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 134",
  "title": "Community Youth Development",
  "unit": "4",
  "discription": "This course examines the integration of youth development and community development in theory and practice as a strategy for addressing adultism. Analyze cases through a cultural lens where local, national, and international youth movements have helped make community development more responsive, inclusive, and culturally sensitive.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 135",
  "title": "Asian and Latina Immigrant Workers in the Global Economy",
  "unit": "4",
  "discription": "(Same as ETHN 129.) This course will explore the social, political, and economic implications of global economic restructuring, immigration policies, and welfare reform on Asian and Latina immigrant women in the United States. We will critically examine these larger social forces from the perspectives of Latina and Asian immigrant women workers, incorporating theories of race, class, and gender to provide a careful reading of the experiences of immigrant women on the global assembly line.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 136",
  "title": "Community Organizing",
  "unit": "4",
  "discription": "Provides an overview of community organizing and considers organizing as both a tactical and strategic approach to effective community building and leadership development. Examines how various communities have approached collaborative leadership, organizing, and community building.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 137",
  "title": "Housing and Community Development Policy and Practice",
  "unit": "4",
  "discription": "History, theory, and practice of US housing and community development. Public, private, and nonprofit sectors shape and implement planning and policy decisions at the federal, state, local and neighborhood levels.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 138",
  "title": "Urban Economic Development",
  "unit": "4",
  "discription": "This course focuses on strategies that policy makers and planners use in their efforts to foster healthy economies. Topics include theories of urban economic development, analytical techniques for describing urban economies, and the politics and planning of economic development.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 139",
  "title": "Urban Design and Economic Development",
  "unit": "4",
  "discription": "This course explores emerging trends in urban design and economic development and their interrelationship. The course focuses on selected community projects and also considers urban governance structures. Various research methods will be applied to urban problems.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 140",
  "title": "Healthy Placemaking",
  "unit": "4",
  "discription": "This course introduces students to the concept and practice of \"placemaking\"—a collaborative process for creating public spaces that are vibrant, equitable, inclusive, and salutogenic. Students will gain an understanding of healthy placemaking as a strategy for building a more just and sustainable society.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 141A",
  "title": "Life Course Scholars Research and Core Fundamentals",
  "unit": "4",
  "discription": "This course introduces students to major concepts, demographic trends, and the diversity of the aging experience. Through site visits, community-based research, and interactions with elders, students will understand the social and structural determinants of health and well-being across the life course.",
  "prerequsite": "upper-division standing and department approval."
 },
 {
  "code": "USP 141B",
  "title": "Life Course Scholars Capstone Project",
  "unit": "4",
  "discription": "In this course, students deepen and apply their knowledge of policy, research, practice, and diverse perspectives on aging. Students participate in collaborative learning and research with local elders, and develop and implement a capstone \"healthy aging project\" in the community.",
  "prerequsite": "successful completion of USP 141A."
 },
 {
  "code": "USP 142A",
  "title": "Urban Challenges: Homelessness in San Diego Core Fundamentals",
  "unit": "4",
  "discription": "This course introduces students to the complexity of homelessness from multiple perspectives including the homeless population itself, service providers, policymakers, community members, and researchers. In addition to classroom learning, students will have the unique opportunity for experiential, place-based learning off campus. ",
  "prerequsite": "upper- division standing and department approval."
 },
 {
  "code": "USP 142B",
  "title": "Urban Challenges: Homelessness in San Diego Fieldwork",
  "unit": "4",
  "discription": "In this course, students will deepen and apply their knowledge of policy, research, practice, and diverse perspectives on homelessness. Students will learn and apply different research methodologies as they conduct faculty- supervised fieldwork on different dimensions of the homelessness crisis. _",
  "prerequsite": "USP 142A and upper-division standing."
 },
 {
  "code": "USP 143",
  "title": "The US Health-Care System",
  "unit": "4",
  "discription": "This course will provide an overview of the organization of health care within the context of the community with emphasis on the political, social, and cultural influences. It is concerned with the structure, objectives, and trends of major health and health-related programs in the United States to include sponsorship, financing, training and utilization of health personnel.",
  "prerequsite": "upper-division standing or consent of instructor. (Offered winter quarter.)"
 },
 {
  "code": "USP 144",
  "title": "Environmental and Preventive Health Issues",
  "unit": "4",
  "discription": "This course will analyze needs of populations, highlighting current major public health problems such as chronic and communicable diseases, environmental hazards of diseases, psychiatric problems and additional diseases, new social mores affecting health maintenance, consumer health awareness and health practices, special needs of economically and socially disadvantaged populations. The focus is on selected areas of public and environmental health, namely: epidemiology, preventive services in family health, communicable and chronic disease control, and occupational health.",
  "prerequsite": "upper-division standing or consent of instructor. (Offered fall quarter.)"
 },
 {
  "code": "USP 145",
  "title": "Aging—Social and Health Policy Issues",
  "unit": "4",
  "discription": "This course will provide a brief introduction to the nature and problems of aging, with emphasis on socioeconomic and health status; determinants of priorities of social and health policies will be examined through analysis of the structure and organization of selected programs for the elderly. Field visits will constitute part of the course.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 146",
  "title": "Research Methods for Built Environment and Active Living",
  "unit": "4",
  "discription": "This course examines urban design’s effects on physical activity. In field experience settings, students will learn about survey, accelerometer, observation, and GIS methods. Quality control, use of protocols, relevance to all ages, and international applications will also be emphasized.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 149",
  "title": "Madness and Urbanization",
  "unit": "4",
  "discription": "This course will provide a historical and theoretical orientation for contemporary studies of the experience of mental illness and mental health- care policy in the American city, with critical attention to racial and ethnic disparities in diagnosis, treatment, and outcomes.",
  "prerequsite": "upper- division standing or consent of instructor."
 },
 {
  "code": "USP 150",
  "title": "Real Estate and Development Law and Regulation",
  "unit": "4",
  "discription": "This course reviews the legal issues, processes, and institutions involved in real estate. Topics include principles of real property law, legislative and judicial institutions, land use and environmental regulation, financial instruments, property transactions, and forms of investment and development entities.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 151",
  "title": "Real Estate Planning and Development",
  "unit": "4",
  "discription": "This course covers the methods and procedures utilized in development from inception to completion. Topics include initial planning, project feasibility and decision-making, partnerships, financing, design, entitlement and approvals, site acquisition, construction management, project completion, leasing, and asset management.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 152",
  "title": "Real Estate Development Finance and Investment",
  "unit": "4",
  "discription": "This course investigates the institutions, instruments, and structures by which investment in real estate is financed. It reviews capital markets, the sources and uses of real estate funds, and the role of government in real estate finance.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 153",
  "title": "Real Estate and Development Market Analysis",
  "unit": "4",
  "discription": "This course examines the analysis of demand for real estate products and site- specific real estate development projects. Consideration is given to relevant factors such as economic change, social attitudes, and changing laws.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 154",
  "title": "Global Justice in Theory and Action",
  "unit": "4",
  "discription": "(Same as POLI 111B.) Discuss the idea of justice from multiple perspectives: theory, philosophy, institutions, markets, social mobilization, politics, and environment. Examine the assets and capabilities of diverse justice-seeking organizations and movements aimed at improving quality of life and place locally, regionally, and globally.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 155",
  "title": "Real Estate Development in Global and Comparative Perspective",
  "unit": "4",
  "discription": "This course compares real estate markets in Asia, Europe, the Middle East, and Latin America. It explores the factors that affect these regions' real estate economies including finance in city systems, emerging markets, development trends, demographic shifts, and urban planning.",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 159A",
  "title": "NAIOP Real Estate University Challenge I",
  "unit": "4",
  "discription": "In this course, students will work together in teams to complete a development proposal for a real world location provided by the San Diego chapter of the Commercial Real Estate Development Association (NAIOP). Students will meet with industry professionals to evaluate the most feasible, highest, and best use of space on the site provided. May be taken for credit up to two times.",
  "prerequsite": "upper-division standing and department approval."
 },
 {
  "code": "USP 159B",
  "title": "NAIOP Real Estate University Challenge II",
  "unit": "2",
  "discription": "In this course, students will work together in teams to complete a development proposal for a real world location provided by the San Diego chapter of the Commercial Real Estate Development Association (NAIOP). Students will meet with industry professionals to evaluate the most feasible, highest, and best use of space on the site provided. May be taken for credit up to two times.",
  "prerequsite": "USP 159A and upper-division standing."
 },
 {
  "code": "USP 160",
  "title": "Research Methods: Analyzing Crime",
  "unit": "4",
  "discription": "This course will cover the methods and context for analyzing crime at national, state, regional, and micro-place levels. Methods will be both qualitative and quantitative as well as include primary and secondary data analysis.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 161",
  "title": "Environmental Design and Crime Prevention",
  "unit": "4",
  "discription": "This course is an introduction to theories and concepts relating to the built and natural environment and crime prevention. Perspectives from planners and criminologists will be discussed, and a real-world project will be used to integrate theory into practice.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 165A",
  "title": "Advanced Special Topics in Housing",
  "unit": "4",
  "discription": "Special topics may include the analysis of particular housing developments; policy issues such as affordable housing, home finance, or fair housing law; or social issues such as displacement or housing inequality. Topics will vary. May be taken for credit up to three times. _",
  "prerequsite": "upper- division standing."
 },
 {
  "code": "USP 165B",
  "title": "Advanced Special Topics in Sustainability",
  "unit": "4",
  "discription": "Topics may include issues such as sea level rise, water conflicts, sustainable food systems; also public or private strategies for sustainable development such as green building or climate action planning. Topics will vary. May be taken for credit up to three times. _",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 165C",
  "title": "Advanced Special Topics in Transportation",
  "unit": "4",
  "discription": "Transportation topics may include policies such as congestion pricing, transit districts, street parking, or road safety regulation; social and legal implications of new transportation technologies; or methods for analyzing transit behavior. Topics may vary. May be taken for credit up to three times. _",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 165D",
  "title": "Advanced Special Topics in Urban Design and Land Use",
  "unit": "4",
  "discription": "Topics may include the analysis of particular landscapes or designs; policy tools such as inclusionary zoning, transit-oriented development, or community benefits agreements; or effects of the built environment, construed broadly. Topics may vary. May be taken for credit up to three times. _",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 167",
  "title": "History of New York City",
  "unit": "4",
  "discription": "(Same as HIUS 123.) New York City breathes history. Whether it is in the music, the literature, or the architecture, the city informs our most basic conceptions of American identity. This course examines the evolution of Gotham from the colonial era to today. ",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 168",
  "title": "History of Los Angeles",
  "unit": "4",
  "discription": "(Same as HIUS 117.) This course examines the history of Los Angeles from the early nineteenth century to the present. Particular issues to be addressed include urbanization, ethnicity, politics, technological change, and cultural diversification.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 169",
  "title": "Introduction to Green Building",
  "unit": "4",
  "discription": "Introduction to green building including the Leadership in Energy and Environmental Design (LEED) rating system which explores sustainable strategies in the built environment including site, energy, water, materials, waste, and health. Develops a general understanding of concepts and prepares students for the LEED GA exam.",
  "prerequsite": "USP 124 and upper-division standing."
 },
 {
  "code": "USP 170",
  "title": "Sustainable Planning",
  "unit": "4",
  "discription": "This course will explore the different factors and processes that shape a sustainable city. Contemporary green planning techniques and values will be evaluated. The course will also discuss planning, designing, and implementation of sustainable facilities that will reduce sprawl.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 171",
  "title": "Sustainable Development",
  "unit": "4",
  "discription": "Sustainable development is a concept invoked by an increasingly wide range of scholars, activists, and organizations dedicated to promoting environmentally sound approaches to economic development. This course critically examines the diverse, often contradictory, interests in sustainability. It provides a transdisciplinary overview of emergent theories and practices.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 172",
  "title": "Graphics, Visual Communication, and Urban Information",
  "unit": "4",
  "discription": "This course examines the use of graphic techniques and tools to explain research, data analysis, and convey ideas with a focus on the built environment. Visual communication for planners/designers using traditional graphic media, electronic media, and visualization are explored.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 173",
  "title": "History of Urban Planning and Design",
  "unit": "4",
  "discription": "The analysis of the evolution of city designs over time; study of the forces that influence the form and content of a city: why cities change; comparison of urban planning and architecture in Europe and the United States.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 174",
  "title": "Regional Governance and Planning Reconsidered",
  "unit": "4",
  "discription": "Regional planning and local governance in California, focusing on San Diego. Current system, the state/local relationship, and the incentives and disincentives for restructuring regional and local governance and planning.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 175",
  "title": "Site Analysis: Opportunities and Constraints",
  "unit": "4",
  "discription": "Introduction to the theory and practice of context-sensitive site analysis, including site selection and programming, site inventory and analysis, and conceptual design. Demonstrates uses of GIS-based sketch planning tools for suitability analysis and project visualization in real world settings.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 176",
  "title": "Binational Regional Governance",
  "unit": "4",
  "discription": "This course explores governance and planning challenges in the California/Baja California binational region. What are the roles of federal, state, and local governments in addressing issues of transportation, land use, water/wastewater management, and safety and security?",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 177A",
  "title": "Urban Design Practicum",
  "unit": "4",
  "discription": "This course is designed to introduce the student to the theory and practice of urban design, the form of the built environment, and how it is created. There is an emphasis on the development within a larger urban context. Renumbered from USP 177. Students may not receive credit for USP 177A and USP 177.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 177B",
  "title": "Advanced Urban Design",
  "unit": "4",
  "discription": "Settlement patterns, design of streets and open space, buildings, and civic space are the setting for public life. This course explores how we design and inhabit cities that are increasingly more populated and dense. Advanced design research, drawing skills required.",
  "prerequsite": "USP 177, USP 177A, or USP 179."
 },
 {
  "code": "USP 179",
  "title": "Urban Design, Theory, and Practice",
  "unit": "4",
  "discription": "Roles of the urban designer, preparing schematic proposals and performance statements, identifying opportunities for and constraints on designers. Each student will prepare a practical exercise in urban design using various urban design methods.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 180",
  "title": "Transportation Planning",
  "unit": "4",
  "discription": "Introduction to the history and current state of urban transportation planning, including the relationship between transportation and urban form; role of automotive, mass transit, and alternative modes; methods for transportation systems analysis; decision-making, regulatory, and financing mechanisms; and public attitudes.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 181",
  "title": "Public Transportation",
  "unit": "4",
  "discription": "Livable cities rely on balanced transportation systems that can mitigate the negative impacts of car-oriented environment and society. This course will explore the role of public transit in creating a balanced transportation system. A variety of public transportation systems will be analyzed.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 182",
  "title": "Gentrification",
  "unit": "4",
  "discription": "\"Gentrification\" refers to the migration of relatively affluent people into less affluent and working-class neighborhoods. We will discuss the differences between gentrification, reinvestment, and urban renewal; the causes of gentrification; and its effects on the businesses and residents. We will also examine the role of public policy in encouraging gentrification or mitigating its most harmful consequences.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 183",
  "title": "The Geography of American Opportunity",
  "unit": "4",
  "discription": "(Same as SOCI 183.) How does where you grow up affect where you end up? This course explores \"who gets what where and why,\" by examining spatial inequalities in life chances across regions, rural and urban communities, and divergent local economies in the U.S. We will \"place\" places within their economic, socio-cultural, and historical contexts. Readings and exercises will uncover spatial variation in inequalities by race/ethnicity, immigrant status, gender, class, and LGBTQIA status that national averages obscure. Students may not receive credit for SOCI 183 and USP 183.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 185A",
  "title": "Real Estate Finance and Development Studio I",
  "unit": "4",
  "discription": "This course introduces students to the challenges of developing and financing real property. Students work in teams to prepare a proposal for a complete site-specific project that incorporates real estate finance, development, and design.",
  "prerequsite": "USP 124, USP 151, and USP 153. Restricted to seniors within the Real Estate and Development major."
 },
 {
  "code": "USP 185B",
  "title": "Real Estate Finance and Development Studio II",
  "unit": "4",
  "discription": "An intensive studio-based experience that culminates in a completed group project that analyzes, evaluates, and presents a site-specific real estate finance and development proposal. The final project includes market analysis, pro forma financial analysis, site analysis, and site design.",
  "prerequsite": "USP 185A."
 },
 {
  "code": "USP 186",
  "title": "Senior Sequence Research Proposal",
  "unit": "6",
  "discription": "Introduces students to the theory and practice of social research including the challenges of writing a scholarly proposal. Students are required to complete one hundred hours of an internship experience while critically examining the relations between social science and society.",
  "prerequsite": "USP 124, one USP technical elective, and one USP Research Methods course. Restricted to seniors within the Urban Studies and Planning major."
 },
 {
  "code": "USP 187",
  "title": "Senior Sequence Research Project",
  "unit": "6",
  "discription": "An intensive research, internship, and writing experience that culminates in an original senior research project. Students learn about the theoretical, ethical, and technical challenges of scholarly research and publication.",
  "prerequsite": "USP 186."
 },
 {
  "code": "USP 188",
  "title": "Field Research in Migrant Communities—Practicum",
  "unit": "4",
  "discription": "(Same as SOCI 188) Mexican Migration Field Research Program: Students work closely with faculty to conduct direct on-the-ground field research in a migrant community. Students work as teams, conducting either surveys, interviews, or ethnographic observations. Students are expected to produce an outline of a research paper based on the results from fieldwork. Conversational fluency in Spanish is recommended. Students will not receive credit for both SOCI 188 and USP 188.",
  "prerequsite": "SOCI 133."
 },
 {
  "code": "USP 189",
  "title": "Special Topics in Urban Planning",
  "unit": "4",
  "discription": "An undergraduate course designed to cover various aspects of Urban Planning. May be taken for credit up to two times.",
  "prerequsite": "upper-division standing."
 },
 {
  "code": "USP 190",
  "title": "Senior Honors Seminar",
  "unit": "4",
  "discription": "Each student enrolled will be required to write an honors essay, a substantial research paper on a current urban policy issue, under the supervision of a member of the faculty. Most often the essay will be based on their previous fieldwork courses and internship. This essay and other written exercises, as well as class participation, will be the basis of the final grade for the course. The seminar will rotate from year to year among the faculty in urban studies and planning.",
  "prerequsite": "USP 186, USP 187, major GPA 3.5, and permission of instructor."
 },
 {
  "code": "USP 191",
  "title": "GIS for Urban and Community Planning",
  "unit": "4",
  "discription": "Introduction to Geographic Information Systems and using GIS to make decisions: acquiring data and organizing data in useful formats, demographic mapping, geocoding. Selected exercises examine crime data, political campaigns, banking and environmental planning, patterns of bank lending and finance.",
  "prerequsite": "USP 4 and upper-division standing."
 },
 {
  "code": "USP 193",
  "title": "San Diego Community Research",
  "unit": "4",
  "discription": "Using the San Diego region as a case study, students will be introduced to the process of collecting, evaluating, and presenting urban and regional data using a variety of methods, including aggregate data analysis, historical research, and ethnography.",
  "prerequsite": "upper-division standing or consent of instructor."
 },
 {
  "code": "USP 194",
  "title": "Research Seminar in Washington, DC",
  "unit": "4",
  "discription": "(Same as COGS 194, COMM 194, HITO 193, POLI 194, SOCI 194, SIO 194.) Course attached to six-unit internship taken by students participating in the UCDC Program. Involves weekly seminar meetings with faculty and teaching assistant and a substantial research paper.",
  "prerequsite": "department approval and participating in UCDC Program."
 },
 {
  "code": "USP 195",
  "title": "Teaching Apprentice—Undergraduate",
  "unit": "2–4",
  "discription": "Introduction to teaching activities associated with course. Responsibilities include preparing reading materials assigned by the instructor, attending course lectures, meeting at least one hour per week with the instructor, assisting instructor in grading, and preparing a summary report to the instructor. May be taken for credit up to three times for a maximum of eight units.",
  "prerequsite": "consent of instructor."
 },
 {
  "code": "USP 198",
  "title": "Directed Group Study",
  "unit": "2–4",
  "discription": "Directed group study on a topic or in a field not included in the regular departmental curriculum by special arrangement with a faculty member.",
  "prerequsite": "upper-division standing and consent of instructor."
 },
 {
  "code": "USP 199",
  "title": "Independent Study",
  "unit": "2–4",
  "discription": "Reading and research programs and field-study projects to be arranged between student and instructor, depending on the student's needs and the instructor's advice in terms of these needs.",
  "prerequsite": "upper-division standing and consent of instructor."
 },
 {
  "code": "USP 224",
  "title": "Land Use Planning",
  "unit": "4",
  "discription": "Introduction to land use planning in the United States: zoning and subdivision, regulation, growth management, farmland preservation, environmental protection, and comprehensive planning. May be coscheduled with USP 124.",
  "prerequsite": "graduate standing and consent of instructor."
 }
]